{
    "url": "https://www.dailymail.co.uk/news/kate_middleton/index.html",
    "title": "Kate Middleton: Latest news, views, gossip, photos and video on Duchess of Cornwall and Cambridge | Daily Mail Online",
    "hash": "ef5790ad777fb5276a18cf7e852cdbdc",
    "text": "Kate Middleton: Latest news, views, gossip, photos and video on Duchess of Cornwall and Cambridge | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKing Charles III\n\n\n\n\n\n\n\n                    \n                    Prince William\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Kate Middleton\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    The Queen Consort\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nKate Middleton\n\n\nLast updated: 02:03 BST, 10 July 2023\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending Kate Middleton News\nEllie Goulding, Brian Cox and Daniel Kaluuya in Wimbledon Royal Box\nKate Middleton has surprising links to Eton College\nAre separate bedrooms secret to Charles and Camilla's happy marriage?\nFans go wild for Lilibet's traditional dress that is like Charlotte's\nWhy are so many Royals wearing Kate's 'ethical' £720 dress? \nKate wows at King Charles' Coronation 2.0 in Scotland\nKate is every inch the proud wife to support William at polo match\nThe truth behind 'mum's day out' at the polo for Kate and Meghan\nRELATED TOPICS FOR Kate Middleton\nPippa Middleton\nCarole Middleton\nDiana\n\n\n\n\n\n\nKate Middleton: Latest news, views, gossip, photos and video on Duchess of Cornwall and Cambridge\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nWho's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n09/07/23 04:12\nMiddle Sunday at Wimbledn saw more stars in the Royal Box on Centre Court. The stars included 1 and top left: Ellie Goulding, 2: Daniel Kaluuya, 3: Richard Curtis, 4: Roger Allam, 5: Richard Osman, 6 and top right: Brian Cox, 7: Ann Jones, 8 and top centre: Sir Ben Ainslie and 9: Georgie Thompson.\n...read\n130\n comment\ns\n1\n video\n5\n share\ns\nFour-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n09/07/23 09:42\nThe late Queen and Prince Philip were thought to retire to separate rooms in the evening and, according to royal expert Joshua Rom, the new King and Queen do the same.\n321\n comment\ns\n26\n share\ns\nIt's famous for educating the Royals. But Kate Middleton has her own intriguing connection with Eton College, the most prestigious school in the country\n09/07/23 07:18\nEton College was always going to be a likely choice for Prince George. Although nothing has been announced, the nine-year-old was recently pictured visiting the ancient school.\n222\n comment\ns\n64\n share\ns\nWhy are so many Royals wearing Kate's 'ethical' £720 dress? \n08/07/23 11:17\nWhen the Princess of Wales stepped out in a dress by Beulah London to open the new-look Young V&A Museum in London, she won plaudits for her sustainability.\n81\n comment\ns\n2\n video\ns\n29\n share\ns\nWho's who in the Royal Box? From Gary Lineker to Sue Barker and Sir Steve Redgrave, we reveal the VIP guests taking in the action at Wimbledon\n08/07/23 02:09\nThe likes of Gary Lineker rubbed shoulders with former broadcaster Sue Barker and Olympic champion Sir Steve Redgrave as the VIP guests took in the action on Centre Court.\n260\n comment\ns\n1\n video\n29\n share\ns\nKate's clever parenting tactic: How Princess is 'easing' sporty Charlotte and George into life in the spotlight\n08/07/23 08:41\nSpeaking to FEMAIL, royal expert Richard Fitzwilliams noted how the Prince and Princess of Wales are purposefully using these types of engagements to get their children used to being in public.\n150\n comment\ns\n4\n video\ns\n125\n share\ns\nIt's time for Wimbledon Doubles: from dots to broderie anglaise, how Kate Middleton loves to recycle dresses at the All England tennis tournament\n08/07/23 07:38\nIf recycling is something of  trend for the sustainable princess, it has been particularly in evidence at Britain's leading tennis tournament.\n425\n comment\ns\n1\n video\n100\n share\ns\nRoyally hard work! How members of The Firm began their careers with surprisingly normal jobs - from serving chips from a van to scrubbing toilets\n07/07/23 03:31\nThese are the jobs which members of the royal family held before they married into The Firm - from working in a yoghurt shop in California to starting a PR business.\n40\n comment\ns\n10\n share\ns\nWho's who in today's Royal Box? From Lady Amelia Windsor to Andrew Lloyd Webber, we reveal the VIP guests taking in the action at Wimbledon\n07/07/23 03:10\nAs the excitement continues for another day at the All England Club in SW19 today, FEMAIL takes a closer look at another star-studded line-up in the Royal Box on Centre Court.\n209\n comment\ns\n1\n video\n27\n share\ns\nMwah, mwah! William's VERY awkward pecks on the cheek for Kate at polo suggest Prince isn't quite so keen on the Princess' frequent PDAs, says body language expert \n07/07/23 01:52\nWhile Kate frequently offers a 'love pat' to William when they're on official engagements, the Prince struggled to look quite so at ease with PDAs at the polo yesterday.\n1\n comment\n1\n video\n49\n share\ns\nHis royal HOTNESS! Fans are left swooning as Prince William shows off his polo skills in charity match - as they declare he has 'King energy'\n07/07/23 08:06\nPrince William's performance in the Out-Sourcing Inc. Royal Charity Polo Cup 2023 at the Guards Polo Club in Windsor left many fans hot under the collar yesterday.\n576\n comment\ns\n142\n share\ns\nShe can't take her eyes off him! The heartwarming moments when Kate and William let their guard down in public and reveal their lasting love\n07/07/23 06:52\nIt was a look of such genuine affection that few could doubt not just the teamwork, but the love  - when the Prince and Princess of Wales were caught sharing a  moment following the Guards polo.\n462\n comment\ns\n113\n share\ns\nALISON BOSHOFF: The Crown gives Prince Andrew a free pass over his friendship with convicted billionaire paedophile Jeffrey Epstein\n06/07/23 11:11\nALISON BOSHOFF: The Royal Family usually needs to adopt the 'brace' position each November, when a new series of The Crown is released by streaming giant Netflix.\n17\n comment\ns\n22\n share\ns\nStyle sisters already! Royal fans go wild for Princess Lilibet's traditional dress and knee socks that are just like Princess Charlotte's (and could she be wearing dad Prince Harry's red toddler shoes?)\n06/07/23 03:03\nPrincess Lilibet was pictured with Harry at an Independence Day parade in Montecito just hours before her grandfather King Charles III attended his second Coronation ceremony in Edinburgh.\n299\n comment\ns\n1\n video\n196\n share\ns\nBlooming beautiful! James Middleton's wife Alizée Thevenet shows off her bump as they attend Wimbledon - hours after announcing they are expecting first baby \n06/07/23 01:44\nPrincess Kate's brother James Middleton and his wife Alizée Thevenet appeared loved up as they attended Wimbledon today - hours after announcing they are pregnant with their first child.\n239\n comment\ns\n31\n share\ns\nPrincess of PDA! Kate embraces William in a sweet kiss after he plays in charity polo match (while also enjoying some champagne with Peter Phillips and Frankie Dettori!) \n06/07/23 01:30\nThe Princess of Wales, 41, was cheering on the Prince, 41, as he took part in the Out-Sourcing Inc. Royal Charity Polo Cup 2023 at the Guards Polo Club in Windsor this afternoon.\n3092\n comment\ns\n1\n video\n414\n share\ns\nKing 'deliberately' put Kate and William 'front and centre' of his Scottish Coronation to 'project the future of the monarchy', royal expert claims \n06/07/23 01:11\nVanity Fair's royal expert Katie Nicholl said it was 'important' to King Charles that William and Kate were 'by his side' for his Scottish Coronation in Edinburgh.\n708\n comment\ns\n2\n video\ns\n189\n share\ns\nTruth behind THAT awkward 'mum's day out': As Kate returns to the polo to support William, how her 2019 outing with Meghan was an effort to show a united front before their feud was exposed \n06/07/23 11:42\nWhile Kate is set to watch Prince William playing polo later today, it's likely to be a far cry from the joint appearance she made alongside the Duchess of Sussex to watch the brothers play in 2019.\n534\n comment\ns\n1\n video\n494\n share\ns\nThe très chic life of Princess Kate's sister-in-law: James Middleton's pregnant wife Alizee Thevenet is a French financier and daughter of a late diplomat who grew up all over the world\n06/07/23 08:42\nPrincess Kate's brother James Middleton revealed yesterday that his French wife Alizée Thevenet is pregnant with the couple's first child.\n76\n comment\ns\n1\n video\n43\n share\ns\nHow do you get a seat in Wimbledon's prestigious Royal Box? And what are strict dos and don'ts? \n06/07/23 07:20\nWimbledon is underway with thousands expected to attend the event, the Royal Box will be filled with the British elite - and even Royalty. But how do you attend Wimbledon's Royal Box?\n111\n comment\ns\n share\ns\nLAURA CRAIK: Why celebrity favourite The Vampire's Wife is on the brink\n05/07/23 09:58\nThe Vampire's Wife, founded by English designer Susie Cave and partners, has been a go-to for everyone from Rachel Weisz to Jennifer Anniston - so its financial problems come as a surprise.\n51\n comment\ns\n26\n share\ns\nEvery woman needs a summer GSD: That's a Green Shirt Dress. And it will be the hardest-working staple in your wardrobe \n05/07/23 09:45\nJust ask the Princess of Wales, who wore a leopard-print version to a recent charity visit, or Samantha Cameron, who chose one for Ascot.\n91\n comment\ns\n21\n share\ns\nROBERT HARDMAN: The King and Queen seemed genuinely touched by an overwhelmingly warm welcome all the way up Edinburgh's Royal Mile - despite a small but noisy republican protest - for a celebration of Scotland's unique royal heritage \n05/07/23 09:07\nROBERT HARDMAN: Presented with crown, sceptre and sword, serenaded by a magnificent repertoire of music, the King must have felt a slight sense of deja vu.\n576\n comment\ns\n2\n video\ns\n29\n share\ns\nEDEN CONFIDENTIAL: Former Labour MP Tristram Hunt sparks row as he pulls trans books and poster from the Young V&A before Kate re-opened museum after £13million redevelopment\n05/07/23 09:00\nEDEN CONFIDENTIAL: Hunt, who is now director of the Victoria and Albert Museum, has sparked a furious row after he ordered the removal of a poster with pro-transgender messages.\n14\n comment\ns\n38\n share\ns\nAuntie Kate! Princess of Wales's brother James Middleton announces his wife Alizée Thevenet is pregnant with their first child\n05/07/23 05:51\nThe entrepreneur, 36, shared a sweet picture of Alizee's growing bump to Instagram today.\n840\n comment\ns\n222\n share\ns\nHousehold Cavalry riders struggle to control horse as it rears up at King Charles' Scottish coronation event \n05/07/23 05:13\nThe Cavalry were once again out in full force today for a large parade through the streets of Edinburgh as the city turned out to show their support for the new King.\n157\n comment\ns\n1\n video\n35\n share\ns\nKate's touching tribute: Princess of Wales opts for Diana's bracelet and earrings while wearing the late Queen's choker for 'Scottish Coronation'\n05/07/23 03:58\nKate, 41,  looked regal in a bespoke Catherine Walker coat dress, which she has worn several times in the past, as she joined other senior royals for a regal procession through Edinburgh.\n471\n comment\ns\n125\n share\ns\nAndy Murray reveals why he invited Nazanin Zaghari-Ratcliffe to Wimbledon - after she admitted to him she 'sometimes missed prison' in Radio 4 interview\n05/07/23 01:38\nLast year, Nazanin Zaghari-Ratcliffe revealed that watching Murray win Wimbledon in 2016 had been a 'joy'. This week, the tennis star invited her to the Royal Box to watch him play in person.\n413\n comment\ns\n40\n share\ns\nCheeky at Coronation 2.0! Kate whispers in William's ear and gives the Prince a gentle tap on the behind in rare PDA as they join Charles and Camilla at Scottish celebration \n05/07/23 01:09\nCheeky Kate Middleton gave Prince William a gentle tap on the behind in a rare public display of affection today as they joined Charles and Camilla for the King's Scottish Coronation.\n1235\n comment\ns\n2\n video\ns\n563\n share\ns\nSinger Natalie Rushdie who's released a charity single in memory of Dame Deborah James reveals Kate's words of support when they met in the Royal Box at Wimbledon\n05/07/23 12:24\nNatalie Rushdie, a singer and friend of late Dame Deborah James, has revealed what Kate Middleton said to her about Deborah when the two met in Wimbledon's royal box.\n22\n comment\ns\n1\n video\n32\n share\ns\nCharles' new day of destiny as Scotland honours its King: Monarch is presented with ancient symbols of power in historic thanksgiving service before he watches flypast stood side by side with Camilla, Kate and William \n05/07/23 12:24\nThe Red Arrows performed a colourful flypast over Edinburgh Castle today in a spectacular finale to King Charles' Scottish Coronation.\n3566\n comment\ns\n5\n video\ns\n463\n share\ns\nInside Kate Middleton and Roger Federer's very playful friendship, from breaking royal protocol with THREE kisses to putting him through his paces on the court\n05/07/23 10:55\nThe Princess of Wales and the tennis ace, both 41, have been friends for years after meeting at Wimbledon, and have shared plenty of playful moments together.\n444\n comment\ns\n64\n share\ns\nKate Middleton weighs in on the jam or cream scone debate as she sets up NHS tea party (but Prince William doesn't agree!)\n05/07/23 07:22\nThe royal couple, 41, were both guests of honour at the event held at St Thomas' Hospital in London yesterday to celebrate the 75th anniversary of the NHS.\n471\n comment\ns\n1\n video\n475\n share\ns\nQueue's that girl? Princess Kate reminisces with Emma Raducanu about getting up 'at the crack of dawn' to join the throngs lining up for a ground pass to get in to Wimbledon \n05/07/23 12:20\nThe Princess of Wales told the 20-year-old British tennis star how she waited in line for tickets to Wimbledon with her father and sister, Pippa Middleton, when she was a little girl.\n177\n comment\ns\n2\n video\ns\n56\n share\ns\nThe Kate British bake off! Prince and Princess of Wales surprise NHS workers with 75th anniversary party - and they even help to make the cake\n04/07/23 09:30\nWilliam and Kate, both 41, arrived early for the NHS Big Tea party to help lay the tables, put the finishing touches to a birthday cake and even try their hand at piping icing on cup cakes.\n1351\n comment\ns\n1\n video\n434\n share\ns\nAndy Murray says he was 'ruthless' during his victory over Ryan Peniston in first round win at Wimbledon... as he's given royal approval by Roger Federer and Princess of Wales on Centre Court\n04/07/23 07:37\nKIERAN GILL AT WIMBLEDON: With the royal approval of Roger Federer, Andy Murray breezed beyond Wimbledon's opening round after the dismissal of fellow Brit Ryan Peniston.\n26\n comment\ns\n1\n video\n11\n share\ns\nMurray aces it! Sir Andy blasts past fellow Brit Ryan Peniston in straight sets to make the second round at Wimbledon - delighting his watching family and a VERY royal box with Princess Kate among his pack of cheerleaders \n04/07/23 05:45\nSir Andy Murray, 36, (pictured) won in straight sets as the Princess of Wales and Roger Federer watched on from the Royal box.\n133\n comment\ns\n3\n video\ns\n119\n share\ns\nWho was who in the Royal Box? As old friends Princess Kate and Roger Federer catch up at Wimbledon 2023, we reveal the VIP guests watching action on centre court\n04/07/23 04:03\nAs the action gets underway at the All England Lawn Tennis Club in SW19, FEMAIL reveals the VERY exclusive line-up in the royal box.\n451\n comment\ns\n1\n video\n140\n share\ns\nPrincess Kate looks thrilled to catch up with old pal Roger Federer as he's honoured at Wimbledon (while wife Mirka concentrates on the action on the court)\n04/07/23 01:38\nThe Princess of Wales, 41, was among those enthusiastically applauding as Federer, 41, was honoured for his stellar sporting achievements on Centre Court today following his retirement.\n2605\n comment\ns\n3\n video\ns\n598\n share\ns\nRoger Federer receives a standing ovation from Centre Court crowd as eight-time Wimbledon champion - sat alongside the Princess of Wales - returns to SW19 for first time since retiring\n04/07/23 12:43\nLEWIS STEELE AT WIMBLEDON: The tennis royalty and his wife Mirka jetted in from Zurich after he performed on stage at a Coldplay gig on Sunday to be given a rousing reception on Tuesday.\n264\n comment\ns\n1\n video\n15142\n share\ns\nReign won't stop play! Cheerful Kate shelters under an umbrella as she watches Katie Boulter at rainy Wimbledon - and gives a nod to tennis whites in a pleated skirt\n04/07/23 10:45\nKate Middleton, 41, didn't let the rain dampen her spirits as she visited Wimbledon to watch Katie Boulter play today. Later she is set to watch Roger Federer be honoured in a special ceremony.\n2140\n comment\ns\n2\n video\ns\n486\n share\ns\nKate's got talent! The eight very impressive skills you didn't know the Princess of Wales has (and the one she's hopeless at!)\n04/07/23 10:16\nVIDEO: She's a princess who can do it all! From playing the piano, to deep diving and even making homemade sausages, Kate has proven she's absolutely unstoppable.\n192\n comment\ns\n1\n video\n55\n share\ns\nKate has 'given Prince William everything he didn't have growing up but Princess Diana's influence on him is clear', royal expert claims\n04/07/23 09:54\nRoyal expert Jennie Bond told Ok! magazine the Prince of Wales' relationship with Kate is 'founded on friendship, passion and mutual respect'.\n271\n comment\ns\n71\n share\ns\nFit for a future Queen? How Kate Middleton is following in Elizabeth II's footsteps with bright block colours - and a never-ending succession of theatrical blazers!\n04/07/23 05:30\nFor official engagements, the Princess of Wales often turns to a tried-and-tested uniform, whether it's her Alexander McQueen coat dresses or Alessandra Rich spotty dresses. \n247\n comment\ns\n98\n share\ns\nEXCLUSIVE Wimbledon is allowing Russian and Belarusian tennis players linked to Kremlin and its allies to compete - including some who have made pro-Ukraine war statements - after being made to sign neutrality pledge \n03/07/23 06:43\nA bombshell document handed to the Mail shows numerous athletes at SW19 have made or liked statements online supporting the invasion.\n356\n comment\ns\n48\n share\ns\nThe rise (and fall) of The Vampire's Wife: How the cult label founded by Nick Cave's model wife Susie went from a red carpet essential for royals and A-listers - to facing liquidation over unpaid tax\n03/07/23 03:36\nThe brand, founded by Susie Cave in 2014, has been served a winding-down petition by HMRC with a hearing in the Royal Courts of Justice set for later this month.\n147\n comment\ns\n1\n video\n15\n share\ns\nCult dress brand The Vampire's Wife beloved by Princess of Wales is facing liquidation: Label worn by stars Cate Blanchett, Kylie Minogue and Sienna Miller is handed 'winding-up petition' over debts accrued during Covid \n03/07/23 01:04\nThe Vampire's Wife has been handed a 'winding-up petition', which would allow the courts to close the firm for failing to settle its outstanding debts.\n131\n comment\ns\n243\n share\ns\nInside Prince William's schooldays at Eton that 'broke royal tradition' - from 'Pop' club to weekly tea with his grandmother... as son George looks set to follow in his footsteps at prestigious Windsor school \n02/07/23 06:55\nWhile the nine-year-old Prince is currently attending Lambrook prep school, it is thought that George will eventually transfer to Eton, where his father spent five happy years.\n215\n comment\ns\n39\n share\ns\nNow where has one seen that outfit before? All the times royal women across Europe have worn the same dress (and looked equally amazing)\n02/07/23 06:54\nThere are rules to being Royal. And even if they vary slightly from country to country, it's no surprise that royal women turn to similar designers - and often the same ones.\n110\n comment\ns\n21\n share\ns\nPolice search for bombs underneath cathedral's floor before 'Coronation 2.0' in Edinburgh after anti-monarchists conspire to rebel\n01/07/23 09:33\nA huge security operation is underway ahead of King Charles's 'second Coronation' in Scotland after police received reports suggesting republican protestors will attempt to disrupt event\n211\n comment\ns\n19\n share\ns\nSprechen sie royal? Princess Anne impressed with a speech in German, but she's not the only member of her family who can speak another language\n01/07/23 12:13\nPrincess Anne also recently showcased her German when she opened CHIO Equestrian Festival in Aachen. Here FEMAIL takes a look at the royals that have learnt additional languages.\n451\n comment\ns\n4\n video\ns\n60\n share\ns\nWant a body like Kate's? I'm a personal trainer and here are the workouts you need to do to get a toned figure like the Princess of Wales (and you might be surprised)\n01/07/23 08:44\nWhat's the secret behind Kate's fabulous figure? A personal trainer reveals just how to get a body like the Princess of Wales...\n935\n comment\ns\n2\n video\ns\n119\n share\ns\nKate 'is playing the long game' and is always aware that 'I am going to be Queen one day': New revelations that Princess of Wales was the one behind royal family's Oprah fightback statement show she is the REAL steely operator in the Palace, sources say\n01/07/23 08:38\nDetails of how the Queen approved the subtle but firm comeback to Harry and Meghan's toxic attack on the monarchy - using the phrase 'recollections may vary' - have emerged in a book.\n1136\n comment\ns\n1\n video\n442\n share\ns\nIt was KATE who insisted 'recollections may vary' line must stay in royal family's fightback statement after Harry and Meghan's Oprah 'racism' storm, new book claims: 'Princess said history would judge The Firm over its response to TV allegations' \n30/06/23 08:49\nBehind the scenes, Kate was even 'steelier' than Prince William in helping devise the robust palace response to the Sussexes' incendiary racism allegations made in an interview with Oprah.\n2369\n comment\ns\n1\n video\n416\n share\ns\nCoronation 2.0! Prince Harry will miss out as his father is made Scotland's Head of State in Edinburgh next week - while William and Kate get a starring role\n30/06/23 03:53\nKing Charles will officially be made Scotland's Head of State in a regal Thanksgiving service at St Giles' Cathedral in Edinburgh - it's thought Prince Harry won't attend.\n33\n comment\ns\n96\n share\ns\nWhat goes on tour, stays on tour... or does it? Royal hen and stag dos revealed - from Princess Diana and Sarah Ferguson being 'arrested' to Meghan Markle's low-key party at Soho Farmhouse\n30/06/23 06:02\nIt is difficult to imagine the royal family conforming to the wild traditions of the stag and hen do but they have enjoyed their last days of freedom with as many antics as any other bride or groom-to-be.\n40\n comment\ns\n17\n share\ns\nAs Kate and William want Princess Charlotte to grow up and have a 'normal job', meet the other royals who do... including the king who's also a pilot\n30/06/23 06:00\nThey belong to a family that is the embodiment of privilege and power. But for the likes of non-working royals Princesses Beatrice and Eugenie they still have to earn their own salaries  like the rest of us.\n377\n comment\ns\n14\n share\ns\nSchool gate Kate! Wonder how the Princess of Wales juggles her many engagements with three under-10s - and still looks so utterly fabulous? The secret: 14 of the 18 visits she's done in the past 8 weeks have been VERY close to home \n30/06/23 12:28\nJuggling a full-time job with being a hands-on parent isn't easy for any of us. Meetings, work calls, drop-offs, pick-ups . . . the to-do list is endless, and that's when everything goes without a hitch.\n637\n comment\ns\n5\n video\ns\n60\n share\ns\nSweet moment Prince William reunites with East Anglian Air Ambulance colleague at the Royal Norfolk Show - and says he 'misses' the team\n29/06/23 03:56\nChatting at an agricultural show in Norfolk today with a doctor he worked with at East Anglia Air Ambulance, Prince William admitted he still hankered after his time there.\n58\n comment\ns\n1\n video\n660\n share\ns\n 'You're the most vocal children I've ever met, including my own!' Delighted Prince William high fives youngsters as he visits the Royal Norfolk Show\n29/06/23 01:27\nPrince William, 41, appeared in excellent spirits today as he dished out high fives and joined the crowds flocking to the Royal Norfolk Show, the UK's largest two-day agricultural event.\n77\n comment\ns\n2\n video\ns\n282\n share\ns\nInside Kate's Marlborough College days: How future Queen flourished from a shy 'bullied' teen to the hockey captain who all the boys 'fancied rotten' at £42,930 a year school\n29/06/23 06:42\nMarlborough College is a prestigious private school, costing £42,930 per year. The Princess of Wales, Jack Whitehall and the artist William Morris are among its former pupils.\n841\n comment\ns\n52\n share\ns\nThe boys are back in town! William's night out with 'court jester' Guy Pelly and school friend James Meade is reminiscent of their wild parties at Boujis with Harry and Kate 20 years ago.. (and amazingly they're still friends with BOTH royal brothers now!)\n28/06/23 06:05\nAfter graduating university in his early twenties, the young royal was often seen stumbling out of west London nightclubs including Boujis, Mahiki and Bunga Bunga.\n100\n comment\ns\n1\n video\n24\n share\ns\nPerfection in pink! Thrifty Kate recycles two-year-old £695 Beulah pink midi dress as she heads to Young V&A event in London \n28/06/23 11:03\nKate Middleton, 41, looked stunning in a £695 crepe midi dress in blush pink by London-based designer Beulah as she opened the museum today.\n210\n comment\ns\n1\n video\n345\n share\ns\n'I'm 41, shh don't tell anyone!' Playful Kate spills her age to inquisitive kids - after she's showered in hugs by the excited youngsters at opening of the Young V&A\n28/06/23 10:04\nThe Princess of Wales, 41, is combining two of her greatest passions today as she reopens the Young V&A museum in London.\n1027\n comment\ns\n2\n video\ns\n512\n share\ns\nPrince William's mini-me! Adorable photos show Princess Charlotte really is her father's doppelganger (and even the Prince of Wales was left confused by one snap!)\n28/06/23 09:32\nAs she continues to grow up before the world, Princess Charlotte has won over the hearts of royal watchers with her large smile and ability to keep both of her brothers in check.\n167\n comment\ns\n1\n video\n120\n share\ns\nDuchess of Edinburgh looks typically stylish in a khaki wrap dress as she opens the new Charfleet Book Bindery in Canvey Island\n27/06/23 04:13\nThe Duchess of Edinburgh looked typically stylish as she opened the new Charfleet Book Bindery in Canvey Island on Tuesday. Sophie, 58, stepped out in an elegant khaki wrap dress.\n66\n comment\ns\n51\n share\ns\nExplained: Why Zara Tindall and Peter Phillips do not have titles and are not working royals - despite being Princess Anne's children\n27/06/23 11:57\nZara Tindall and her brother Peter Phillips are the eldest of the late Queen's eight grandchildren but are the only ones without royal titles.\n177\n comment\ns\n20\n share\ns\n'I see you and I am with you': Princess Kate pens heartwarming message to women going through the justice system at support centre founded by family friend Lady Edwina Grosvenor\n27/06/23 11:47\nThe royal, 41, travelled to Hampshire today to unveil Hope Street.. Hope Street has been developed by the charity One Small Thing, which was founded by Kate's friend Lady Edwina Grosvenor.\n985\n comment\ns\n1\n video\n369\n share\ns\nKate's regal transformation: From a 'nobody' to one of the most photographed women in the world, how the Princess of Wales looks even better now than she did in her 20s \n27/06/23 05:30\nHow does she do it? Whether she's nipping to the shops, hopping on the Tube or undertaking a mammoth schedule of royal engagements, Kate always looks immaculate.\n1292\n comment\ns\n2\n video\ns\n125\n share\ns\nCould Princess Charlotte be one of the first ever girls to attend Eton? George, William and Kate were 'spotted on campus tour' after rumours public school 'could go co-ed' \n26/06/23 11:24\nPrince George , nine, was reportedly spotted taking a look at the boarding school where he could soon become a pupil, with his parents Prince William and Princess Kate, both 41, last week.\n141\n comment\ns\n82\n share\ns\nHow Kate is related to the Queen Mother (and her husband, William...)!\n26/06/23 06:20\nHer ancestors famously toiled underground for generations, mining coal for slave wages in the north of England. Yet the pits where Kate Middleton 's forbears cut coal have a curious resonance\n115\n comment\ns\n66\n share\ns\nKate Middleton challenges Roger Federer at Wimbledon courts\n25/06/23 01:38\nThe Princess of Wales and Roger Federer were playing a doubles match on No3 Court at Wimbledon to highlight the work of ball boys and girls at the tournament.\n comment\ns\n share\ns\n'Dancing sober is a terrible idea!' Prince William cringes over his Coronation concert dance moves in hilarious resurfaced video\n25/06/23 11:09\nThe royal, 41, joined other senior members of the Royal Family at the outdoor concert celebrating King Charles and Queen Camilla's Coronation in Windsor last month.\n333\n comment\ns\n1\n video\n61\n share\ns\n'The Princess of Sport!' Kate Middleton sends royal fans wild as she puts Roger Federer through his paces on Wimbledon court\n25/06/23 09:25\nDuring the four-minute video, which was uploaded on Wimbledon's YouTube channel, the Princess of Wales is seen serving against Federer on the London court.\n352\n comment\ns\n1\n video\n84\n share\ns\nSporty chic! Kate Middleton stuns in £312 of Wimbledon branded sportswear as she takes to the court with Roger Federer\n25/06/23 08:13\nThe royal, 41, has appeared in a new video with the tennis champ,  41, to highlight the work of ball boys and girls at the upcoming London tournament.\n260\n comment\ns\n1\n video\n59\n share\ns\nThe wedding season is here. But which Royal dresses are the most hotly searched by brides-to-be in search of inspiration?\n25/06/23 06:54\nThe  Coronation sent clicks for royal wedding dresses soaring, says new research. Searches have shot up by 1,061 per cent and for weddings by 505 per cent, as the public buries itself in nostalgia.\n100\n comment\ns\n1\n video\n18\n share\ns\nEMILY PRESCOTT: Glastonbury star Freya Ridings reveals she gave a private performance to the Princess of Wales\n24/06/23 10:59\nEMILY PRESCOTT: Singer-songwriter Freya, 29, said it was a 'really, really intimate event', adding: 'They were very humble, lovely, down-to-earth people and I got to meet the family.'\n9\n comment\ns\n31\n share\ns\nHeir BnB! Prince William wants to spend time in Welsh B&Bs and holiday rentals rather than Royal residences \n24/06/23 09:54\nPrince William wants to spend more time in Wales staying in B&Bs and holiday rentals rather than any permanent Royal residence, a palace source has revealed.\n320\n comment\ns\n43\n share\ns\nOh I say... It's the Princess versus King of Wimbledon! Roger Federer proves no match for Kate when they met on the iconic tennis courts\n24/06/23 09:31\nThe Princess of Wales and Roger Federer were playing a doubles match on No3 Court at Wimbledon to highlight the work of ball boys and girls at the tournament.\n1869\n comment\ns\n1\n video\n7799\n share\ns\nRepli-Kate! Expert reveals the real reason the Princess of Wales wears near identical outfits to royal events\n24/06/23 08:57\nSpeaking to FEMAIL, a style expert said the Princess of Wales's 'style personality' has evolved to a trademark aesthetic, which often highlights her athletic figure.\n306\n comment\ns\n1\n video\n97\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/prince_william/index.html",
        "https://www.dailymail.co.uk/news/kate_middleton/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/camilla-parker-bowles-duchess-of-cornwall/index.html",
        "https://www.dailymail.co.uk/news/pippa-middleton/index.html",
        "https://www.dailymail.co.uk/news/carole-middleton/index.html",
        "https://www.dailymail.co.uk/news/diana/index.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}