{
    "url": "https://www.dailymail.co.uk/news/royals/article-12266583/King-Charles-Scottish-coronation-Edinburgh-Thousands-line-streets-celebration.html",
    "title": "Moment King Charles is presented with Crown of Scotland in Coronation ceremony | Daily Mail Online",
    "hash": "83dea338e7ed5fd1847fd62fc1c61834",
    "text": "Moment King Charles is presented with Crown of Scotland in Coronation ceremony | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKing Charles III\n\n\n\n\n\n\n\n                    \n                    Prince William\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Kate Middleton\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    The Queen Consort\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC bosses to meet police TODAY after corporation suspends top presenter who 'paid teenager £35K for explicit photos' - as it emerges he 'phoned the youngster twice when he was exposed and said: \"What have you done?\"'\n\n\n\n\n\n\n\n\n\n\n\n\n'Hooded and marched from my cell I feared I'd be shot... only to be rescued by Roman Abramovich': British volunteer caught fighting in Ukraine reveals how he astonishingly  escaped a death sentence\n\n\n\n\n\n\n\n\n\n\n\n\nUS refuses to release details of Prince Harry's visa application after drug use revelations citing his 'right to privacy' despite his life in the limelight and a six-part Netflix documentary with wife Meghan Markle\n\n\n\n\n\n\n\n\n\n\n\n\nDOMINIC LAWSON: Britain the sick man of Europe? With Germany in recession and France and the Netherlands in chaos, Keir Starmer is plain wrong\n\n\n\n\n\n\n\n\n\n\n\n\nSurge in liver cancer cases is linked to cheap alcohol and junk food by health charity\n\n\n\n\n\n\n\n\n\n\n\n\nJeremy Vine threatens legal action against trolls as BBC stars line up to deny they are the presenter suspended following accusation about paying teen for sexual photos\n\n\n\n\n\n\n\n\n\n\n\n\nCop who unmasked Jimmy Savile as serial paedophile says BBC SHOULD name presenter accused of paying teen for sexually explicit pictures\n\n\n\n\n\n\n\n\n\n\n\n\nTransgender woman is crowned Miss Netherlands for first time in beauty pageant's history and will now compete to become Miss Universe\n\n\n\n\n\n\n\n\n\n\n\n\nHow to ward off the energy vampires sabotaging your aura\n\n\n\n\n\n\n\n\n\n\n\n\nWhy are so many teetotal celebrities selling alcohol?\n\n\n\n\n\n\n\n\n\n\n\n\nDr Max the Mind Doctor: How you can support a family member like Fiona Phillips after they've been diagnosed with Alzheimer's\n\n\n\n\n\n\n\n\n\n\n\n\nTaking five minute 'brain breaks' can increase productivity in tasks by more than 50 per cent, study finds\n\n\n\n\n\n\n\n\n\n\n\n\nBritain's Alabama? Not according to the ethnic minority locals. After a Labour council-funded report claimed York is riddled with 'casual, systemic and structural' racism, ROBERT HARDMAN finds a very different story\n\n\n\n\n\n\n\n\n\n\n\n\nCrackdown on Just Stop Oil zealots who disrupt sporting events: Ministers and police chiefs discuss sending eco-clowns who invade sports pitches to jail\n\n\n\n\n\n\n\n\n\n\n\n\nOne in 10 Brits reveal they don't have single 'real' friend as their social lives are spent on social media and online gaming\n\n\n\n\n\n\n\n\n\n\n\n\nMother-to-be reveals her husband's desperate for their child to have a name that's been in his family for generations - but she hates it\n\n\n\n\n\n\n\n\n\n\n\n\nThe 28-stone horse thief who convinced a rich aristocrat he was her long-lost son - and sparked the most sensational trial since Charles I\n\n\n\n\n\n\n\n\n\n\n\n\nBelarusian Victoria Azarenka calls Wimbledon crowd 'drunks' and gives them a dismissive fist gesture after she is booed off court following her loss to Ukrainian Elina Svitolina in grudge match\n\n\n\n\n\n\n\n\n\n\n\n\nThe most Wimbledon moment ever? Moment umpire stops and berates spectator who opened bottle of champagne just as players were trying to take their shots\n\n\n\n\n\n\n\n\n\n\n\n\nWho was who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n\n\n\n\n\n\n\n\n\n\n\n\nFamily's devastation as second schoolgirl, 8, dies after Wimbledon crash when 4x4 smashed through fence: Parents say victim was 'the light of their lives who embodied joy, kindness and generosity'\n\n\n\n\n\n\n\n\n\n\n\n\n'Postcode lottery' in prostate cancer care costs thousands of lives a year as men in the north east of England are SIX TIMES more likely to receive a diagnosis after it has spread, charity warns\n\n\n\n\n\n\n\n\n\n\n\n\n'I had to travel 100 miles for prostate cancer treatment EVERY day': Patient is forced to make huge daily journey to receive radiotherapy\n\n\n\n\n\n\n\n\n\n\n\n\nMan, 60, is left with bleed on the brain after being randomly attacked while walking with his family in leafy suburb - as police launch hunt for attacker\n\n\n\n\n\n\n\n\n\n\nPrevious\n\n\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCharles' new day of destiny as Scotland honours its King: Monarch is presented with ancient symbols of power in historic thanksgiving service before he watches flypast stood side by side with Camilla, Kate and William\nBy \nRory Tingle, Home Affairs Correspondent For Mailonline\n \n \nPublished:\n \n 13:24 BST, 5 July 2023 \n \n | \n \nUpdated:\n \n 20:54 BST, 5 July 2023 \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \ne-mail\n \n \n \n \n \n \n \n \n463\n \nshares\n \n \n \n \n 3.5k\n \nView \n comments\n \n \n \nAdvertisement\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n\n\n\n\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nKing Charles was presented with the crown jewels of Scotland in a historic thanksgiving serving today before he and Queen Camilla stood side by side with the Prince and Princess of Wales to watch a Red Arrows flypast.  \nThe monarch received the Crown of Scotland, the Sceptre and the Sword of State of the Honours of Scotland - the country's crown jewels - at St Giles' Cathedral in Edinburgh eight weeks after his crowning at Westminster Abbey.  \nWilliam and Catherine, known as the Duke and Duchess of Rothesay north of the border, joined Scotland's leading figures and 100 individuals from all walks of society at the church on the Royal Mile. \nThe Right Reverend Sally Foster-Fulton, Moderator of the General Assembly of the Church of Scotland, delivered the sermon, in which she called for action to tackle global warming to stop the world 'baking to a crisp'.\nA 21-gun salute rang out across the Scottish capital following the historic ceremony, before nine planes left trails of red, white and blue as the royals watched from the Palace of Holyroodhouse. \nDuring the processions \nactivists loudly booed and shouted\n \n'Not My King' from a protest spot yards from \nthe Royal Mile - leading to criticism from royalists who believe they should have been given a less prominent location. \n \nTwo women, 20 and 21, were arrested after allegedly trying to climb over a crowd safety barrier during the event and charged with a breach of the peace. \n \n \n \n \n \n \n \n \n \nQueen Camilla, King Charles III, the Prince and Princess of Wales, watch a Red Arrows flypast at the Palace of Holyroodhouse following a service of thanksgiving\n \n \n \n \n \n \n \n \n \nThe King and Queen posed for a photo with the Prince and Princess of Wales at the Palace of Holyroodhouse\n \n \n \n \n \n \n \n \n \nKing Charles is presented with the Crown of Scotland during his Scottish Coronation at St Giles' Cathedral in Edinburgh watched by his wife, Queen Camilla, and the Prince and Princess of Wales\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrincess Anne at the Palace of Holyroodhouse in Edinburgh this afternoon \n \n \n \n \n \n \n \n \nWhat are the Honours of Scotland?\n \n \nConsisting of the priceless crown, sceptre and Sword of State, the Honours of Scotland were first used together at a Coronation in 1543 for Mary, Queen of Scots when she was just nine months old.\nThey were later used to crown her son, James VI - who went on to become James I of England - in 1567, Charles I in 1633 and Charles II in 1651. The Crown of Scotland, the impressive centrepiece of the collection, was placed on the coffin of the late Queen during a moving service at St Giles' Cathedral after her death last year.\nIt features a circlet made of Scottish gold with 22 gemstones, 20 precious stones including diamonds and amethysts and freshwater pearls from Scottish rivers. Four gold arches rise to an orb which is painted blue and decorated with stars and a gold cross sits on top, which is studded with a large amethyst and eight pearls.\nMade of solid silver, the sceptre was a gift from Pope Alexander VI to James IV in 1494. It was re-modelled and lengthened in 1536 and has small figures of the Virgin and Child, St James and St Andrew as well as a polished globe of rock crystal.\nThe Sword of State was also a papal gift from Pope Julius II to James IV in 1507 and the blade features figures of St Peter and St Paul and Pope Julius's inscription. The silver-gilt handle is decorated with oak leaves and acorns to symbolise the risen Christ and the scabbard is made of wood covered in dark red velvet and mounted with silver gilt.\nScotland's crown jewels have not had a smooth or easy journey to their present-day display cabinet at Edinburgh Castle. In mid-17th century, the hoard had to be hidden from Oliver Cromwell - who had already melted down the English Crown Jewels - and they were taken to Dunnottar Castle in Aberdeenshire before being buried in a nearby church. \nAdvertisement\n\n\n \nFor the service, the Princess of Wales wore a Catherine Walker coat, hat by Philip Treacy and a necklace from the late Queen's collection, while her husband was dressed in his RAF No1 uniform. \nIn a touching moment, the pair were seen joking with each other as the service got underway.\nDelivering the sermon, the Right-Reverend Foster-Fulton told the congregation that society will be on the 'right track' if we understand that 'the Heavens and Earth' are not 'human commodities or possessions'.\n'Blessed are we, on the right track are we when we understand that our children do not inherit this Earth from us - we have borrowed it from them,' she said.\n'And it is our duty to return it still singing and surging and bathing, not baking to a crisp.'\nCharles spoke extensively before becoming King about the importance of the environment, tackling climate change and protecting wildlife. \nHe runs his Aston Martin sportscar on sustainable fuel and even recycles his bathwater at Clarence House.\nToday, spectators watched a people's procession make its way from Edinburgh Castle to the cathedral - a group around 100 strong, reflecting all aspects of Scottish society from the arts and politics, to education, civil society and business, including charities which the King supports as patron.\nAt its head was Shetland pony Corporal Cruachan IV, regimental mascot of the Royal Regiment of Scotland.\nProtesters and royal fans lined the streets, with republican groups chanting 'Not my King' countered by others shouting 'God save the King'.\nParticipants from the people's procession sat in the cathedral's pews as the Moderator said ideals like 'mercy and peace' should not be 'domesticated or downgraded' but be the 'fabric of our being'.\nShe also said that society is on the 'right track' if people are 'brave enough' to 'choose collaboration and trust over fear-filled circling of our wagons'.\n'Sisters and brothers, look around you. We are one global neighbourhood - intricately inter-related and completely co-dependent, woven together, like a tartan,' she said.\n \n \n \n \n \n \n \n \n \nThe Red Arrows fly over the Royal Mile as part of a National Service of Dedication and Thanksgiving to mark the Coronation of Britain's King Charles and Queen Camilla, in Edinburgh,\n \n \n \n \n \n \n \n \n \nThe Royal Airforce Red Arrows fly past after a National Service of Thanksgiving and Dedication in Edinburgh on Wednesday \n \n \n \n \n \n \n \n \n \nCharles is presented with the Crown during today's service, which came eight weeks after Charles and Camilla were crowned in an ancient ceremony at Westminster Abbey where the King made a pledge to 'serve' \n \n \n \n \n \n \n \n \n \nThe Crown of Scotland had  placed on the coffin of Charles' mother the late Queen during a moving service at St Giles' Cathedral after her death last year\n \n \n \n \n \n \n \nThe Princess and Prince of Wales stand alongside King Charles and Queen Camilla for their Scottish Coronation in St Giles' Cathedral in Edinburgh \n \n \n \n \n \n \n \n \n \nKing Charles laughed as William and Catherine smiled as they shared a light moment before this afternoon's service  \n \n \n \n \n \n \n \n \n \nWilliam and Catherine - who are known in Scotland as the Duke and Duchess of Rothesay, walk down the aisle of St Giles' Cathedral \n \n \n \n \n \n \n \n \n \nThe Kings Life Guard of the Household Cavalry proceed down the Royal Mile\n \n \n \n \n \n \n \nA Household Cavalry horse rears up at the Palace of Holyroodhouse in Edinburgh \n \n \n \n \n \n \n \n \n \n \nmore videos\n \n \n \n \n \n \n \n \n \n \n \n1\n \n \n \n2\n \n \n \n3\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nWatch video \n \nPeople in York deny city is a 'hotbed of casual and systemic racism'\n \n \n \n \n \n \n \nWatch video \n \nUkranian soldiers are seen thriving in a trench in new video\n \n \n \n \n \n \n \nWatch video \n \nPassengers attempt to break up fight that erupted on Ryanair flight\n \n \n \n \n \n \n \nWatch video \n \nAunt claims minor niece 'sold for sex' to marine on San Diego base\n \n \n \n \n \n \n \n \n \n \n \nWatch video \n \nCops on scene at Crowne Plaza Hotel after two stabbed in Surrey\n \n \n \n \n \n \n \nWatch video \n \nWoman films backyard turned into raging torrent in fatal NY flooding\n \n \n \n \n \n \n \nWatch video \n \nFeral cat traps to be rolled out to preserve 'native species'\n \n \n \n \n \n \n \nWatch video \n \nRoads turn to rivers as New York smashed by flash flooding\n \n \n \n \n \n \n \n \n \n \n \nWatch video \n \nCars and houses flooded as NY state smashed by heavy rainfall\n \n \n \n \n \n \n \nWatch video \n \nInside the poison garden at Alnwick Castle that has venomous plants\n \n \n \n \n \n \n \nWatch video \n \nMoment woman struck by lightning during massive storm in Russia\n \n \n \n \n \n \n \nWatch video \n \nVisit Valencia touts city's warm 'vibes' and incredible traditions\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThe service will feature centuries-old aspects of Scottish royal tradition along with new additions such as pieces of music written specially for the occasion, a psalm sung in Gaelic and the use of passages from the New Testament in Scots\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShare\n\n\nFollow\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you make a purchase using links on this page, MailOnline will earn an affiliate commission\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLook regal in blue like Kate wearing Catherine Walker\n\n\n\n\n\n\n\n\n\n\nCatherine Walker bespoke coat\n\n\nSee a similar style\n\n\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\nThe Prince and Princess of Wales made a dazzling entrance at the King's Scottish Coronation in Edinburgh.\n\n\nWe were delighted to see Kate rewearing her Catherine Walker cobalt blue coat for the third time. \n\n\nIt's evident why this design has become a beloved choice in her wardrobe. With its flattering fit, contrasting velvet collar and single-breasted front, it exudes timeless chic. \n\n\nOn this occasion, Kate accessorised with a Philip Treacy hat, Emmy London court shoes, Princess Diana's pearl earrings and the late Queen's Garrard necklace.\n\n\nIf you're interested in recreating this look, head directly to the shopping carousel. We have lined-up a selection of outerwear, as well as Kate's stunning heels.\n\n\n\n\n\n\n\n\n\n\n\n\n...NOW GET ONE LIKE IT\n\n\n\n\n\n\n\n\n\n\n\n\nPrevious\n\n\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    £445\n                                                \n\n\n\n\n\n\n\n\n\n\nEmmy London 'Rebecca' court shoes\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    £155\n                                                \n\n\n\n\n\n\n\n\n\n\nSosandar coat\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    £45\n                                                \n\n\n\n\n\n\n\n\n\n\nBoohoo coat (now reduced to £12)\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    £299\n                                                \n\n\n\n\n\n\n\n\n\n\nHobbs 'Tilda' coat at John Lewis & Partners (now reduced to £209)\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    £85\n                                                \n\n\n\n\n\n\n\n\n\n\nThreadbare coat at Debenhams (now reduced to £59.80)\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    £75\n                                                \n\n\n\n\n\n\n\n\n\n\nAsos Design coat (now reduced to £49)\n\n\n\n\n\n\nBuy now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n \n \n \n \n \n \n \nCatherine and William share a brief chat as the King prepares to be presented with the Honours of Scotland \n \n \n \n \n \n \n \n \n \nThe Princess of Wales placed a supportive arm on her husband's back after the ceremony in Edinburgh \n \n \n \n \n \n \n \n \n \nThe Right Reverend Sally Foster-Fulton delivered a ceremony on the importance on caring for the environment \n \n \n \n \n \n \n \n \n \nThe Moderator of the General Assembly of the Church of Scotland, Rt Rev Sally Foster-Fulton, will preach the sermon and then provide a blessing to close the service\n \n \n \n \n \n \n \n \n \nGuests and dignitaries arrive for the National Service of Thanksgiving and Dedication at St Giles' Cathedral \nScotland's First Minister, Humza Yousaf, gave a Bible reading from the Old Testament during the service, and Olympic rower Dame Katherine Grainger carried the Sword of State.\n \nREAD MORE - \nEdward and Sophie attend service at Westminster Abbey to mark 75 years of the NHS\n \n \nAdvertisement\n\n\n \nThe Rt Rev Foster-Fulton concluded by telling the King and Queen: 'Your Majesties, you have made it part of your mission to speak alongside creation, advocating for it. \n;As we present the Honours of Scotland to you, we commit ourselves to walking that journey with you.\n'We are all a small part of something so much bigger - this beautiful, sacred creation and everyone and everything in it. Thanks be to God.'\nMajor General Alastair Bruce, governor of Edinburgh Castle, watched the people's procession set off from the fortress' esplanade, and it was joined by four mounted elements of the Scots Dragoon Guards, the Pipes & Drums of Robert Gordon's Combined Cadet Force and the 51 Brigade Cadet Military Band.\nCrowds lining crash barriers along the royal mile to watch Corporal Cruachan IV, the Shetland pony regimental mascot of The Royal Regiment of Scotland, leading the men of women in the procession.\n \n \n \n \n \n \n \n \n \nWilliam and Catherine, known as the Duke and Duchess of Rothesay in Scotland, were part of the royal procession and entered the cathedral behind the monarch and his wife\n \n \n \n \n \n \n \n \n \nCatherine wore a Catherine Walker coat, hat by Philip Treacy and a necklace from the late Queen's collection\n \n \n \n \n \n \n \n \n \nThe Prince and Princess of Wales leave the Palace of Holyroodhouse on their way to St Giles' Cathedral \n \n \n \n \n \n \n \n \n \nKing Charles arriving at St Giles' Cathedral for the National Service of Thanksgiving and Dedication\n \n \n \n \n \n \n \n \n \nThe King looked in jubilant mood as he was greeted by dignitaries\n \n \n \n \n \n \n \n \n \nThe honours of Scotland - the country's crown jewels - leave Edinburgh Castle in a procession to St Giles's Cathedral for a service to honour the King and Queen\n \n \n \n \n \n \n \n \n \nThe Crown, the Sceptre and the Sword of State travelled by car under military guard\nThe Honours of Scotland, crown, sword of state and sceptre, will soon follow escorted by military personnel from across the Royal Navy, Army and Royal Air Force and the Royal Company of Archers, who act as the King's body guard in Scotland. \nThree sisters, Julie Avery, 51, from Birmingham, Karen Shortiss, 54, from Penicuik, Midlothian, and Linda Halfpenny, 67, from New Zealand, were among those gathered along the Royal Mile to see Charles and Camilla.\nMrs Halfpenny has lived in New Zealand for 42 years and is in Britain to see her two sisters.\nHer time at home coincided with Charles and Camilla's visit to Scotland, so she phoned her sisters and asked if they could attend the event with her.\nMrs Avery said: 'Linda is over here visiting and last week she sent me a message asking if I could have Wednesday off and could I come up, so I said 'Yes alright.'\n'I came up last night and I'll go home tomorrow morning to go to work tomorrow afternoon.'\nMrs Shortiss said: 'We'll spend the day together as well.'\n \n \n \n \n \n \n \n \n \nAnti-monarchy activists could be heard booing and shouting 'Not My King' from a protest spot just yards from the procession route \n \n \n \n \n \n \n \n \n \nMembers of the Household Calvary Mounted Regiment lead the Royal Procession along the Royal Mile \n \n \n \n \n \n \n \n \n \nThe Scottish Coronation celebrations began today with a People's Procession that set off down the Royal Mile from Edinburgh Castle at 1.15pm\n \n \n \n \n \n \n \n \n \nA general view of the Combined Cadet Force Pipes and Drums and the Cadet Military Band as they proceed down the Royal Mile\n \n \n \n \n \n \n \n \n \nThe Kings Life Guard of the Household Cavalry march down the Royal Mile this afternoon \n \n \n \n \n \n \n \n \n \nMembers of the Royal Company of Archers leave the Palace of Holyroodhouse \n \n \n \n \n \n \n \n \n \nThe Royal Company of Archers are the King's official bodyguard while he is in Scotland \n \n \n \n \n \n \n \n \n \nAn aerial photo showing massed bands processing down the Royal Mile in Edinburgh today \n \n \n \n \n \n \n \n \n \nA group of mounted soldiers pass thousands of people who had gathered to witness the historic moment \n \n \n \n \n \n \n \n \n \nThe members of the People's Procession were chosen to reflect all walks of life in Scotland  \n \n \n \n \n \n \n \n \n \nMembers of the People's Procession - pictured here - were chosen to represent all walks of life in Scotland  \n \n \n \n \n \n \n \n \n \nThose taking part in the procession down the Royal Mile included community volunteers and NHS workers \n \n \n \n \n \n \n \n \n \nLeader of the House of Commons Penny Mordaunt arrives for the National Service of Thanksgiving and Dedication for King Charles III and Queen Camilla\n \n \n \n \n \n \n \n \n \nScotland's First Minister Humza Yousaf (left) will give a reading during the service\nMrs Halfpenny said she had 'come a long way' and the sisters wanted a 'good position' to be able to see the royal procession.\nAlso in the crowd were four women from Italy, wearing fascinators and carrying royal family teacups.\nThey are on a business trip in Scotland and came along at midnight yesterday to scope out their position in the crowd, but arrived at 8.30am today.\nCiara, from Bologna, said: 'We like the royal family and we want to share with our community to show what happened.'\nPaula, also from Bologna, added: 'We want to show our support to the new King.'\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nWell wishers on the Royal Mile in Edinburgh ahead of King Charles' Scottish Coronation \n \n \n \n \n \n \n \n \n \nOnlookers waving Union flags were interspersed with anti-monarchy protesters holding 'Not My King' banners \n \n \n \n \n \n \n \n \n \nMembers of the public wait outside St Giles' Cathedral in Edinburgh, where the main ceremony will take place \n \n \n \n \n \n \n \n \n \nMembers of the public wait outside St Giles' Cathedral ahead of the historic ceremony \n \n \n \n \n \n \n \n \n \nThere is tight security on the Royal Mile to try to stop the procession being interrupted by protesters \nElsewhere in the crowd was Margaret Jenkins, 62, from East Lothian, who said: 'I'm excited to see King Charles, my King, and I know not everyone would agree.'\nAnne Connolly, 65, from South Shields, said: 'It's a good day out. We're looking forward to seeing the King and Camilla.'\nReferring to an area fenced off for protesters outside the cathedral, she said: 'They've given the protesters the best spot here, the best view. It isn't fair.'\nProtesters gathered outside the High Court building holding placards saying 'Not My King'. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSupporters of the monarchy gathered alongside republicans before King Charles and Queen Camilla's Scottish Coronation in Edinburgh today \n \n \n \n \n \n \n \n \n \nThe two groups stood alongside each other separated by small groups of stewards \n \n \n \n \n \n \n \n \n \nAnti-monarchy activists chanting 'Not My King' were met with Union flag waving royal fans \nOne of the protesters said that the royal family is a 'symbol of the state the country is in'.\nShe said: 'They are a classic example of people who have too much when people have so little.\n'It's not a personal thing against the King, but it is a democratic disgrace that he has this unelected position in a modern country.'\nShe said protesters had received an 'absolutely fabulous' response from passers-by.\nShe added: 'It's mostly tourists and they all find it very strange that we still have this odd constitutional quirk.'\nFootage showed the republicans being greeted with an equally loud response from supporters of the \nRoyal Family\n chanting 'Charles King of Scots' while waving Union flags. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSupporters of the Royal Family gathered in Edinburgh today alongside a crowd of anti-monarchy protesters (left) \n \n \n \n \n \n \n \n \n \nOne man outside St Giles' Cathedral held a sign reading 'only the tourists are cheering' \n \n \n \n \n \n \n \n \n \nAnother controversially branded King Charles III 'king of the tax dodgers'. \n\n\n\n\n\n\n\n\nShare or comment on this article: \n                        \n\n\nMoment King Charles is presented with Crown of Scotland in Coronation ceremony\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ne-mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n463\n\n\nshares\n\n\n\n\n\n\n\n\n\n\nThe BBC commentary is trying really hard to talk u...\n\n\nby \nCardiffian2020\n\n\n\n\n1428\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nComments \n3570\n\n\n\n\t    Share what you think\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNewest\n\n\n\n\n\n\n\n\n\n\nOldest\n\n\n\n\n\n\n\n\n\n\nBest rated\n\n\n\n\n\n\n\n\n\n\nWorst rated\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nView all\n\n\n\n\n\n\n\n\n\n\nThe comments below have not been moderated.\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nView all\n\n\n\n\n\n\n\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    \n\n\n\n\n\n\nWe are no longer accepting comments on this article.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNEW ARTICLES\nHome\nTop\n\n\nShare\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/prince_william/index.html",
        "https://www.dailymail.co.uk/news/kate_middleton/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/camilla-parker-bowles-duchess-of-cornwall/index.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280727/British-volunteer-Ukrainian-army-reveals-Roman-Abramovich-helped-escape-death-sentence.html",
        "https://www.dailymail.co.uk/news/article-12281405/Homeland-Security-REFUSES-reveal-details-Prince-Harrys-visa-right-privacy.html",
        "https://www.dailymail.co.uk/news/article-12281237/Surge-liver-cancer-cases-linked-cheap-alcohol-junk-food-health-charity.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280709/Cop-unmasked-Jimmy-Savile-says-BBC-presenter-centre-allegations.html",
        "https://www.dailymail.co.uk/news/article-12280819/Transgender-woman-crowned-Miss-Netherlands-time.html",
        "https://www.dailymail.co.uk/news/article-12280913/After-report-claimed-York-riddled-racism-ROBERT-HARDMAN-finds-different-story.html",
        "https://www.dailymail.co.uk/news/article-12281805/Ministers-police-chiefs-urge-jail-Just-Stop-Oil.html",
        "https://www.dailymail.co.uk/news/article-12280763/One-10-Brits-reveal-dont-single-real-friend.html",
        "https://www.dailymail.co.uk/news/article-12280893/The-28-stone-horse-thief-convinced-rich-aristocrat-long-lost-son.html",
        "https://www.dailymail.co.uk/news/article-12281115/Moment-Wimbledon-umpire-urges-spectators-not-open-champagne-mid-game.html",
        "https://www.dailymail.co.uk/news/article-12280627/Second-child-dies-Wimbledon-school-crash.html",
        "https://www.dailymail.co.uk/news/article-12280457/Man-60-left-bleed-brain-random-attack-Richmond.html",
        "https://www.dailymail.co.uk/news/article-12265875/Anti-monarchists-chanting-Not-King-protest-alongside-rival-royalists-Edinburgh.html",
        "https://www.dailymail.co.uk/news/article-12265875/Anti-monarchists-chanting-Not-King-protest-alongside-rival-royalists-Edinburgh.html",
        "/video/news/video-2975577/VIDEO-People-York-deny-city-hotbed-casual-systemic-racism.html",
        "/video/news/video-2975655/Video-Ukranian-soldiers-seen-thriving-trench-new-video.html",
        "/video/news/video-2975387/Video-Passengers-attempt-break-fight-erupted-Ryanair-flight.html",
        "/video/news/video-2975639/Video-Aunt-claims-minor-niece-sold-sex-marine-San-Diego-base.html",
        "/video/news/video-2975545/Video-Police-scene-Crowne-Plaza-Hotel-two-stabbed-Surrey.html",
        "/video/news/video-2975719/Video-Woman-films-backyard-turned-raging-torrent-fatal-NY-flooding.html",
        "/video/news/video-2975669/Video-Feral-cat-traps-rolled-preserve-native-species.html",
        "/video/news/video-2975713/Video-Roads-turn-rivers-New-York-smashed-flash-flooding.html",
        "/video/news/video-2975629/Video-Cars-houses-flooded-NY-state-smashed-heavy-rainfall.html",
        "/video/news/video-2975543/Video-Inside-poison-garden-Alnwick-Castle-venomous-plants.html",
        "https://www.dailymail.co.uk/news/article-12266285/Prince-Edward-Sophie-attend-service-Westminster-Abbey-mark-75-years-NHS.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}