{
    "url": "https://www.dailymail.co.uk/news/queen-letizia-of-spain/index.html",
    "title": "Queen Letizia of Spain - News and Updates on the wife of King Felipe VI | Daily Mail Online",
    "hash": "78b9108016c2afd4d6a8eedb35207385",
    "text": "Queen Letizia of Spain - News and Updates on the wife of King Felipe VI | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKing Charles III\n\n\n\n\n\n\n\n                    \n                    Prince William\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Kate Middleton\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    The Queen Consort\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nQueen Letizia of Spain\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending Queen Letizia of Spain News\nPrincess Leonor of Spain, 17, visits military academy she will attend\nThe times when royal women have worn exactly the same dresses\nQueen Letizia of Spain's daughters Leonor and Sofia ooze glamour\nRoyals and their engagement rings - including one worth £1.2million\nSecrets of Queen Letizia of Spain's diet and fitness regime\nPrincess Leonor of Spain and Infanta Sofia look elegant in Girona\nEurope's smartest royals (but how does Kate Middleton measure up)\nScandalous life of King Juan Carlos - bedroom antics to £50m gift row\nRELATED TOPICS FOR Queen Letizia of Spain\nKing Felipe VI of Spain\nKing Juan Carlos\n\n\n\n\n\n\nQueen Letizia of Spain - News and Updates on the wife of King Felipe VI\nPage\nPrev\n1\n2\n3\n4\nNext\nA Queen in waiting! Princess Leonor of Spain, 17, looks radiant in white as she joins her parents to visit the military academy she will attend in September\n07/07/23 12:28\nThe heir to the Spanish throne, 17, visited Academia General Militar in Zaragoza, where she will study for three years from September as part of her mandatory military training. As she stepped out with her parents, Queen Letizia and King Felipe (pictured right with her mother and inset with both her parents), the royal looked regal as ever as she prepares to step into the spotlight as the future Spanish monarch.\n...read\n202\n comment\ns\n58\n share\ns\nJust like their mother! Queen Letizia of Spain's daughters Leonor, 17, and Sofia, 16, are perfectly poised as they attend awards ceremony with their parents in Girona\n06/07/23 10:42\nPrincess Leonor, 17, and Infanta Sofía, 16, looked in high spirits as they went to the event at the Camiral Caldes de Malavella Hotel in Girona yesterday alongside their parents.\n60\n comment\ns\n57\n share\ns\nPerfect princesses! Queen Letizia of Spain's daughters Leonor, 17, and Sofia, 16, twin in blue dresses as they make an appearance alongside their parents in Girona\n05/07/23 01:55\nPrincess Leonor, 17, and Infanta Sofía, 16, matched with their mother, Queen Letizia of Spain, 50, as they donned blue at at Hotel Camiral Caldes de Malavella in Girona today.\n35\n comment\ns\n40\n share\ns\nNow where has one seen that outfit before? All the times royal women across Europe have worn the same dress (and looked equally amazing)\n02/07/23 06:54\nThere are rules to being Royal. And even if they vary slightly from country to country, it's no surprise that royal women turn to similar designers - and often the same ones.\n110\n comment\ns\n21\n share\ns\nArmed and ready! Queen Letizia of Spain shows off her VERY toned biceps in a sleeveless top as she visits  Student Residence cultural centre in Madrid\n27/06/23 12:03\nThe mother-of-two, 50, was photographed attending a Residencia de Estudiantes 'Students Residence' meeting in Madrid.\n12\n comment\ns\n11\n share\ns\nHow DOES Queen Letizia get such fabulously sculpted arms? (A clue: coffee, pizza, frozen food and alcohol are all banned...)\n26/06/23 11:30\nSpain's Queen Letizia  displayed her remarkably sculpted arms again this week with another toned display on a visit in Madrid. So, how does she do it?\n229\n comment\ns\n42\n share\ns\nCan't beat a little black dress! Queen Letizia of Spain shows off her VERY toned arms in a chic satin number at award ceremony in Madrid\n23/06/23 06:14\nQueen Letizia of Spain, 50, showed off her toned arms and summer tan as she stepped out in a little black dress at an award ceremony in Madrid tonight\n2\n comment\ns\n52\n share\ns\nA sight in white! Queen Letizia of Spain looks sensational in power suit alongside King Felipe at the Princess Of Asturias Foundation meeting in Madrid\n22/06/23 11:01\nQueen Letizia of Spain looked sensational in an all-white suit for a meeting with members of the Princess Of Asturias Foundation alongside her husband King Felipe VI on Thursday in Madrid.\n18\n comment\ns\n4\n share\ns\nPower play! Queen Letizia of Spain takes the crown when it comes to a muscular physique, writes EDEN CONFIDENTIAL \n20/06/23 12:05\nEDEN CONFIDENTIAL: When it comes to a muscular physique, Queen Letizia of Spain takes the crown. The 50-year-old wife of King Felipe showed off her toned arms in a sleeveless midi dress.\n18\n comment\ns\n8\n share\ns\nRoyal BFFs! Letizia of Spain and Rania of Jordan share a warm embrace as the Spanish Queen welcomes the Jordanian royals to Madrid \n19/06/23 01:41\nThe European royal, 50, was delighted, chatting up a storm with the Jordanian Queen, 52 - as the Western Asian royal couple and their son are on an official visit to Spain.\n48\n comment\ns\n49\n share\ns\nFrom psychologist Queen Mathilde to finanical whizz Maxima, these are Europe's CLEVEREST royals (but how do Kate and Sophie measure up?)\n18/06/23 12:23\nIt's easy to forget that some royal women had very impressive careers before their roles carrying out public duties. Here are the cleverest royals in Europe - but how do the UK royals measure up?\n382\n comment\ns\n100\n share\ns\nA handsome King! Felipe VI of Spain dons full military regalia for annual pledge of allegiance ceremony\n16/06/23 02:36\nKing Felipe VI of Spain, 55, cut a sharp figure in full military dress during a solo appearance at the ceremony in Madrid today.\n8\n comment\ns\n20\n share\ns\nLetizia's new pal! Queen of Spain shows her maternal side as she dotes on children in Colombia during state visit focused on international development\n14/06/23 06:43\nThe Queen, 50, visited a school and its surrounding community during her first day of a visit to Colombia focused on international development.\n27\n comment\ns\n25\n share\ns\nThe European Princess with a racy past: How Sofia went from being a naked model and reality TV star to an admired Swedish royal who worked in hospitals during the pandemic\n13/06/23 11:33\nIt's increasingly normal for commoners to have had a career before marrying into one of Europe's royal families. Few, though, match Princess Sofia of Sweden, who once modelled topless.\n187\n comment\ns\n25\n share\ns\nCargo Queen! Letizia of Spain is ready to get to work in heavy-duty boots as she touches down in Colombia for a visit focused on international development\n13/06/23 07:28\nThe Spanish Queen, 50, touched down in the historic city on Colombia's Caribbean coast ahead of her state visit, which concludes on Thursday.\n18\n comment\ns\n47\n share\ns\nCurious sea lion gets up close and personal with Queen Letizia of Spain's mother-in-law Queen Sofia during visit to Madrid Zoo\n08/06/23 09:44\nQueen Letizia's mother-in-law, 84, was photographed leaning over the wooden fencing of the creature's home to pet the marine mammal and offer it some attention during her visit to Madrid Zoo.\n4\n comment\ns\n40\n share\ns\nBeauty in blue! Queen Letizia of Spain stuns in an elegant wrap dress as she steps out for an awards ceremony in Madrid\n07/06/23 10:55\nQueen Letizia of Spain looked exceedingly radiant as she stepped out for a work engagement in the capital\n9\n comment\ns\n38\n share\ns\nRadiant in white! Queen Letizia of Spain shows off her tan in a smart shirt dress as she attends charity meeting in Madrid\n06/06/23 10:40\nQueen Letizia of Spain, 50, was elegant in a white shirt dress as she attended a meeting for Foundation Against Drug Addiction in Madrid earlier this morning.\n34\n comment\ns\n42\n share\ns\nThe ten most expensive royal weddings of all time - with one racking up a sum of £270 million\n06/06/23 06:13\nIt was a truly memorable day - the sun shone, the bride looked radiant and there was optimism in the air when Harry and Meghan got married five years ago.\n66\n comment\ns\n44\n share\ns\nQueen Letizia stuns in colourful abstract print skirt as she joins King Felipe in Granada to mark Spain's National Armed Forces Day\n03/06/23 01:59\nQueen Letizia of Spain stunned in a colourful, abstract print skirt as she stepped out in Granada today to mark Spain's National Armed Forces Day.\n79\n comment\ns\n53\n share\ns\nStunning in stripes! Queen Letizia rocks a casual look as she takes selfies with royal fans at the Madrid Book Fair\n31/05/23 10:43\nThe Spanish Queen, 50, pulled off a more casual look than usual with elegance as she attended the Fair this afternoon in Spain's capital city and delighted royal fans.\n12\n comment\ns\n22\n share\ns\nRoyally awkward! Moment woman trips while being given award by Queen Letizia of Spain - but gets a reassuring hug from the monarch\n30/05/23 11:49\nAccording to El Español , the unlucky winner is María de los Ángeles García Antón. She was being celebrated at a World Red Cross and Red Crescent Day event in Madrid today.\n34\n comment\ns\n47\n share\ns\nA new era for Charlene? As the Princess ditches her trademark blonde locks for brunette shades, FEMAIL reveals how royal has changed her hair during years of turmoil\n29/05/23 10:19\nPrincess Charlene of Monaco may have debuted a new dramatic hairstyle over the weekend - but it's far from the first time the Olympic swimmer has transformed her lock.\n340\n comment\ns\n47\n share\ns\nEuropean royals really are pretty in pink! Stylists say 'empowering' colour 'represents kindness' as Kate, Spain's Letizia and Máxima of the Netherlands step out in the shade on the same day\n28/05/23 02:32\nPink is having a fashion moment, with European royals a fan of the shade.  Stylists have described the hue as 'an empowering colour, and that's because it's the colour of love and kindness'.\n103\n comment\ns\n1\n video\n78\n share\ns\nIn pictures: A history of royal weddings - from Grace Kelly's dress that caused gasps to Sarah Chatto's timeless bridal gown and former Peep Show actress Sophie Winkleman's daring sweetheart neckline\n27/05/23 07:25\nFrom Queen Victoria and Albert, Diana and Charles to Meghan Markle and Prince Harry , we've compiled a timeline of Royal Weddings that have taken place across the globe since 1840.\n401\n comment\ns\n8\n video\ns\n117\n share\ns\nIt's a family affair! Spanish royals co-ordinate in pink as Queen Letizia and her lookalike daughters celebrate Princess Sofia's Confirmation in Madrid alongside Queen Sofia \n25/05/23 11:52\nThe European royal, 16, opted for a show-stopping hot pink outfit to attend the ceremony at the Church of la Asunción de Nuestra Señora in Madrid.\n72\n comment\ns\n30\n share\ns\nTime to get a leg on: when Royal women have made the most of a stylishly split dress, from a glimpse of knee to a little more than we might have bargained for...\n23/05/23 05:30\nElegant as Royal wardrobes might be, 'modesty' is normally a watchword. But there is one adventurous style that does make an appearance  - the glamorous thigh-high split.\n177\n comment\ns\n33\n share\ns\nMystery of Princess Leonor's necklace: Spanish royal, 17, donned chain with the word 'love' in Arabic at her graduation - so, was it a gift from her grandfather King Juan Carlos?\n22/05/23 03:19\nThe royal, 17, had journalists in the Spanish media speculating this weekend after wearing a necklace reading the word 'love' in Arabic at her graduation ceremony in Wales.\n2\n comment\ns\n19\n share\ns\nFrom 'Hippie Hogwarts' to the military rigour of Sandhurst College - the British schools and colleges proving a big hit with European Royalty\n22/05/23 11:41\nWhether it's Princess Elizabeth of Belgium or Princess Leonor, future queen of Spain, foreign Royals are choosing British schools and universities for their education.\n comment\ns\n2\n share\ns\nThe day the heir to one of the grandest monarchies in the world married... a TV journalist. We look back at the wedding of King Felipe VI and Queen Letizia of Spain on their 19th  anniversary\n22/05/23 06:35\nLetizia Ortiz Rocasolano and Crown Prince Felipe had dated in secret before announcing their surprise engagement, and they were married at Almudena Cathedral in Madrid on 22 May 2004.\n319\n comment\ns\n13\n share\ns\nA royal reunion! Queen Máxima of the Netherlands and Queen Letizia of Spain celebrate as their daughters both graduate from UWC Atlantic College in Wales\n21/05/23 02:48\nBoth Princess Leonor of Spain and Princess Alexia of the Netherlands, 17, graduated from the UWC Atlantic College in South Wales this weekend, with their parents attending the ceremony.\n210\n comment\ns\n68\n share\ns\nKing of Kisses! How Prince 'Charming' Charles makes his mark when he meets the ladies (and how they've left a mark or two on him...)\n19/05/23 03:07\nOnce known as one of the world's most eligible bachelors, it's no surprise that King Charles has picked up a trick or two. And as these pictures show, he certainly knows how to pucker-up!\n117\n comment\ns\n57\n share\ns\nWho needs a throne? The VERY glamorous European Royals reaping the benefits of high society life. But without the pressures of a crown...\n18/05/23 03:48\nAll across Europe, from Queen Letizia of Spain's niece to Grace Kelly's granddaughter, glamorous minor royals are reaping the benefits of impeccable connections.\n140\n comment\ns\n4\n share\ns\nThe maddest hatter of European royalty! From an Ascot spectacular to a wide-brimmed wonder at Queen Letizia's wedding - a colourful catalogue of Queen Maxima's showstopping headgear\n17/05/23 05:30\nHats are often like marmite, you either love them or you hate them. But when you can wear them as well as the Queen of the Netherlands, they easily become a wardrobe staple.\n56\n comment\ns\n23\n share\ns\nLovely in lilac! Queen Letizia of Spain stuns in recycled trouser suit as she steps out for a mental health event\n16/05/23 11:08\nThe royal, 50, was fashion perfection in the structured lilac trouser suit as she attended the 'Mental Health In Spain Forum: 40 Years For Mental Health, For Rights, For You.'\n65\n comment\ns\n20\n share\ns\nFASHION FINDER: Queen Letizia of Spain wore an £850 Victoria Beckham dress to Buckingham Palace - but you can get the look for just £85 on ASOS \n10/05/23 07:07\nSHOPPING: Queen Letizia of Spain is the latest to have worn Victoria Beckham's 'it' dress of the season. Now sold out, we've found an alternative that's hundreds of pounds cheaper.\n12\n comment\ns\n share\ns\nWonderful in white! Queen Letizia dazzles in a chic suit as she attends a childhood obesity prevention conference in Croatia\n09/05/23 09:39\nThe Spanish Queen, 50, arrived at the Presidential Palace in Zagreb where she met with Croatian president Zoran Milanovic and his wife, Sanja, for a welcome dinner.\n33\n comment\ns\n18\n share\ns\nCoronation style! Celebrity stylist MIRANDA HOLDER gives her verdict on the royal ensembles\n07/05/23 05:09\nRoyals and celebrities flocked to Westminster Abbey to watch the coronation of King Charles. Here Celebrity stylist MIRANDA HOLDER gives FEMAIL her verdict.\n89\n comment\ns\n1\n video\n6\n share\ns\nA whirlwind trip! King Felipe of Spain jets back to Spain to take his daughter Infanta Sofia, 16, to the football hours after attending the Coronation in London\n07/05/23 09:53\nKing Felipe 55, watched the Copa Del Rey final  between Real Madrid and CA Osasuna at La Cartuja stadium in Seville, hours after attending the coronation at Westminster Abbey.\n57\n comment\ns\n2\n share\ns\nQueen Letizia of Spain looks stunning in pink as she arrives at Westminster Abbey in London for the Coronation of King Charles\n06/05/23 10:00\nKnown for her fashion prowess, Queen Letizia stunned in an elegant all-pink look at Westminster Abbey.\n66\n comment\ns\n1\n video\n19\n share\ns\nCrown jewels! Kings and Queens from around the world unite for Charles' coronation - as Charlene of Monaco and Letizia of Spain lead the glamour\n06/05/23 09:50\nRoyals from around the world descended on London today to attend the coronation of King Charles at Westminster Abbey. Among the attendees were Maxima of the Netherlands and Letizia of Spain.\n612\n comment\ns\n2\n video\ns\n72\n share\ns\nHere come the OTHER royals! Queens and Princesses from around the world put on a dazzling display of designer finery at Buckingham Palace reception\n05/05/23 10:28\nBritish and foreign royalty mingled with other VIP guests at a dazzling eve-of-Coronation reception at Buckingham Palace tonight.\n68\n comment\ns\n35\n share\ns\nRoyal blue! Princess of Wales wows in £360 Self-Portrait wrap midi dress and the Queen Mother's sapphire and diamond earrings at Buckingham Palace reception\n05/05/23 07:15\nKate, 41, donned a new £360 Self-Portrait wrap midi dress to attend the lavish event in London today, hosted by King Charles on the eve of his coronation.\n113\n comment\ns\n391\n share\ns\nGlamorous in green! Queen Letizia of Spain is elegant in £850 Victoria Beckham midi dress as she attends Buckingham Palace reception with King Felipe VI\n05/05/23 04:38\nThe Spanish royal, 50, joined her husband King Felipe VI, 55, at the lavish occasion ahead of attending the British monarch's coronation tomorrow in London.\n194\n comment\ns\n18\n share\ns\nCharlene steals the show! Princess of Monaco is ethereal in a gem-encrusted ensemble as she joins Prince Albert at Buckingham Palace reception\n05/05/23 04:36\nThe former Olympic swimmer, 45, looked effortlessly elegant when stepping out with her husband at the lavish occasion in London.\n664\n comment\ns\n68\n share\ns\nWho's who of the foreign royals attending the Coronation? Monarchs from across Europe, the Middle East and Japan unite to honour King Charles - including Maxima of the Netherlands and Letizia of Spain\n05/05/23 10:46\nHere FEMAIL reveals the royals who are jetting into London to attend King Charles Coronation at Westminster Abbey tomorrow.\n140\n comment\ns\n11\n share\ns\nIt's not their first Coronation! Kings from around the world will watch the crowning of Charles III at Westminster Abbey tomorrow - but what were their big days like?\n05/05/23 08:15\nSome of the most high profile guests at Westminster Abbey will be fellow monarchs from around the world, including King Felipe of Spain and Japan's Emperor Naruhito.\n11\n comment\ns\n1\n video\n19\n share\ns\nStyle Queen! Letizia stuns in sleek black dress and gold heels as she hosts reception for Colombian president with King Felipe\n04/05/23 08:57\nThe royal, 50, opted for a sleek sleeveless midi dress and gold metallic heels for the event at the Royal Palace in Madrid.\n35\n comment\ns\n30\n share\ns\nLady in red! Queen Letizia of Spain stuns in an elegant peplum gown as she hosts a gala for Colombian president with King Felipe\n03/05/23 09:51\nQueen Letizia pulled out all the style stops as she hosted a gala dinner with King Felipe at the Royal Palace in Madrid this evening.\n28\n comment\ns\n10\n share\ns\nSpring style! Queen Letizia of Spain recycles a lacy day dress as she and King Felipe VI welcome Colombia's president and his wife to sunny Madrid\n03/05/23 12:03\nLetizia, 50, sported an elegant white dress by Spanish brand Sfera in Madrid today as she and King Felipe VI welcomed Gustavo Petro and the first lady Veronica Alcocer, right, to Zarzuela Palace.\n35\n comment\ns\n16\n share\ns\nWhat the Royals look like without their makeup\n01/05/23 06:00\nThe minimal style often involves 'no makeup' makeup for an au naturel vibe - and proving they're ahead of the curve when it comes to beauty trends, royals have been adopting the look for years.\n comment\ns\n share\ns\nStrike a regal pose! How royals have perfected the art of taking pictures at engagements with these 5 easy tricks\n29/04/23 12:19\nBody language expert Judi James told FEMAIL how to be a hit in front of the camera, sharing five different poses which royal women across Europe tend to adopt to hit the right note in photographs.\n44\n comment\ns\n17\n share\ns\nThe most spectacular and eye-wateringly expensive royal engagement rings - but can YOU guess who they belong to?\n29/04/23 05:30\nRoyal engagement rings are among of the most famous items of jewellery in the world. With some royals opting for sentiment and others choosing glamour - can you guess the royal ring?\n614\n comment\ns\n3\n video\ns\n68\n share\ns\nJust how does the Princess of Wales keep her hair so long and natural? That's easy writes Kate's hairdresser RICHARD WARD - it's the BBBD (the Big Bouncy Blow Dry). And all her Royal rivals know the secret, too...\n28/04/23 11:37\nThe big bouncy blow dry is everywhere this spring - an iconic look that Kate Middleton has been effortlessly pulling off for years. It's a sophisticated hairstyle that other Royals have adopted, too.\n375\n comment\ns\n1\n video\n34\n share\ns\nBare-faced chic: What the royals look like without their make-up as 'clean girl aesthetic' beauty trend sees women ditching their heavy bronzer and foundation to go au naturel \n27/04/23 05:30\nThe minimal style often involves 'no makeup' makeup for an au naturel vibe - and proving they're ahead of the curve when it comes to beauty trends, royals have been adopting the look for years.\n557\n comment\ns\n8\n share\ns\nA sight in white! Queen Letizia of Spain dazzles in a recycled satin number and blue heels as she attends a conference in Madrid\n26/04/23 11:38\nQueen Letizia of Spain, 50, cut a stylish figure in a white outfit and blue heels on a solo trip to the ninth 'European Conferences on Tobacco or Health' in Madrid.\n117\n comment\ns\n10\n share\ns\nPetal power! Queen Letizia of Spain stuns in a floral print dress as she presents a literature award with King Felipe \n25/04/23 03:13\nQueen Letizia of Spain, 50, charmed onlookers in the form-fitting pink and white number as she welcomed guests to the Royal Palace in Madrid, for a 'Miguel de Cervantes' Literature Prize luncheon\n37\n comment\ns\n8\n share\ns\nSage style! Queen Letizia of Spain is elegant in a green dress with billowing sleeves as she attends literature awards in Madrid with King Felipe \n24/04/23 12:07\nThe thrifty royal, 50, recycled a dress she previously wore to a military parade to attend the annual Miguel de Cervantes award at the University of Alcala de Hernares.\n20\n comment\ns\n17\n share\ns\nPrincess Diana and Queen Letizia spotted in matching prairie collars - but the parallels don't stop there...\n20/04/23 03:12\nPrincess Diana's style has been imitated by many. Queen Letizia of Spain was spotted in Diana's prairie collar, but she has paid several unwitting tributes to her glamorous royal predecessor.\n177\n comment\ns\n53\n share\ns\nPretty in pink! Queen Letizia  stuns in £400 Mirto tweed jacket at 100th anniversary of Spain's first medical evacuation\n20/04/23 12:32\nQueen Letizia of Spain, 50, wowed onlookers in a cropped Mirto number as she attended the 100th Anniversary of the first medical evacuation of Spain\n27\n comment\ns\n20\n share\ns\nFabulous in fuchsia! Queen Letizia of Spain steps out in vibrant ensemble at National Sports Awards in Madrid \n18/04/23 02:33\nQueen Letizia of Spain stepped out in a fuchsia ensemble as she attended the National Sports Awards at the Royal Palace of El Pardo with her husband King Felipe today.\n19\n comment\ns\n1\n video\n18\n share\ns\nInside the scandalous life of exiled former King of Spain Juan Carlos I: From bedding '2,000 women', trying to 'woo' Princess Diana and THAT dig at King Charles\n18/04/23 09:06\nLiving in exile in the United Arab Emirates, Juan Carlos is estranged from his wife and family and facing a multi-million-pound lawsuit from his former mistress.\n97\n comment\ns\n3\n video\ns\n42\n share\ns\nBlooming lovely! Queen Letizia of Spain channels spring with a colourful floral dress for a Princess Girona Foundation event in Cordoba \n13/04/23 02:45\nQueen Letizia, 50, was in the south of Spain for talent tour and prize winner announcement event, wearing a brightly coloured €96 floral midi-dress from Cayro.\n5\n comment\ns\n8\n share\ns\nTimeless outfits the royals can't stop recycling - from the coat Princess Anne has had for almost 40 years to Kate's classic boots\n12/04/23 08:14\nDespite their vast amounts of wealth, the royals are renowned for their thrifty style, recycling their outfits for the most glamorous events. Some royal looks have been in circulation for over 30 years.\n3\n comment\ns\n share\ns\nIn the navy! Queen Letizia of Spain stuns in knitted dress as she attends the bicentenary of Ateneo De Madrid\n11/04/23 01:10\nThe Ateneo De Madrid was founded at the beginning of the 19th century, and Letizia looked elegan in a Floral Intarsia Knit Dress for the commemoration.\n20\n comment\ns\n14\n share\ns\nLady in red! Queen Letizia of Spain wows in matching scarlet trousers and blouse as she steps out alongside King Felipe at literary event in Madrid\n30/03/23 08:26\nQueen Letizia of Spain looked glamorous in a red ensemble as she attended a literary event alongside her husband King Felipe in Madrid on Thursday evening.\n51\n comment\ns\n12\n share\ns\nCan't beat a little black dress! Queen Letizia of Spain is elegant in a recycled Hugo Boss outfit as she's joined by King Felipe at a Spanish language event\n27/03/23 08:21\nThe royal, 50, was effortlessly elegant as she and her husband King Felipe VI, 50, arrived at the Gran Teatro Falla in Cádiz. Her chic gown featured fishnet detailing.\n106\n comment\ns\n4\n share\ns\nLovely in lilac! Queen Letizia stuns in plunging purple dress at conference in Cadiz - after her natural grey strike divided opinion\n27/03/23 12:59\nThe European monarch, 50, was all smiles as she arrived at the Falla Theatre in Cadiz this afternoon ahead of the International Congress of the Spanish Language.\n97\n comment\ns\n18\n share\ns\nSorry Letizia but going grey just says a woman has given up: CHRISTA D'SOUZA sounds a warning after Spain's Queen sported a startling silver streak \n26/03/23 07:04\nChrista D'Souza: I know it's become a thing, the whole #GreyHairDontCare movement, and I know we all want to be our authentic, natural selves, but does it actually look better?\n1390\n comment\ns\n10846\n share\ns\nDotty for spots! Queen Letizia of Spain wears beloved £119 Massimo Dutti dress for FIFTH time as she attends exhibition\n22/03/23 11:58\nThe royal, 50, sported a deep navy frock ornately decorated by polka dots  as toured the Madrid exhibition, which commemorates 500 years since the death of Antonio de Nebrija.\n33\n comment\ns\n5\n share\ns\nFun in fuchsia! Queen Letizia of Spain wears bright pink £347 maxi dress to preside over health conference \n16/03/23 01:53\nThe royal, 50, never one to shy away from bold tones, balanced fun with sophistication in the dress from Roberto Verino as she marked International Day of Rare Diseases in A Coruña.\n30\n comment\ns\n28\n share\ns\nPrincess Leonor will begin 3 years of military training in August after leaving 'hippie Hogwarts' school in Wales as the Spanish government encourages more women into the armed forces \n16/03/23 09:39\nThe heir to the Spanish throne, 17, will undertake training in all three branches of the military from August 2023, the minister of defence has announced.\n89\n comment\ns\n69\n share\ns\nReady for business! Queen Letizia of Spain is elegant in a tweed blazer as she announces the winner of the Princess of Girona Foundation awards\n14/03/23 12:18\nQueen Letizia of Spain, 50, looked elegant in a cream jacket as she stepped out to announce the winner of Girona Princess Foundation awards during the Tour de Talento event in Valladolid.\n78\n comment\ns\n20\n share\ns\nQueen Letizia of Spain is respectful in a black evening dress as she attends a memorial concert for terror victims in Madrid with King Felipe\n07/03/23 10:19\nThe Spanish Queen, 50, opted for a modest yet chic outfit as she attended a concert in memory of those who have lost their lives as a result of terror attacks in Madrid.\n45\n comment\ns\n3\n share\ns\nRegal in red! Queen Letizia of Spain dons a casual scarlet coat to chair a UNICEF committee meeting in Madrid\n03/03/23 02:04\nQueen Letizia of Spain attended UNICEF Spain board meeting today in Madrid of which she is Honorary President. The stylish royal, 50, wore a scarlet robe-like coat and wide grey trousers\n21\n comment\ns\n2\n share\ns\nFabulous in fuchsia! Queen Letizia of Spain cut an elegant figure in a matching pink skirt and top as she attends an awards ceremony in Alicante\n01/03/23 01:04\nQueen Letizia of Spain looked glamorous in a fuchsia pink ensemble as she joined her husband King Felipe VI in Alicante today. The royal couple attended the Investigation National Awards 2022\n22\n comment\ns\n7\n share\ns\nLovely in lilac! Queen Letizia of Spain is polished in a recycled Reiss skirt as she joins King Felipe VI at a presentation at the Royal Palace in Madrid\n28/02/23 01:15\nThe royal, 50, and her husband were all smiles as they gathered for the event, which aims to demonstrate how geography can map a vision of the past, in Madrid today.\n69\n comment\ns\n14\n share\ns\nPretty as a picture! Queen Letizia of Spain is perfectly poised in a pink dress as she joins King Felipe VI at annual contemporary art fair in Madrid\n23/02/23 12:19\nLooking typically stylish, the mother-of-two, 50, sported an elegant pink frock with button detailing as she joined King Felipe VI, 55, at the annual outing in Madrid.\n61\n comment\ns\n8\n share\ns\nSeeing double! Cat Deeley and Liam Payne's girlfriend Kate Cassidy wore the same dress to Vogue BAFTA afterparty - and they're not the only ones to suffer an awkward moment\n21/02/23 02:33\nCat Deeley and Liam Payne 's girlfriend Kate Cassidy both looked glamorous as they stepped out in a £2,651 gold gown from Carolina Herrera at the Annabel's event in London.\n58\n comment\ns\n10\n share\ns\nPretty in pink! Queen Letizia of Spain stuns in recycled pastel floral dress as she attends the National Culture Awards in Zaragoza\n20/02/23 07:05\nQueen Letizia of Spain re-wore a pastel pink floral dress for an awards ceremony. The stylish royal, 50, attended the National Culture Awards 2021 in Zaragoza, Spain on Monday\n46\n comment\ns\n9\n share\ns\nPage\nPrev\n1\n2\n3\n4\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Sam Ryder at F1 is everything a celeb should be compared to Cara Delevingne': Twitter users blast model for snubbing Martin Brundle\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shay Mitchell is the picture of elegance in bell-shaped dress at world premiere of live-action Barbie film in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nNewzit\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/prince_william/index.html",
        "https://www.dailymail.co.uk/news/kate_middleton/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/camilla-parker-bowles-duchess-of-cornwall/index.html",
        "https://www.dailymail.co.uk/news/article-11717587/Inside-scandalous-life-King-Spain-Juan-Carlos-bedding-2-000-women-50m-gift-row.html",
        "https://www.dailymail.co.uk/news/king-juan-carlos/index.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}