{
    "url": "https://www.dailymail.co.uk/news/china/index.html",
    "title": "China: Latest news, breaking stories and comment | Daily Mail Online",
    "hash": "aa776c0b4a68330478e0b87e8297889c",
    "text": "China: Latest news, breaking stories and comment | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking News\n\n\n\n\n\n\n\n                    \n                    Australia\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Video\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Russia-Ukraine\n                    \n                \n\n\n\n\n\n\n\n                    \n                    China\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debate\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    King Charles III\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Weather\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Most read\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nChina\n\n\nLast updated: 01:57 BST, 10 July 2023\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending China News\nTwenty-four of the world's most eye-popping roads revealed\nWill China use electric cars to spy on UK drivers?\nWhy I'll be buying petrol car just before 2030 ban, says MATT RIDLEY\nHistoric Mary Poppins Returns and Sherlock Holmes home sells for £12M\nNearly 9,000 photos from Hunter Biden's laptop are published\nJournalist who broke Pentagon UFO reveal says whistleblowers scared\nChina plots 'take over' of Latin America with new 'action plan'\nVietnam bans Barbie film over scene showing map with 'nine dash line'\n\n\n\n\n\n\nChina: Latest news, breaking stories and comment\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nWill China use electric cars to spy on UK drivers? MPs warn Beijing's dominance of the industry poses a threat on the scale of the crisis over Huawei \n09/07/23 09:07\nForecourts are expected to be flooded with up to 25 brands of cheap Chinese electric cars when new petrol and diesel cars sales are banned in 2030. Beijing outflanked the West to become the main power in the electric vehicle (EV) market when most major manufacturers were focused on traditional vehicles. The rush to phase out petrol and diesel cars, which the Daily Mail is campaigning to have reconsidered, will make Britain reliant on China and hit UK manufacturers.\n...read\n534\n comment\ns\n49\n share\ns\nInside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n09/07/23 02:05\nAn historic 18th century house in the heart of Westminster which has been used in multiple films has been sold for £12million.\n29\n comment\ns\n1\n share\nTwenty-four of the world's most eye-popping driving routes revealed, from a 26-lane freeway in Texas to Pakistan's 'road of death' and a VERY steep street in Wales\n09/07/23 09:25\nSome are so dangerous they'll leave your nerves shredded, while others guide you through some of the world's most mesmerising landscapes.\n246\n comment\ns\n165\n share\ns\nThe rush to electric vehicles risks killing our car industry, shackling us to China and bumping up our taxes to reduce global emissions by just 0.044%. That's why I'll be buying a brand new petrol car just before the 2030 ban, says MATT RIDLEY\n07/07/23 11:50\nMATT RIDLEY: To wean ourselves off China over the next seven years would require 100 times as much battery capacity as we have now, which is neither affordable nor feasible\n3392\n comment\ns\n1\n video\n742\n share\ns\n'It was not intended to make any type of statement': Warner Bros defends 'child-like' map in Barbie film showing Beijing's disputed claims to territory in South China Sea after movie was banned in Vietnam \n07/07/23 08:19\nThe film is not set for release in Vietnam due to a featured map showing the 'nine-dash line', which represents China's territorial claims, and is heavily contested by Vietnam.\n58\n comment\ns\n1\n video\n share\ns\nInvestigative journalist who broke Pentagon UFO story reveals MORE whistleblowers will come forward but they're scared of losing their jobs, safety and their security clearance \n07/07/23 04:26\nThe investigative journalist who broke the story of t he Pentagon whistleblower who claims the US has run a top secret UFO retrieval program for decades says more people are scared to come forward.\n119\n comment\ns\n2\n video\ns\n106\n share\ns\nHow this single photo of a crucifix being removed from a hospital by a crane has sparked outrage among Christians \n04/07/23 02:12\nAn images of a crane taking down a crucifix from a formerly Catholic-run hospital the ACT government has taken over with a forced acquisition has outraged Christians.\n27\n comment\ns\n46\n share\ns\nChina offers £100,000 for help leading to the arrests of three UK-based human rights activists as Beijing seeks their extradition\n03/07/23 09:47\nBeijing has approached Interpol to demand warrants for activists Nathan Law (pictured), Finn Lau and Mung Siu-Tat  who spoke out against repressive reforms in Hong Kong.\n2\n comment\ns\n29\n share\ns\nSome good news for Elon! Tesla posts record surge in sales after federal tax cut on electric vehicles prompted buyers to splash out - as CEO Musk battles criticism over new Twitter curbs\n03/07/23 04:08\nTesla has announced record car deliveries in the second quarter of the year after US business was bolstered by federal tax credits for electric vehicles.\n48\n comment\ns\n31\n share\ns\nChina is aiming for 'a new level' of military ties with Russia, says Beijing defence chief - just days after Wagner mutiny shook Putin's grip on power\n03/07/23 03:56\nChinese defence minister Li Shangfu told the head of Russia's navy that Beijing hopes for increased exchanges, joint exercises and other forms of co-operation.\n25\n comment\ns\n1\n share\nVietnam bans new Barbie film over scene showing 'nine dash line' map\n03/07/23 03:14\nVietnam has banned the upcoming Barbie movie from cinemas over scenes which feature a map showing China's claims to territory in the South China Sea.\n comment\ns\n share\ns\nVietnam bans new Barbie film over scene showing map of the 'nine dash line' that depicts contested Beijing claims to territory in the South China Sea \n03/07/23 02:02\nBarbie was due to launch in Vietnam on July 21, but state media have reported the film has been axed. It is because of scenes including a map with the nine-dash line, a contested sea border.\n97\n comment\ns\n1\n video\n191\n share\ns\nLabor senator makes bizarre comparison between the Voice to Parliament referendum failing and shocking human rights abuses in China \n02/07/23 06:00\nAboriginal leader Patrick Dodson believes Australia would be in no place to criticise China over its human rights abuses if the Voice to Parliament referendum fails.\n57\n comment\ns\n899\n share\ns\nRow erupts after Labour council 'considers spending taxpayer cash on 90 zero-emissions buses from China instead of buying British ones'\n01/07/23 11:28\nThe move by Blackpool Transport Services - owned by Blackpool council - comes two years after Johnson pledged £3billion to buy British-built vehicles.\n131\n comment\ns\n3\n share\ns\nWhat goes around, comes around! Satisfying times people got exactly what they deserved\n30/06/23 09:59\nDeMilked has compiled a selection of the most delectably sweet revenge from around the world. In one instance a group of bus drivers in China rallied to get revenge for bad parking.\n114\n comment\ns\n69\n share\ns\nDAILY MAIL COMMENT: Partygate tantrums of Commons cry-babies \n29/06/23 10:35\nDAILY MAIL COMMENT: Was there ever a more tiresome bunch of self-important whingers than the Commons privileges committee?\n144\n comment\ns\n21\n share\ns\nAussie cricket fan travels 58 hours from Tasmania via China and Cyprus to see second Test at Lord's - but forgets to buy a ticket and has to beg the Barmy Army for help\n29/06/23 03:43\nAn Australian cricket fan has traveled all the way from Tasmania via China and Cyprus to see the second Test at Lord's - but has forgotten to buy a ticket to the sold-out match.\n3\n comment\ns\n11\n share\ns\nIRS whistleblower claims US Attorney David Weiss said he WAS NOT in charge of deciding if Hunter faced federal charges and that an attorney in DC appointed by Joe Biden made call\n29/06/23 12:39\nAn IRS whistleblower claimed US attorney David Weiss told him he was not in charge of deciding whether or not Hunter Biden faced charges - and that a Joe Biden-appointed attorney made the call.\n263\n comment\ns\n1\n video\n128\n share\ns\n'No I wasn't': Agitated Biden denies TWICE he was involved when Hunter sent 'shakedown' message to Chinese business associate - as White House continues to be plagued by IRS whistleblower testimony\n28/06/23 04:59\nJoe Biden twice denied Wednesday that he had anything to do with his son's 'shakedown text message,' which showcased Hunter's willingness to use his father's clout.\n279\n comment\ns\n1\n video\n77\n share\ns\nIRS whistleblower says he was STOPPED from pursuing leads into 'big guy' Joe in the Hunter investigation\n28/06/23 12:45\nAn IRS veteran who blew the whistle on special treatment in the probe into Hunter Biden asserted the case involving the president's son was not conducted normally.\n289\n comment\ns\n1\n video\n159\n share\ns\nDricus du Plessis insists he 'manhandled' Israel Adesanya in sparring as a 19-year-old and denies UFC middleweight rival's claim he was 'messed up' in stand-up battle\n28/06/23 10:17\nDricus du Plessis claims he 'manhandled' Israel Adesanya in sparring when he was 19. 'Stylebender' originally spoke about sparring Du Plessis and said he dominated the stand-up.\n comment\ns\n94\n share\ns\nNew Hunter Biden WhatsApp messages show him demanding $10 million from Chinese energy venture and bragging that his family is 'the best' at appeasing company's now missing billionaire chairman\n27/06/23 11:53\nHouse Republicans released more WhatsApp messages Tuesday they say were written by Hunter Biden as he worked on a business deal with a Chinese energy company.\n701\n comment\ns\n543\n share\ns\n'What's a Uyghur?': Republican presidential contender Francis Suarez fumbles during bizarre radio interview as the Mayor of Miami appears to be completely unaware of ongoing Muslim genocide in China\n27/06/23 08:08\nThe UN accused China last August of 'serious human rights violations' and possible crimes against humanity in Xinjiang.\n3\n comment\ns\n1\n video\n18\n share\ns\nInvasion of the Chinese vapes: Number of electronic cigarette devices sold in America has nearly tripled since 2020 to over 9,000 - fueled exclusively by rise in illegal and fruity flavored disposables from China\n27/06/23 05:48\nSales data obtained by the Associated Press and published today has revealed how the Food and Drug Administration appears to have lost control of the vape market.\n57\n comment\ns\n15\n share\ns\nBoy, eight, is 'beaten to death by instructor the day after signing up at Chinese martial arts school'\n27/06/23 09:03\nThe youngster, who has not been named, joined the Chongde Juying Martial Arts Sports Club in Qingdao, Shandong on June 17.\n comment\ns\n2479\n share\ns\nInfluencer, 30, who calls herself an 'investigative journalist' is blasted as 'disgusting' for posting a GLOWING video tour of Shein's 'beautiful' China factory during paid-for brand trip - while ignoring company's long history of labor abuse allegations\n26/06/23 03:06\nDani Carbonari, 30, has been slammed online for posting numerous videos praising Shein - despite the clothing brand facing numerous allegations of labor abuse.\n107\n comment\ns\n1\n video\n32\n share\ns\nLucky pups! Charity workers rescue 60 dogs and cats from Yulin Meat Festival - but warn they are 'just a drop in the ocean'\n26/06/23 01:35\nSome 60 dogs and cats have been rescued from the Yulin Dog Meat festival  in China - however, this is 'just a drop in the ocean', animal campaigners have warned.\n130\n comment\ns\n1\n video\n90\n share\ns\nChannel 10 newsreader Charlotte Goodlet shares sweet video of baby son Alfred as he reaches milestone - after welcoming first child with her husband Kieran Jack\n26/06/23 10:33\nKieran Jack and Charlotte Goodlet welcomed their first child, son Alfred Nelson Jack, in December. \n1\n comment\n1\n video\n49\n share\ns\nChina's state media says Wagner mutiny threatens Putin's 'political stability' and the situation is moving 'in the direction the West would prefer' in rare criticism from Beijing \n26/06/23 08:50\nSince Moscow invaded Ukraine, leaving it internationally isolated, China has emerged as Russia's most important ally. But analysts say there are concerns in Beijing over Moscow's stability.\n252\n comment\ns\n75\n share\ns\nChinese social media users blast Western-style 'white people food'\n25/06/23 07:00\n'White people food' is trending on Chinese social media platforms as users are bewildered by the typical Western packed lunch, with some even calling it the  'lunch of suffering.'\n comment\ns\n share\ns\nInside China's little-known national parks: Texan explorer shares stunning images of natural beauty within the nation's first five special protected areas\n25/06/23 06:33\nKyle Oberman, 31, has spent almost a decade visiting some of China's lesser-known parts and he says that 'beyond the smog' there is a lush landscape that often gets overlooked.\n62\n comment\ns\n28\n share\ns\nHarriet Dart insists women's tennis IS on the rise in the UK after Katie Boulter and Jodie Burrage's impressive recent form - despite Dan Evans claiming Emma Raducanu's US Open win 'papered over the cracks'\n25/06/23 05:54\nIn Nottingham, Dart was one of four Brits to reach the quarter-finals of a WTA event for the first time in history. She on the state of tennis in the UK: 'It's great that we have a good crop of girls coming through.\n21\n comment\ns\n share\ns\n'We're here, but we're not stupid': Rural Michigan town rallies to stop Chinese firm with close ties to the communist party build $2B huge EV battery factory next to local National Guard base - amid rise in similar cases across US\n25/06/23 03:54\nThe unrest now being seen in Green Charter Township revolves around Gotion Incorporated, a manufacturer that recently bought land in the Big Rapids area for the factory.\n213\n comment\ns\n166\n share\ns\nPodium protestor Duncan Scott backs Mail Sport's campaign to win medal justice for robbed Brits at 1980 Olympics... with GB's most-decorated swimmer eager to see 'brutal' wrongdoing corrected\n24/06/23 09:30\nThe 26-year-old has his own history with dopers, having claimed a bronze behind China's convicted drug cheat Sun Yang in the 200metres freestyle at the World Championships in 2019.\n1\n comment\n share\ns\nNYC Mayor Eric Adams spends $50,000 in taxpayer funds to send 114 migrants to states such as Florida and Texas - and some to CHINA - after hammering states for bussing border crossers to the Big Apple\n23/06/23 11:14\nThe city has sent 100 families to US states and several other countries, including one as far as China. This despite Mayor Eric Adams slamming Republican governors for similar policies.\n184\n comment\ns\n1\n video\n97\n share\ns\nDoJ files first-ever charges against Chinese fentanyl manufacturers for fueling America's deadly opioid crisis: Two execs are arrested in Hawaii and one is on the run \n23/06/23 04:49\nA Chinese chemical manufacturing company has been deeply involved in trafficking the chemicals used to make the fentanyl that reaches the U.S., according to The Justice Department.\n136\n comment\ns\n105\n share\ns\nBiden hugs Modi in front of huge crowd of Indian supporters to kick off controversial state visit that has sparked outrage from the left over human rights and the crackdown on press freedoms \n22/06/23 02:38\nThe rain didn't cast a damper on Prime Minister Narendra Modi's arrival at the White House even as his record of clamping down on human rights casts a cloud over his meeting with Biden.\n98\n comment\ns\n3\n video\ns\n26\n share\ns\nThat's one way to beat the cost-of-living crisis! Chinese dish of stir-fry rocks becomes bizarre internet hit (and some claim it is 'delicious')\n22/06/23 02:22\nWhilst many people's go-to for an affordable Chinese meal might be a stir-fry, the newest take on the dish could leave your stomach churning. The dish of suodiu has origins in ancient China.\n153\n comment\ns\n1\n video\n45\n share\ns\nChina finds two new coronaviruses lurking in bats... and claim they both have freak mutation to prove Covid was NOT engineered in a lab\n22/06/23 06:47\nEXCL: Does a new Chinese study finding a furin cleavage site in non-Covid virus found in bats prove it wasn't made in a lab? While Beijing's scientists say yes, UK and US experts say no.\n395\n comment\ns\n67\n share\ns\nAOC and The Squad will BOYCOTT Modi's speech to Congress due to the Indian Prime Minister's record on human rights\n22/06/23 12:35\nRep. Alexandria Ocasio-Cortez will not attend India Prime Minister Narendra Modi's address to a joint session of Congress on Thursday out of protest of his record on human rights abuses.\n111\n comment\ns\n3\n video\ns\n12\n share\ns\nJill Biden unveils menu full of vegetarian dishes for 400 guests at state dinner with India's Modi - and is in 'suspense' over whether spaghetti-loving Joe will choose the sea bass or stick with her veggie main course\n21/06/23 10:04\nJill Biden unveiled a vegetable filled-menu for the state dinner for Indian Prime Minister Narendra Modi and joked she's in 'suspense' as to whether Joe Biden will pick the sea bass or stick with veggies.\n141\n comment\ns\n3\n video\ns\n4\n share\ns\nThe Class of 92 hope compared to Best, a prodigy Rio would pay to watch train, and the Italian who faded after a dream debut... Man United's lost wonderkids as Powell gets set to join Wrexham\n21/06/23 09:00\nThe legendary Sir Alex Ferguson described Nick Powell as 'an exceptional talent' when paying £6million to bring him to Manchester United in 2012.\n5\n comment\ns\n7\n share\ns\nRise of the super-fungus: Researchers find drug-resistant fungi are thriving in even the most remote regions of Earth - and they could be the next pandemic threat\n21/06/23 03:28\nA drug-resistant super fungus capable of sickening millions has been discovered in one of the most remote corners of the earth - raising fears of widespread disease outbreak.\n277\n comment\ns\n264\n share\ns\nBiden rolls out the red carpet for India - as Prime Minister Modi takes to the yoga mat with Richard Gere: Joe set to host politician who was banned from the U.S. ten years ago in further bid to counter China\n21/06/23 03:12\nJoe Biden will roll out the red carpet for Narendra Modi as the White House says the president won't lecture the Indian prime minister on human rights and denies the visit is about China.\n90\n comment\ns\n23\n share\ns\nChina demands Britain hands over the Falklands to Argentina... as Beijing continues to threaten Taiwan\n21/06/23 01:11\nThe Chinese ambassador to the United Nations Geng Shuang accused the UK of playing 'power politics' by keeping The Falklands, known as the Malvinas in Argentina, under British rule.\n3582\n comment\ns\n369\n share\ns\nWhere did it all go wrong for Hunter wellies? Critics claim quality of boots beloved by Kate Moss, Daisy Lowe and King Charles plunged after production moved to China... but administrators blame Covid, inflation and the WEATHER for company going bust\n21/06/23 01:00\nThe 160-year-old British firm Hunter Boots has gone into administration amid debts of £113million, with 11 staff made redundant and the remaining 110 jobs at risk.\n131\n comment\ns\n3\n share\ns\nCongress puts pressure on Biden to keep its distance from Beijing: House lawmakers urge auto CEOs to stop relying on EV batteries from China - a day after Blinken met with Xi\n20/06/23 04:33\nA group of tough-on-China House lawmakers are traveling to Detroit, Michigan, Tuesday to meet with top auto executives and work with the industry to shift away from reliance on PRC supply chains.\n11\n comment\ns\n share\ns\nReport: China in talks for army base in Cuba triggering alarm in US\n20/06/23 03:46\nDiscussions for the military facility are at an advanced stage but are not yet final, and the Biden administration has contacted Havana in an attempt to head off the deal.\n comment\ns\n share\ns\nChina 'is in advanced talks to build new military training facility in CUBA', triggering alarm among White House officials at prospect of Xi's troops stationed just 100 miles off Florida\n20/06/23 02:20\nDiscussions for the military facility are at an advanced stage but are not yet final, and the Biden administration has contacted Havana in an attempt to head off the deal.\n450\n comment\ns\n1\n video\n323\n share\ns\n'The lunch of suffering': Chinese social media users in hysterics over Western-style 'white people food' including cold sandwiches, raw vegetables and sliced meats \n20/06/23 09:07\n'White people food' is trending on Chinese social media platforms as users are bewildered by the typical Western packed lunch, with some even calling it the  'lunch of suffering'.\n3\n comment\ns\n1\n video\n72\n share\ns\nEXCLUSIVE: 'Nobody knows how horrific it is': Race is on to rescue animals from annual Chinese dog-eating festival where pets are stolen from owners then tortured to death because their heightened adrenalin 'improves the meat'\n20/06/23 02:58\nAn estimated 10,000 dogs are tortured, killed and eaten each year at the Yulin Lychee and Dog Festival in southern China.\n470\n comment\ns\n1\n video\n412\n share\ns\n'We do not support the independence of Taiwan': Blinken reaffirms U.S. commitment to One-China policy during high-stakes meeting with Xi - as Beijing REJECTS U.S. request for more contact between two militaries \n19/06/23 02:48\nTaiwan views itself as distinct from the Chinese mainland, with its own constitution and elected leaders. Beijing sees it as a rebel province of China.\n491\n comment\ns\n2\n video\ns\n153\n share\ns\nShocking images emerge from a 'hidden' puppy farm in the Chinese countryside supplying dogs to the Yulin Meat Festival\n19/06/23 01:32\nWorkers with London-based charity NoToDogMeat have found puppy meat farms in China's Guangxi province ahead of its controversial Yulin Festival.\n1\n comment\n486\n share\ns\nChina warns America there is no room to compromise' on Taiwan\n19/06/23 10:00\nChina today warned the U.S. it must choose between 'cooperation or conflict' and said there is 'no room to compromise' on Taiwan during a visit by Secretary of State Antony Blinken.\n comment\ns\n share\ns\nBlinken meets China's President Xi in high stakes bid to cool ramped up tensions and ensure two powers 'do not veer into conflict' hours after Beijing warned US 'there's no room to compromise on Taiwan'\n19/06/23 07:00\nUS Secretary of State Anthony Blinken met with Chinese President Xi Jinping in Beijing today after China warned Washington it must choose between 'cooperation or conflict'.\n534\n comment\ns\n2\n video\ns\n115\n share\ns\n'Mystery Chinese businessman' is blamed for $3.3m fraud allegations which grounded the career of a high-flying PwC executive - as her husband pleads with court: 'She knew nothing'\n18/06/23 11:35\nA mystery Chinese millionaire is said to be behind an alleged multi-million dollar fraud which has derailed the career of a PwC partner accused of rorting the cash from her husband's bosses.\n comment\ns\n24\n share\ns\nEXCLUSIVE: From VR contact lenses to AI telepathy - here are 10 tech breakthroughs predicted to change our lives this CENTURY, according to experts and imagined by AI\n18/06/23 07:12\nTechnologies including augmented reality, robotics and artificial intelligence are poised to wreak almost unimaginable changes on our daily lives in the coming decades, experts have told DailyMail.com.\n179\n comment\ns\n137\n share\ns\nAntony Blinken holds 'candid' talks with China's foreign minister who has blasted U.S. for 'malicious confrontation' and raises 'issues of concern' during high-stakes talks in Beijing\n18/06/23 03:32\nBlinken is the highest ranking U.S. official to visit Beijing since Biden took office. The U.S. and China have clashed over trade and military displays, plus China's ties with Russia amid the Ukraine war.\n271\n comment\ns\n10\n share\ns\nStunning moment Aussie China watcher is questioned by police over vile false threats to 'rape and kill' a young Chinese woman - as it's revealed China's spies were really behind the email\n18/06/23 02:58\nThis is the shocking moment an Australian China watcher is questioned by police over vile threats he supposedly made to 'rape and kill' an Chinese-Australian journalist.\n comment\ns\n1\n video\n1\n share\nBlinken meets with the Red Dragon: Secretary of State lands in China on mission to cool boiling tensions in highest-level US diplomatic visit since Joe Biden took office\n18/06/23 12:30\nBlinken was to begin two days of talks with senior Chinese officials in the afternoon. He is the highest-level American official to visit China since President Joe Biden took office.\n397\n comment\ns\n2\n video\ns\n53\n share\ns\nBiden claims Chinese spy balloon was 'more embarrassing than intentional' for Beijing and suggests top leaders there were unaware of the trans-continental surveillance flight \n17/06/23 10:42\nIn remarks to reporters on Saturday morning, Biden suggested that Chinese leaders may have been unaware of the spy balloon, which was shot down by US fighter jets in early February.\n765\n comment\ns\n4\n video\ns\n128\n share\ns\nRoyal Navy is 'pathetically weak', says former First Sea Lord who calls for a fleet which could 'make someone's eyes water if they cross us at sea' \n17/06/23 09:00\nThe former head of the Royal Navy has launched a blistering attack on the state of the fleet, following the revelation that a quarter of the country's frigates never spent a day at sea last year.\n373\n comment\ns\n70\n share\ns\nLAWRENCE BOOTH: Not so much a cricket series as a clash of cultures... and the Aussies still don't get it! You don't have to be mad to win the Ashes, but it might help\n17/06/23 06:18\nLAWRENCE BOOTH AT EDGBASTON: If he was mad enough to bowl Brook at Smith, what did Stokes know that Australia didn't? Apparently unsure, Smith opted for the safety of five dot balls and a single.\n15\n comment\ns\n684\n share\ns\nDid vaccine scientist 'thrown to his death' have proof of Wuhan lab leak? Chinese military expert who filed patent for Covid vaccine barely a month into country's first lockdown died in mysterious circumstances aged just 54 \n17/06/23 04:11\nZhou Yusen died in mysterious circumstances in May 2020, aged 54. US investigators are said to have been told 'Zhou fell from the roof of the Institute', although this has not been confirmed.\n215\n comment\ns\n405\n share\ns\nUniversity shuts down its CCP-linked Confucius Institute after scrutiny from top Republican over $13.5 million taxpayer-funded hypersonic weapons grant sparking 'national security concerns' \n16/06/23 06:19\nAlfred University has agreed to close its Confucius Institute following outrage over national security concerns by GOP Chairman Mike Gallagher.\n31\n comment\ns\n152\n share\ns\nEXCLUSIVE: Hunter Biden FINALLY answers questions about his shady finances in Arkansas as baby mama Lunden Roberts surprises First Son by showing up to hear him be deposed in battle over child support\n16/06/23 05:00\nHunter Biden was forced to answer questions about his shady finances Friday in Arkansas as part of his bitter paternity battle with baby mama Lunden Roberts.\n1068\n comment\ns\n2\n video\ns\n350\n share\ns\nHow a minor jersey detail you might have missed proves no one cares about the Socceroos in China as the country gets caught up in Lionel Messi mania\n16/06/23 03:22\nTickets to Australia's Beijing clash with reigning World Cup champions Argentina were snapped up within minutes - but hardly anyone in the stadium was there to see the Socceroos.\n4\n comment\ns\n9\n share\ns\nMoment a pitch invader breaks through guards and rushes onto the pitch to hug Lionel Messi during Socceroos' Beijing game - before slamming security for being useless\n16/06/23 01:39\nA football fan got to meet his idol Lionel Messi in the flesh in China  - but how he went about it has raised security concerns after he was easily able to invade the pitch and evade guards.\n2\n comment\ns\n1\n video\n share\ns\nLionel Messi drops a hint that his Inter Miami debut will be in late July - but admits it will be 'very difficult' to play for Argentina at the World Cup in USA \n15/06/23 08:02\nLionel Messi has given a further signal that he will start life in Major League Soccer in mid-to-late July with Inter Miami - but had some bad news for fans hoping to see him play a World Cup on American soil.\n comment\ns\n387\n share\ns\nMan United star Alejandro Garnacho makes his Argentina debut as second-half substitute in friendly win over Australia - as he lines up alongside hero Lionel Messi\n15/06/23 04:05\nGarnacho was made to wait for his maiden appearance for La Albiceleste after picking up an injury that forced him to withdraw from the March squad.\n1\n comment\n2457\n share\ns\nCali Cube master, 21, breaks Rubik's cube world record in 3.13 seconds\n15/06/23 10:57\nA California native set the new world record for solving a Rubik's Cube, smashing the record in just 3.13 seconds at an event on Monday.\n comment\ns\n share\ns\nEXCLUSIVE: Experts warn lethal opioid 'Pyro' which is 10 times stronger than fentanyl threatens to flood the streets of Britain after sweeping the US and killing teenagers\n15/06/23 08:32\nPyro's official name is N-pyrrolidino etonitazene and it is up to 1,500 times more powerful than morphine and can be found in pill, powder, liquid or other forms.\n254\n comment\ns\n40\n share\ns\nRubik's cube world record broken in mind-boggling 3.13 SECONDS: Cube master Max Park, 21, broke his own record set in 2022 \n15/06/23 04:35\nMax Park, 21, was seen on video solving a single 3x3x3 rubik's cube in just 3.13 seconds, smashing a record set in 2018 and adding to Park's impressive list of victories in the activity.\n132\n comment\ns\n194\n share\ns\nHillary Clinton laughs off Trump's 37-count federal indictment while touting 'Totally Impartial Potential Juror' T-shirt - as he claims she 'acid-washed' her deleted emails and stole furniture from the White House\n14/06/23 05:02\nHillary Clinton cackled when asked about former President Donald Trump's 37-count federal indictment over his mishandling of classified documents during a recent podcast episode.\n1816\n comment\ns\n1\n video\n122\n share\ns\nUp, up and wahey: Restaurant staff are blown into the air - with one smashing through the roof - after trying to hold down canopy at Chinese diner\n14/06/23 01:51\nStrong gusts of wind tore through parts of the country on Sunday forcing local businesses to erect outdoor canopies to protect diners.\n49\n comment\ns\n1\n video\n35\n share\ns\nSecretary of State Blinken to travel to China this weekend as US seeks to move beyond spy balloon fallout and ease tensions with Beijing \n14/06/23 12:59\nSecretary of State Antony Blinken will travel to China this weekend as President Joe Biden's administration tries to move past the spy balloon fallout and reset relations with Beijing. \n133\n comment\ns\n2\n video\ns\n36\n share\ns\nThe benefits of being injured! Man United star Lisandro Martinez enjoys the sun in Ibiza with his girlfriend - while his Argentina team-mates are hard at work\n14/06/23 09:50\nThe 25-year-old has been sunning himself on the Spanish island as he recovers from a metatarsal fracture in his foot which he picked up while playing for the Reds in their 2-2 draw against Sevilla.\n2\n comment\ns\n share\ns\nOverheard remark from Nick Kyrgios proves the Aussie star is no chance of repeating last year's golden run at Wimbledon as he ends seven-month layoff from tennis with worrying loss\n14/06/23 01:27\nNick Kyrgios' return to the court after seven months out with a knee injury has ended with a defeat at the hands of China's Yibing Wu in the first round at the Stuttgart Open in Germany.\n3\n comment\ns\n share\ns\nRhode Island officials are accused of being 'blatantly sexist, racist and unprofessional' during work trip to Philly where they demanded local businesswoman have Diet Coke and coffee on the table if her company wanted $55M\n13/06/23 06:45\nRhode Island officials were accused of being 'blatantly sexist' and 'racist' during a work trip to Philadelphia.\n23\n comment\ns\n1\n video\n21\n share\ns\nNick Kyrgios set to make his return to tennis this week following seven-month injury lay-off… after joking he coached Novak Djokovic to his historic French Open win\n13/06/23 03:46\nNick Kyrgios is finally returning to tennis after a long injury layoff, with the Aussie star lining up in the Stuttgart Open on Wednesday morning as he prepares for another Wimbledon tilt.\n2\n comment\ns\n1\n video\n1\n share\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Sam Ryder at F1 is everything a celeb should be compared to Cara Delevingne': Twitter users blast model for snubbing Martin Brundle\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Margot Robbie surprises by ditching pink to recreate 1960s gown at premiere alongside Dua Lipa - as critics laud 'bombastic and smart' movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ken's a real charmer! The sweet way Ryan Gosling honored his partner Eva Mendes at Barbie premiere after she opted out of his press tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shay Mitchell is the picture of elegance in bell-shaped dress at world premiere of live-action Barbie film in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robert Downey Jr. shares fun group snaps with his Oppenheimer co-stars in NYC - with an unexpected photobomb from John Krasinski\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Deal alert! Save on the number one bestselling Oral-B toothbrush shoppers say is 'perfect in every way': Now 50% off ahead of Amazon Prime Day\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/russia-ukraine-conflict/index.html",
        "https://www.dailymail.co.uk/news/china/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/uk_weather/index.html",
        "https://www.dailymail.co.uk/news/mostread/index.html",
        "https://www.dailymail.co.uk/news/article-12280753/Will-China-use-electric-cars-spy-UK-drivers.html",
        "https://www.dailymail.co.uk/news/article-12166759/Drugs-Naked-women-Family-snapshots-Theyre-mix-9-000-photos-Hunter-Bidens-laptop.html",
        "https://www.dailymail.co.uk/news/article-12273635/Investigative-journalist-broke-Pentagon-UFO-story-reveals-whistleblowers-come-forward.html",
        "https://www.dailymail.co.uk/news/article-10364663/China-plots-Latin-America-new-action-plan.html",
        "https://www.dailymail.co.uk/news/article-12259047/Vietnam-bans-new-Barbie-film-scene-showing-map-nine-dash-line.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}