{
    "url": "https://www.dailymail.co.uk/news/coronavirus/index.html",
    "title": "Coronavirus: Latest news and updates on the Covid-19 pandemic | Daily Mail Online",
    "hash": "1adf95d6ef38c42f9ea94dd63b66826d",
    "text": "Coronavirus: Latest news and updates on the Covid-19 pandemic | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking News\n\n\n\n\n\n\n\n                    \n                    Australia\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Video\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Russia-Ukraine\n                    \n                \n\n\n\n\n\n\n\n                    \n                    China\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debate\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    King Charles III\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Weather\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Most read\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nCoronavirus\n\n\nLast updated: 00:27 BST, 10 July 2023\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending Coronavirus News\nMinisters resist move by civil servants to 'work from the beach'\nKate Garraway's husband Derek Draper is rushed to hospital\n'It's a slap in the face': Adele's fans furious at canceled concert\nDoes this explain America's Adderall shortage?\nHome and Away star Luke Jacobz marres in Centennial Park\nTeenagers face criminal records over staggering Covid fines\nBrother of Mr Universe bodybuilder tragically found dead\nRapists will be surgically castrated  under new laws in Nigerian state\n\n\n\n\n\n\nCoronavirus: Latest news and updates on the Covid-19 pandemic\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nMinisters resist move by civil servants to 'work from the beach' as staff demand the right to carry out their jobs from overseas \n09/07/23 11:23\nThe trade union for senior Whitehall officials has claimed that developing policies and taking part in meetings while in another country would benefit their 'professional performance and personal life'.\n...read\n64\n comment\ns\n13\n share\ns\nTeenagers and students who can't afford to pay thousands of pounds worth of Covid party fines face criminal records as legal experts call for unpaid fees to be waived\n09/07/23 01:05\nAround 57,100 under 25s were slapped with a fine during the pandemic for breaching restrictions, according to a National Police Chief's council report.\n636\n comment\ns\n68\n share\ns\nTest champions say David Warner has just one match to save his career after twin Ashes failures heap pressure back on the veteran Australian opening batsman\n08/07/23 12:15\nFormer Australian Test stars say the writing is on the wall for embattled opener David Warner after yet another Ashes failure at the hands of English tormenter Stuart Broad\n68\n comment\ns\n7\n share\ns\nNearly half over-50s who quit their jobs during Covid now live 'in poverty', think-tank finds\n06/07/23 11:35\nHalf the older people (file photo) who dropped out of the workforce at the start of the pandemic found themselves struggling financially, it is claimed today.\n151\n comment\ns\n10\n share\ns\nFirst Gladiator champion who triumphed in 1992 TV contest wins payout from sports club that sacked him during Covid because it was down to its last 73p\n06/07/23 06:09\nWeininger Irwin was sacked without warning over email when the sports club he managed with his wife ran out of money during the pandemic.\n comment\ns\n1\n share\nMinisters pledge to save more taxpayers' cash after £8.3bn was overpaid in benefits last year - more than double the pre-Covid amount - as auditor refuses to sign off accounts for a 35th year\n06/07/23 04:46\nThe £8.3bn overpaid in benefits in 2022-23 was more than double the £4.1bn estimated to have been overpaid in 2018-19, which was the last year before the Covid pandemic.\n862\n comment\ns\n86\n share\ns\nNext pandemic could be even deadlier than Covid, Government adviser warns (but he insists he's not a doom-monger!)\n05/07/23 04:46\nProfessor Mark Woolhouse said the coronavirus outbreak, which killed at least 227,000 in the UK, was potentially nowhere near as bad as it could have been.\n1981\n comment\ns\n311\n share\ns\nFraudster who conned taxpayer out of £195,000 in Covid loans by making fake applications on behalf of businesses including Greggs avoids jail\n04/07/23 07:30\nRais Kayani, 31, 'dishonestly benefited' from the scheme, pocketing the cash and transferring it to accounts overseas, Southwark Crown Court was told.\n208\n comment\ns\n67\n share\ns\nDr Fauci still believes Covid emerged naturally despite lab evidence\n04/07/23 03:00\nDr Anthony Fauci still believes Covid emerged naturally - despite mounting indirect evidence of a lab accident.\n comment\ns\n share\ns\nHome and Away star Luke Jacobz and his American fiancée Raychel Stuart marry in stunning outdoor ceremony at Sydney's Centennial Park\n04/07/23 01:41\nLuke Jacobz and his American bride looked absolutely smitten as they walked down the aisle together during an intimate ceremony at Sydney's Centennial Park.\n22\n comment\ns\n93\n share\ns\nEXCLUSIVE: Dr Denial? Anthony Fauci tells DailyMail.com he STILL thinks Covid emerged naturally - despite FBI's assertion the pandemic likely began in lab where HIS department was funding risky bat virus research\n04/07/23 12:48\nThe former White House doctor told DailyMail.com that while he is keeping 'an open mind' about the origin of the pandemic, the 'data seem to weigh toward it being natural.'\n343\n comment\ns\n126\n share\ns\nWheelchair tennis exec wins £27,000 payout from sport's governing body after she was sacked for refusing to comply with 'hard line' Covid policy that required her to be double-jabbed\n04/07/23 11:25\nSarah Synan (pictured) successfully sued the International Tennis Federation (ITF) after it enforced 'particularly severe restrictions' against her over getting the jab.\n37\n comment\ns\n59\n share\ns\nMinisters were given stark warning that more children would die from suicide than from contracting Covid-19 if they shut schools, report reveals\n04/07/23 12:51\nConcerns were shared at a SAGE meeting in November 2020 - which senior scientific advisers responsible for briefing Westminster's key players were in attendance for.\n72\n comment\ns\n13\n share\ns\nSome good news for Elon! Tesla posts record surge in sales after federal tax cut on electric vehicles prompted buyers to splash out - as CEO Musk battles criticism over new Twitter curbs\n03/07/23 04:08\nTesla has announced record car deliveries in the second quarter of the year after US business was bolstered by federal tax credits for electric vehicles.\n48\n comment\ns\n31\n share\ns\nKate Garraway's Covid-stricken husband Derek Draper is rushed to hospital after watching her receive her MBE - as she tells social media followers their 'daily struggles go on'\n03/07/23 01:31\nThe Good Morning Britain host was accompanied by Derek Draper as she was  bestowed the honour on Thursday for her services to broadcasting, journalism and charity.\n131\n comment\ns\n3\n video\ns\n21\n share\ns\nHome and Away star Luke Jacobz marries American fiancée Raychel Stuart three years after they were forced to delay nuptials due to pandemic\n02/07/23 08:16\nLuke Jacobz has finally tied the knot with his American fiancée Raychel Stuart in an intimate ceremony in Sydney's Centennial Park.\n8\n comment\ns\n1\n video\n195\n share\ns\nEXCLUSIVE: Troops fired for refusing to get the vaccine over religious beliefs accuse Biden administration of 'harassment' - and warns U.S. military readiness will continue to 'bleed and decay' if Congress doesn't act\n02/07/23 03:46\nOver 8,000 service members - many who sought religious exemptions - were fired for refusing to comply with the Pentagon's COVID-19 vaccine mandate.\n131\n comment\ns\n180\n share\ns\nBoris Johnson Partygate inquisitor Sir Bernard Jenkin challenged to quit key Commons post by Rees-Mogg \n01/07/23 09:43\nThe Tory MP was also accused of having 'gone to ground' over his continued refusal to answer questions over allegations he was at 'birthday drinks' that broke Covid-19 rules.\n78\n comment\ns\n29\n share\ns\nNew York Knicks trade Obi Toppin to Indiana Pacers for two second-round picks after just 15 starts in three seasons in the Big Apple\n01/07/23 09:09\nThe New York Knicks are trading Obi Toppin to the Indiana Pacers, dealing away a former lottery pick who was loved by fans but never as much by coach Tom Thibodeau.\n1\n comment\n share\ns\nTour de France organisers tell riders and staff they must wear MASKS when not racing - and ban selfies with fans, autographs and dinners in restaurants - in bizarre draconian Covid rules\n30/06/23 04:08\nRiders will be required to wear masks at the team paddock, the sign-on podium, and the winners' podium and should limit their interactions with supporters.\n70\n comment\ns\n87\n share\ns\nPfizer employee is hit with insider trading charges after 'tipping off his friend about confidential results from Paxlovid antiviral trials' - earning them $325,000 in 'illicit gains'\n29/06/23 05:40\nAmit Dagar, 44, of Hillsborough, New Jersey was arrested on Thursday morning and is charged with four counts of securities fraud and one count of conspiracy to commit securities fraud.\n6\n comment\ns\n1\n share\n'Retail apocalypse' forces Walgreens to axe 150 stores by summer 2024: Chain says sales have been hit by plummeting demand for Covid vaccines and tests\n29/06/23 04:57\nWalgreens is set to shutter 150 stores after slashing its earnings forecast due to lessening demand for Covid-19 tests and vaccine shots.\n218\n comment\ns\n1\n video\n92\n share\ns\nOxford-educated Met Police sergeant, 34, is found guilty of sexually assaulting woman in the sea off Brighton beach during his stag do\n29/06/23 02:48\nA Met Police sergeant who sexually assaulted a stranger in the sea at Brighton while on his stag-do is facing jail and the end of his career.\n31\n comment\ns\n22\n share\ns\nTom Cruise looks ready for a nap as weary actor racks up the air miles to promote new Mission: Impossible film with his co-stars in South Korea\n29/06/23 08:20\nThe actor is currently working his way through a promotional tour on behalf of Mission: Impossible - Dead Reckoning Part One - the seventh instalment in the  film franchise.\n89\n comment\ns\n2\n video\ns\n256\n share\ns\nShe's gone from 'Australia's hero' to condemned as 'corrupt'. And when the day she dreaded for so long finally came, Gladys Berejiklian found solace in the past, writes PADRAIG COLLINS\n29/06/23 07:10\nGladys Berejiklian's spectacular fall from being the NSW premier revered for her steady handling of the pandemic to 'seriously corrupt' took almost 1,000 days.\n11\n comment\ns\n2\n video\ns\n14\n share\ns\n'I've never have been anti-vaccine:' RFK Jr. sensationally claims he merely wants to see more testing after years of spouting hardline anti-vax views - and REFUSES to pledge support for Biden as 'there's no plan B'\n29/06/23 04:15\nRobert F. Kennedy Jr. claimed in a town hall Wednesday night that he is not 'anti-vaccine' and merely wants to see more testing done.\n466\n comment\ns\n1\n video\n51\n share\ns\n'Doctors only gave me a 50/50 chance of waking up from my 40-day coma': Author Michael Rosen, 77, reveals how close to death he was during Covid battle as he appears in a special episode of The Repair Shop\n28/06/23 07:05\nAppearing in a special episode of BBC show The Repair Shop, which was dedicated to the NHS and its staff, British children's author Michael Rosen recalled being put into a coma.\n77\n comment\ns\n68\n share\ns\nEXCLUSIVE: Top GOP senator says 8,000 troops who went through 'traumatic' firing for refusing COVID vaccine over religious objections should be reinstated immediately - and slams the Biden administration for prioritizing 'woke obsession' \n28/06/23 03:25\nSen. James Lankford is criticizing the Biden administration for prioritizing a 'woke' agenda over protecting Americans' First Amendment freedoms.\n237\n comment\ns\n33\n share\ns\nA staggering $200BILLION in taxpayer dollars has been stolen from COVID-19 relief programs a new watchdog report reveals\n27/06/23 08:40\nThat is according to a report published Tuesday by the inspector general of the Small Business Administration, the entity charged with managing the payouts.\n comment\ns\n share\ns\nGlittering in gold! Queen Máxima of the Netherlands sparkles in sequins as she steps out to host microfinance event in Almelo \n27/06/23 03:26\nThe Dutch royal, 52, was photographed attending the opening of microfinance organisation, Qredits head office in Almelo\n24\n comment\ns\n20\n share\ns\nAstonishing document shown to Covid Inquiry reveals virus risk was rated 'red' but there were BLANKS for mitigation plans, as Matt Hancock slams pandemic preparations telling officials only cared about 'buying enough bodybags' \n27/06/23 10:48\nThe former health secretary, giving evidence to the Covid Inquiry, lashed out at the 'doctrine' of Whitehall preparations for a possible virus outbreak prior to 2020.\n1480\n comment\ns\n3\n video\ns\n46\n share\ns\nNina Dobrev debuts bangs and dons leggy $9K Khaite dress at LA premiere of The Out-Laws with boyfriend Shaun White\n27/06/23 05:13\nThe Bulgarian-born, Toronto-raised 34-year-old beamed at the 36-year-old SoCal native as they posed together on the red carpet outside Regal LA Live on Monday\n31\n comment\ns\n3\n video\ns\n1\n share\nESPN offers Sage Steele $501,000 to settle her free speech lawsuit - but the host WON'T accept with her attorney claiming the network 'cannot purchase their employee's constitutional rights'\n27/06/23 02:22\nSteele, 50, sued ESPN and its parent company Walt Disney Co. in April 2022 over allegations the network violated her free-speech rights in the aftermath of her comments about its vaccine mandate.\n3\n comment\ns\n43\n share\ns\nMarjorie Taylor Greene claims her TV is SPYING on her: Republican firebrand says she saw something concerning on screen in series of bizarre tweets\n26/06/23 10:16\nMTG said someone tried to hack her TV at her DC residence over the weekend and suggested it was someone trying to spy  - or even assassinate her - as she tweeted she is 'happy and healthy.'\n418\n comment\ns\n2\n video\ns\n94\n share\ns\nGovernment was aware a 'moderate' pandemic would cause major infrastructure problems years before Covid struck, inquiry hears\n26/06/23 05:53\nMinutes from a Department of Health board meeting, routinely attended by ministers and experts, suggested a lack of resilience to withstand major demand on resources in a crisis.\n242\n comment\ns\n1\n video\n24\n share\ns\nFormer Liverpool striker Fernando Torres 'is pursuing £687,000 in compensation from Spanish government for Covid-19 damages' after his gym chain lost profits \n26/06/23 03:42\nFormer Chelsea and Liverpool forward Fernando Torees is reportedly taking the Spanish Government to court due to damages incurred over the Covid-19 pandemic.\n20\n comment\ns\n145\n share\ns\nThe hidden change major airlines rolled out during the pandemic that could cost you an eyewatering $1,750 in extra fees: 'Absolute robbery'\n26/06/23 02:44\nHolidaymakers travelling on major airlines could be forced to fork out thousands of dollars in additional baggage fees due little-known changes rolled out during the pandemic. \n27\n comment\ns\n58\n share\ns\nGuy Sebastian's former manager walks free from jail after embezzling $650,000 from the star singer\n26/06/23 12:09\nTitus Day, 49, was sentenced to a maximum four years jail after he was found guilty of 34 offences of embezzlement by a clerk or servant in July, last year.\n1\n comment\n2\n video\ns\n55\n share\ns\nShahzada Dawood's wife reveals she was supposed to go on doomed sub\n26/06/23 10:00\nThe mother of the teenager who died in the Titan sub disaster with his multi-millionaire father has revealed she originally intended to embark on the doomed voyage.\n comment\ns\n share\ns\n'I stepped back and gave my space to my son': Wife and mother of Titanic sub disaster victims reveals she was originally due to be on doomed vessel but gave her place to her 19-year-old child\n26/06/23 06:11\nChristine Dawood had initially planned to go on the doomed voyage with her husband but 'stepped back' because her 19-year-old son Suleman (pictured with Christine) 'really wanted to go'.\n588\n comment\ns\n1\n video\n4511\n share\ns\nTravel experts reveal why Americans should avoid Europe this summer\n25/06/23 06:36\nAirlines have scheduled a near-record 51,000 flights from June to August from the US to Europe, but prices have surged, with the average roundtrip costing $1,032 this summer.\n94\n comment\ns\n291\n share\ns\nActor Sir Mark Rylance admits he used garlic solution instead of the Covid vaccine because 'science started to sound like a religion' during lockdown - before eventually having the jab \n25/06/23 04:39\nActor Sir Mark Rylance has said he was 'not convinced' he needed the Covid-19 vaccine and being told to have it caused 'alarm bells' to ring.\n1154\n comment\ns\n66\n share\ns\nDR MICHAEL MOSLEY: I was willingly infected with tapeworms, but I wouldn't dare catch Covid as part of a trial\n24/06/23 12:56\nDR MICHAEL MOSLEY: Not many of us would volunteer to be infected with a potentially lethal new virus in the name of science.\n326\n comment\ns\n29\n share\ns\nBiden administration FINALLY releases declassified report detailing 'potential links between the Wuhan Institute of Virology and the origin of the COVID pandemic'\n24/06/23 12:37\nThe Director of National Intelligence on Friday released to Congress their long-awaited report into Intelligence Community conclusions about the origins of COVID-19.\n1058\n comment\ns\n206\n share\ns\nREVEALED: OceanGate took out nearly $450,000 in PPP loans and used the pandemic business stoppage to improve the doomed Titan sub's hull after tests found it was too weak\n23/06/23 02:34\nThe government loan was issued in April 2020, during the first round of the emergency pandemic program, and was used to cover OceanGate's payroll costs during COVID-19 shutdowns.\n254\n comment\ns\n2\n video\ns\n286\n share\ns\nHayley Atwell turns heads in a voluminous gown as she joins Tom Cruise at the Mission: Impossible 7 premiere in London after rave reviews put it on track to be blockbuster hit\n22/06/23 05:04\nThe actor, 60, beamed as he hit the red carpet for the premiere of Mission: Impossible 7 Dead Reckoning Part One in London on Tuesday.\n439\n comment\ns\n3\n video\ns\n72\n share\ns\nMore serious questions for the BBC about its disgraced Diana Panorama interview after it's claimed shamed journalist Martin Bashir WAS answering questions privately to bosses - as corporation insisted publicly he was 'too unwell' to talk\n22/06/23 09:26\nNew emails have suggested disgraced journalist Martin Bashir was answering questions privately to bosses at the same time the BBC insisted publicly he was 'too unwell'.\n31\n comment\ns\n13\n share\ns\nChina finds two new coronaviruses lurking in bats... and claim they both have freak mutation to prove Covid was NOT engineered in a lab\n22/06/23 06:47\nEXCL: Does a new Chinese study finding a furin cleavage site in non-Covid virus found in bats prove it wasn't made in a lab? While Beijing's scientists say yes, UK and US experts say no.\n395\n comment\ns\n67\n share\ns\nMLB 'views the Netherlands, Germany, and France as potential destinations for future games across Europe' as it prepares to return to London for St. Louis Cardinals' clash with the Cubs\n22/06/23 01:39\nMajor League Baseball has big plans for growing its European fanbase and, on top of returning to London, it also intends to target other countries, such as France, Germany, and the Netherlands.\n comment\ns\n share\ns\nLeBron James is snapped alongside Hollywood A-Listers Leonardo DiCaprio and Tobey Maguire in Paris - one day after attending Pharrell Williams' Louis Vuitton debut\n21/06/23 10:11\nJames, 38, joined several soccer players at the five-star Hotel Plaza Athene in Paris' 8th arrondissement, near Les Champs Elysees, after leaving the lavish Le Cheval Blanc hotel, where he's thought to be staying.\n52\n comment\ns\n15\n share\ns\nMath and reading scores for 13-year-olds plummeted in the pandemic, sending many students back to levels not seen since the 1970s, says nation's report card\n21/06/23 03:23\nParents took to social media to sound alarm about the results, many blaming lockdowns, but others saying schools were more focussed on 'social issues' than 'teaching the three Rs.'\n139\n comment\ns\n101\n share\ns\nJurrien Timber still shares a bedroom with his brother at 22, but he's a two-time Eredivisie winner and rejected Man United last summer: All you need to know about the Dutch defender Arsenal might have to stump up £50m for\n20/06/23 07:00\nSince his Ajax debut in March 2020, the 22-year-old Dutch international has won the Eredivisie twice, the KNVB Cup once, and the league's Player of the Year award. How good is he?\n8\n comment\ns\n388\n share\ns\nOne of China's earliest Covid patients was an AMERICAN-funded scientist who worked at Wuhan virus lab feared to have caused pandemic \n20/06/23 06:17\nOne of the first Covid patients to fall ill with the virus in the Wuhan Institute of Virology had received federal dollars from the US government to fund his research.\n157\n comment\ns\n1\n video\n395\n share\ns\nAussie man cracks up the internet as he claims to be COVID obsessive who lives in a tent in a GARAGE with an air-filter - after his partner 'dropped precautions against the virus' in house\n20/06/23 05:13\nA man has sparked hilarity after claiming he is sleeping in a tent in his garage with an air filter' after his partner dropped precautions against the virus.\n2\n comment\ns\n6\n share\ns\nGen-Z workers who spent college years stuck at home in pandemic are taking courses on how to send emails, what to wear in the office, elevator chitchat and mealtime etiquette \n20/06/23 01:49\nGen-Z workers who came into adulthood during the pandemic are taking courses to learn the basics when it comes to working with others in person.\n110\n comment\ns\n26\n share\ns\nDeSantis' team MOCKS Trump for bragging that he surrounds himself 'with the best people' with montage of him appearing alongside Dr Fauci, Deborah Birx and Joint Chiefs Chairman Mark Milley \n20/06/23 01:38\nRon DeSantis mocked Trump for hiring Drs. Fauci and Birx after the former president insisted he only hired the 'best and most serious' people in 2016 - and will do the same if he wins in 2024.\n147\n comment\ns\n1\n video\n15\n share\ns\nGeorge Osborne questions whether schools should have been shut during Covid lockdowns as ex-Chancellor insists his austerity policies meant Britain was BETTER able to respond to coronavirus\n20/06/23 11:59\nThe ex-Chancellor claimed it was still an open question as to whether children should have been prevented from attending classrooms when the pandemic hit.\n357\n comment\ns\n3\n video\ns\n11\n share\ns\nMet Police sergeant, 34, 'raped 21-year-old woman in the sea in Brighton during his stag do after telling her he was having a rubbish night and meant to be having fun', court hears\n19/06/23 05:05\nLaurence Knight, 34, allegedly carried out the attack after his group were entertained by strippers at their AirBnb in the Sussex resort.\n comment\ns\n64\n share\ns\nLockdowns were never part of UK's pandemic plan, Department of Health secretary tells Covid Inquiry - and DENIES there was ever a national PPE shortage\n19/06/23 04:12\nSir Chris Wormald, (pictured) permanent secretary for the Department of Health, told the Inquiry the Government's widely-criticised strategy was based on a flu outbreak.\n805\n comment\ns\n4\n video\ns\n171\n share\ns\n'Shame on you!': Moment David Cameron is heckled as he leaves the Covid Inquiry with ex-PM denying austerity harmed the NHS and stopped it preparing for a pandemic\n19/06/23 01:57\nThe ex-prime minister was shouted at when departing London's Dorland House after facing questions by the official probe into Whitehall's handling of the coronavirus crisis.\n574\n comment\ns\n46\n share\ns\nMet Police 'assessing' report of alleged Covid rule-breaking by senior Tory MP Bernard Jenkin - one of Boris Johnson's leading Partygate inquisitors - with Scotland Yard also looking into video of Conservative activists dancing at CCHQ bash\n19/06/23 12:43\nThe Metropolitan Police today revealed it was 'in the process' of looking into a series of allegations of further lockdown breaches following on from its probe last year.\n268\n comment\ns\n2\n video\ns\n25\n share\ns\n'It's very hard to answer why that's the case': David Cameron admits he's 'wrestling' with why Britain's pandemic preparations were focused on flu and more time wasn't spent on Covid-like diseases as ex-PM is grilled by public inquiry over his time in No10\n19/06/23 09:09\nThe former prime minister revealed he was 'wrestling' with why more time was spent looking at the risks of a flu pandemic rather than other diseases prior to 2020.\n476\n comment\ns\n14\n share\ns\nBernard Jenkin is still silent FIVE days on from claims he went to lockdown-busting drinks party as report is filed to police \n18/06/23 10:39\nFive days after claims were aired that he attended a lockdown-busting drinks party, one of Boris Johnson's leading Partygate inquisitors is maintaining his silence.\n1\n comment\n28\n share\ns\nTwo Utah news anchors 'feel duped' and 'sickened' after interviewing grief author now charged with murdering her husband with fentanyl-tainted Moscow Mule - and say she blamed Covid for his death \n16/06/23 04:18\nDeena Manzanares and Surae Chinn, the hosts of KTVX's 'Good Things Utah', said they felt disturbed by the interview with murder-accused mother Kouri Richins.\n31\n comment\ns\n2\n video\ns\n30\n share\ns\nWall Street job cuts set to hit more than 15,000 this year as Citigroup becomes latest company to announce 5,000 layoffs amid 'most challenging job market since financial crisis'\n16/06/23 02:34\nCitigroup has become the latest big US bank to announce layoffs with 5,000 redundancies as Wall Street job cuts have hit 15,000 this year.\n37\n comment\ns\n14\n share\ns\nSwollen eyes, a hunchback and claw-like hands: Grotesque model reveals what remote-workers will look like in 70 years\n16/06/23 09:52\nFurniture At Work has revealed what home-workers will look like by the year 2100 - and it's not a pretty sight.\n1705\n comment\ns\n2668\n share\ns\nAussie biotech firm that inked a massive deal with the US government just three years ago collapses owing $140million\n16/06/23 03:24\nBrisbane-based Ellume went from announcing a $300million deal for self-testing Covid-19 kits with the US government to winding up operations in the space of three years.\n7\n comment\ns\n42\n share\ns\nCovid 2.0 warning: Another pandemic is an 'inevitability', expert claims as David Cameron and George Osborne are called to give evidence to Inquiry\n15/06/23 05:09\nProfessor David Alexander, (pictured) an expert on disasters and risk management at University College London, said he was 'slightly surprised' No. 10 had only deemed it a 'realistic possibility'.\n730\n comment\ns\n33\n share\ns\nHuge boost for Australians heading to Bali as holidays to the island paradise are made even easier \n15/06/23 03:46\nOne less vaccination will be required to travel to Bali after the Indonesia government announced the country will scrap COVID-19 vaccination requirements for all arrivals.\n12\n comment\ns\n147\n share\ns\nNorth Koreans reveal entire families are starving to death under Kim Jong Un's rule as he focuses on nuclear weapons - and only an INVASION will save them\n15/06/23 08:59\nCivilians trapped inside North Korea say they have watched mothers, unable to work due to sickness, die of starvation before their children succumbed to the same fate.\n368\n comment\ns\n110\n share\ns\nNew Zealand falls into recession after enduring two major disasters in three months - amid grave warning Australia is 'on the brink of financial collapse'\n15/06/23 01:37\nOn Thursday, Stats NZ released data showing the Kiwi economy contracted by 0.1 per cent in the first quarter of 2023.\n219\n comment\ns\n1\n video\n103\n share\ns\nUrgent vaccination warning issued to Australians as Covid and flu 'double whammy' strike ahead of the school holidays\n14/06/23 11:30\nWith the winter flu season in full swing and COVID-19 surging, parents are being warned to get their children vaccinated ahead of the looming school holidays.\n117\n comment\ns\n56\n share\ns\nThe real patient zero? Three Wuhan lab scientists genetically altering Covid were the FIRST to contract the virus, claims report \n14/06/23 05:09\nAccording to multiple US government officials interviewed as part of a lengthy inquiry by Public and Racket, the first people infected by the virus are allegedly Ben Hu, Ping Yu, and Yan Zhu.\n1333\n comment\ns\n1\n video\n930\n share\ns\nSuperjumbo revival! New UK-US airline set to operate flights from London to NYC and LA by 2024 acquires A380 to 'transport passengers back to travel's golden age'\n14/06/23 02:28\nGlobal Airlines is the first new airline to own one of the double-decker superjumbos in eight years. It expects to acquire three more A380s in the coming months.\n259\n comment\ns\n38\n share\ns\nNo wonder the Covid Inquiry's going to take years! Mind-boggling diagram lays bare Government's 'labyrinthine' chain of command - which was tasked with preparing country for a pandemic before coronavirus struck\n14/06/23 10:35\nThe flow chart documents the web of links between more than two dozen organisations including the Cabinet Office and the independent SAGE - who advocated for harsher lockdowns.\n203\n comment\ns\n2\n video\ns\n26\n share\ns\n'You need a non toxic team': Johnny Vaughan discusses Big Breakfast's success and his 'ups and downs' with co-host Denise Van Outen - amid This Morning scandal\n14/06/23 12:28\nThe presenter, 56, who fronted the show alongside Denise Van Outen, 49, was speaking after the pair reunited this week for their first TV appearance in 20 years.\n27\n comment\ns\n1\n video\n1\n share\nThe death of 'pandemic revenge spending': Households are cutting back on flights, hotels and restaurants  amid fears of a recession - with McDonald's execs claiming customers are even forgoing FRIES to save cash\n13/06/23 05:13\nIn the wake of the Covid-19 pandemic, there was a spike in so-called 'revenge spending', with people paying out more on recreational expenses and vacations.\n225\n comment\ns\n40\n share\ns\nDenise Van Outen pokes fun at THAT Big Breakfast contract dispute with Johnny Vaughan as the pair reunite for first TV appearance in 20 years\n13/06/23 01:54\nThe presenter, 48, was embroiled in a long lasting pay dispute with her Big Breakfast co-host Johnny, 56, until they made up during the Covid-19 pandemic.\n22\n comment\ns\n2\n video\ns\n4\n share\ns\nThe Great COVID Grift: $420 BILLION lost from coronavirus aid through 'fraud and waste': Staggering report reveals how billions of taxpayer cash from $4.2 trillion in bailout funds disappeared\n12/06/23 10:58\nAn analysis by the Associated Press said fraudsters and criminals plundered billions of taxpayer cash set aside to fend off economic collapse during the pandemic.\n251\n comment\ns\n227\n share\ns\nWatch out, you might catch Covid... at the Covid Inquiry! Officials fear people attending its hearings could contract coronavirus, guidelines suggest\n12/06/23 09:02\nA document published on the inquiry's website last night urges 'all staff and visitors' to take a lateral flow test before attending its sessions.\n193\n comment\ns\n22\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/russia-ukraine-conflict/index.html",
        "https://www.dailymail.co.uk/news/china/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/uk_weather/index.html",
        "https://www.dailymail.co.uk/news/mostread/index.html",
        "https://www.dailymail.co.uk/news/article-12281111/Ministers-resist-civil-servants-work-beach.html",
        "https://www.dailymail.co.uk/news/article-12279043/Students-afford-thousands-pounds-worth-Covid-party-fines-face-criminal-records.html",
        "https://www.dailymail.co.uk/news/article-11837771/Calum-von-Moger-brother-edward-dead-boomerang.html",
        "https://www.dailymail.co.uk/news/article-8744261/Rapists-surgically-castrated-new-laws-Nigerian-state.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}