{
    "url": "https://www.dailymail.co.uk/news/prince_harry/index.html",
    "title": "Prince Harry: Latest news, views, gossip, photos and video | Daily Mail Online",
    "hash": "45e3268c765edefc45140090c36624bb",
    "text": "Prince Harry: Latest news, views, gossip, photos and video | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKing Charles III\n\n\n\n\n\n\n\n                    \n                    Prince William\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Kate Middleton\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    The Queen Consort\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPrince Harry\n\n\nLast updated: 07:22 BST, 10 July 2023\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending Prince Harry News\nOfficials REFUSES to reveal details about Prince Harry's visa\nPrince Harry takes Lilibet to July 4th parade before King's Coronation\nFans go wild for Lilibet's traditional dress that is like Charlotte's\nALISON BOSHOFF: Is Prince Harry tiring of Meghan's showbiz world? \nPALACE CONFIDENTIAL: Prince Harry's friends 'very hurt'\nRoyals who roll up their sleeves whenever they get the chance...\nThe truth behind 'mum's day out' at the polo for Kate and Meghan\nPrince Harry & Meghan Markle hold hands and share a laugh together\nRELATED TOPICS FOR Prince Harry\nDoria Ragland\nKing Charles III\nDiana\n\n\n\n\n\n\nPrince Harry: Latest news, views, gossip, photos and video\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nUS refuses to release details of Prince Harry's visa application after drug use revelations citing his 'right to privacy' despite his life in the limelight and a six-part Netflix documentary with wife Meghan Markle \n10/07/23 02:05\nThe US government has refused to reveal details of Prince Harry's American visa due to his 'right to privacy,' documents have revealed. The Department of Homeland Security has for a second time turned down a Freedom of Information request to reveal the material. It was made by the Heritage Foundation think-tank to see if Harry lied in immigration paper-work about past drug-taking. He admitted to consuming illegal substances in his memoir Spare and his Netflix show, a fact that usually bars US entry unless there is special dispensation.\n...read\n comment\ns\n62\n share\ns\nIt's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n09/07/23 07:17\nWhether he's flying rescue helicopters or abseiling down cliffs on official visits, William has long been quite the man of action. So it's no wonder he likes to roll up his sleeves - literally - and get stuck in.\n199\n comment\ns\n29\n share\ns\nThe 12 surprising similarities between Meghan Markle and Ellie Goulding: ALISON BOSHOFF reveals pair have a huge amount in common... and it's not just Prince Harry\n08/07/23 08:28\nALISON BOSHOFF: Both got married in a castle, both are close to the York sisters and both partner with the UN. Meet the Duchess of Sussex and her unlikely doppelganger, pop star Ellie Goulding.\n21\n comment\ns\n35\n share\ns\nNeo-Nazi podcasters who said Prince Harry and Meghan's son Archie is an 'abomination that should be put down' for being mixed race are convicted of terror crimes\n07/07/23 04:52\nChristopher Gibbons (pictured), 38, and Tyrone Patten-Walsh, 34, hosted Black Wolf Radio, where they launched homophobic, racist, anti-Semitic, Islamophobic and misogynistic tirades.\n313\n comment\ns\n84\n share\ns\n'I am screaming': VERY raunchy trailer for new rom-com Red, White & Royal Blue - which shows a British prince falling in love with the President's son - sends viewers into a FRENZY as they get a sneak peek at steamy sex scenes \n07/07/23 03:53\nForget Prince Harry, hello Prince Henry! The steamy trailer for Red, White & Royal has dropped and fans cannot contain their excitement to see a British prince fall in love with the First Son.\n2\n comment\ns\n1\n video\n23\n share\ns\nIdris Elba reveals the surprising way he became friends with Prince Harry\n07/07/23 03:40\nThe British actor and DJ told the Smartless podcast: 'I was DJ-ing in all these clubs where Harry would show up and he was like \"Yo!\" and I'm like \"Yo!\".\n1\n comment\n1\n video\n99\n share\ns\nPrince Harry's friends are 'very hurt' by his bombshells and feel he has 'not repaid the loyalty' they have shown him, Rebecca English tells PALACE CONFIDENTIAL\n07/07/23 08:59\nThe Daily Mail's Royal Editor Rebecca English told Palace Confidential that the fallout from Prince Harry's former friends has been profound. On Tuesday, the Duke was spotted in Montecito.\n300\n comment\ns\n171\n share\ns\nAnother royal PDA at the polo! As William and Kate enjoy a tender embrace, FEMAIL reveals how the Firm drop their stiff upper lips for smooches during matches\n06/07/23 06:16\nThe royals, who have been known to embrace in PDAs, saw the opportunity to let loose as Kate enjoyed a glass of champagne while cheering on her husband.\n120\n comment\ns\n1\n video\n35\n share\ns\nStyle sisters already! Royal fans go wild for Princess Lilibet's traditional dress and knee socks that are just like Princess Charlotte's (and could she be wearing dad Prince Harry's red toddler shoes?)\n06/07/23 03:03\nPrincess Lilibet was pictured with Harry at an Independence Day parade in Montecito just hours before her grandfather King Charles III attended his second Coronation ceremony in Edinburgh.\n299\n comment\ns\n1\n video\n196\n share\ns\nTruth behind THAT awkward 'mum's day out': As Kate returns to the polo to support William, how her 2019 outing with Meghan was an effort to show a united front before their feud was exposed \n06/07/23 11:42\nWhile Kate is set to watch Prince William playing polo later today, it's likely to be a far cry from the joint appearance she made alongside the Duchess of Sussex to watch the brothers play in 2019.\n534\n comment\ns\n1\n video\n494\n share\ns\nIt's Prince Harry's Independence Day: Duke takes two-year-old daughter Lilibet to a July 4th parade near their Montecito home - hours before the King's Scottish Coronation\n05/07/23 08:07\nAs Prince Harry was showing two-year-old Lilibet the Montecito Association's Village Road Show, his father King Charles was preparing for one of the most important moments of his rule.\n1126\n comment\ns\n2\n video\ns\n249\n share\ns\nPrince Harry's claim about a secret Buckingham Palace deal to stop him launching hacking case is 'Alice in Wonderland stuff', High Court hears \n05/07/23 06:17\nHarry's case was so contradictory, the newspaper's barrister told the court, he was trying to 'ride two horses galloping in completely opposite directions'.\n169\n comment\ns\n142\n share\ns\nHarry's 'band of brothers'! Who's who in Prince's close circle - after he missed the wedding of Jack Mann despite rumours his polo pal was his 'secret best man' at wedding to Meghan\n04/07/23 12:23\nThis week, it was revealed that the Prince didn't attend Mann's wedding in Suffolk to Isabella Clark. Here, Femail looks at Harry's other pals in that 'band of brothers' photo...\n52\n comment\ns\n5\n share\ns\nHarry misses his 'best man's' big day: Sussexes don't attend wedding of duke's polo chum Jack Mann who featured in 'band of brothers' Royal wedding photograph\n03/07/23 06:02\nTthere was disappointment at the weekend among royal fans that Harry and Meghan were not present at his old polo chum Jack Mann's big day (pictured)\n801\n comment\ns\n188\n share\ns\nPrincess Diana would be the 'only person who could fix Harry and William's rift' as her sons 'meant the world to her', royal expert claims \n03/07/23 01:53\nFormer BBC royal correspondent Jennie Bond - who met with Diana several times before her death in 1997 - told OK! magazine the late royal was 'so clearly proud' of her two boys.\n138\n comment\ns\n92\n share\ns\nPrince Harry and Meghan Markle hold hands and share a laugh and joke together in Santa Barbara as they are spotted for first time since it emerged they have handed over keys to Frogmore Cottage\n02/07/23 04:27\nHarry and Meghan were spotted holding hands, smiling and laughing as they left an office building in Santa Barbara, California on Friday. It is unknown what business they had visited\n1500\n comment\ns\n1\n video\n736\n share\ns\nAs rumours swirl that Harry and Meghan's Netflix deal could be axed, other royals who've proved a TV flop, including Prince Andrew's Newsnight disaster and Edward's panned 'It's a Royal Knockout' \n02/07/23 08:34\nAs Meghan's Spotify deal is cancelled, FEMAIL looks at the British Royal Family's other showbiz flops. From the BBC documentary, the Queen had banned, to Prince Andrew's Newsnight slot.\n6\n comment\ns\n1\n video\n43\n share\ns\nPlanet Sussex: How Prince Harry and Meghan's circle of close friends has changed over the years... so who's in and who's out of their orbit?\n02/07/23 08:25\nPrince Harry and Meghan have had an ever-changing circle of friends over the past few years after they quit as working royals in 2020 and began a new life in the US.\n91\n comment\ns\n81\n share\ns\nInside Prince William's schooldays at Eton that 'broke royal tradition' - from 'Pop' club to weekly tea with his grandmother... as son George looks set to follow in his footsteps at prestigious Windsor school \n02/07/23 06:55\nWhile the nine-year-old Prince is currently attending Lambrook prep school, it is thought that George will eventually transfer to Eton, where his father spent five happy years.\n215\n comment\ns\n39\n share\ns\nPrince Edward and Sophie were the 'forerunners of trying to balance royal duties with money-making careers' ahead of Sussexes - until late Queen paid them £250,000 to quit jobs, new documentary reveals\n01/07/23 12:16\nPrince Edward: Will He Change the Royals?, which airs on Channel 5 tonight, looks at his journey to becoming one of the most senior members of the British Royal Family.\n50\n comment\ns\n2\n video\ns\n46\n share\ns\nMeghan and Harry 'believe they have been \"repeatedly unlucky\" and blame Covid, economic woes, the death of the Queen and the failing of Prince Philip's health for their faltering attempts to launch post-royal careers'\n01/07/23 10:36\nThe Duke and Duchess only have one major deal left since Megxit - the $100m contract signed with streaming giant Netflix - after they were embarrassingly ditched by Spotify last month.\n1000\n comment\ns\n859\n share\ns\nWant a body like Kate's? I'm a personal trainer and here are the workouts you need to do to get a toned figure like the Princess of Wales (and you might be surprised)\n01/07/23 08:44\nWhat's the secret behind Kate's fabulous figure? A personal trainer reveals just how to get a body like the Princess of Wales...\n935\n comment\ns\n2\n video\ns\n119\n share\ns\nKate 'is playing the long game' and is always aware that 'I am going to be Queen one day': New revelations that Princess of Wales was the one behind royal family's Oprah fightback statement show she is the REAL steely operator in the Palace, sources say\n01/07/23 08:38\nDetails of how the Queen approved the subtle but firm comeback to Harry and Meghan's toxic attack on the monarchy - using the phrase 'recollections may vary' - have emerged in a book.\n1136\n comment\ns\n1\n video\n442\n share\ns\nALISON BOSHOFF: Just as Meghan hires a Hollywood powerbroker to boost her career, Harry is returning to his campaigning roots... So is the prince tiring of his wife's showbiz world? \n01/07/23 12:08\nALISON BOSHOFF: As Meghan said, in typically syrupy style while promoting her Archetypes podcast last year, she and husband Prince Harry are 'like salt and pepper - we always move together'.\n229\n comment\ns\n3\n video\ns\n136\n share\ns\nThe Duke of Sussex wants £570,000 payout over hack claims\n30/06/23 11:54\nThe Duke of Sussex and three others are suing The Mirror's publisher, alleging phone hacking and other illegal activity.\n201\n comment\ns\n81\n share\ns\nCould the Harry and Meghan 'double act' be over? PR experts say Duke and Duchess may embark on more solo projects to 'play to their strengths' and 'avoid ridicule' - amid reports prince is making Netflix show about Africa on his own\n30/06/23 06:30\nBrand and culture expert Nick Ede told MailOnline that Meghan and Harry may increasingly do solo projects to avoid 'ridicule' that some of their other projects have suffered.\n263\n comment\ns\n1\n video\n85\n share\ns\nBrothers at arms' length! Harry and William record separate messages of congratulations for winners of the Diana Awards - as it is revealed Duke of Sussex made surprise visit to event held in LA last month\n30/06/23 04:16\nThe Prince of Wales, 41, appeared first during the 43-minute streamed event by praising the 'courage, compassion and relentless dedication' shown by the young winners.\n181\n comment\ns\n1\n video\n95\n share\ns\nCoronation 2.0! Prince Harry will miss out as his father is made Scotland's Head of State in Edinburgh next week - while William and Kate get a starring role\n30/06/23 03:53\nKing Charles will officially be made Scotland's Head of State in a regal Thanksgiving service at St Giles' Cathedral in Edinburgh - it's thought Prince Harry won't attend.\n33\n comment\ns\n96\n share\ns\nIs there any coming back for Harry? Royal experts warn it will be hard for the Duke to 'assert any constitutional role in the UK' after his eviction from Frogmore - as he and Meghan finally hand over keys to the cottage\n30/06/23 01:44\nThe Duke and Duchess of Sussex were asked to move any remaining possessions out of their Grade II-listed five-bedroom cottage close to Windsor Castle in January.\n4\n comment\ns\n1\n video\n62\n share\ns\nTalented podcast people have 'lost their jobs', because of the huge money the industry spends on the likes of Harry and Meghan's Spotify deal - and there's 'a lot of anger', Rebecca English tells PALACE CONFIDENTIAL\n30/06/23 07:42\nSpeaking on Palace Confidential, Daily Mail Royal Editor Rebecca English and Daily Mail's Diary Editor Richard Eden discussed whether it was open season to take a shot at Harry and Meghan.\n1\n comment\n51\n share\ns\nWhat goes on tour, stays on tour... or does it? Royal hen and stag dos revealed - from Princess Diana and Sarah Ferguson being 'arrested' to Meghan Markle's low-key party at Soho Farmhouse\n30/06/23 06:02\nIt is difficult to imagine the royal family conforming to the wild traditions of the stag and hen do but they have enjoyed their last days of freedom with as many antics as any other bride or groom-to-be.\n40\n comment\ns\n17\n share\ns\nJAN MOIR: The thin gruel of the Sussexes' victimhood is running out - and they have nothing else left in the tank \n29/06/23 11:59\nJAN MOIR: Set your alarm for November - Omid Scobie's new book Endgame will be out. The blurb promises it will be a 'penetrating investigation' about the Royal Family's 'fight for survival'.\n337\n comment\ns\n122\n share\ns\nJudge in Prince Harry's hacking trial against the Mirror's publisher says he will consider the 'reliability' of a journalist helping the Duke of Sussex who has been paying potential witnesses \n29/06/23 09:01\nA Judge in the Mirror hacking trial brought by Prince Harry (pictured) and three other claimants said today he will carefully consider the reliability of a journalist who has been paying potential witnesses.\n1\n comment\n47\n share\ns\nIs Prince Harry about to go it alone? Duke 'is planning to film a new Netflix documentary about his beloved Africa without Meghan' as royal couple try to revive their flagging fortunes after their Spotify podcast was axed\n29/06/23 06:55\nThe Duke and Duchess of Sussex only have one major deal left since Megxit - the $100million contract with the streaming giant - after Spotify parted ways with the couple.\n686\n comment\ns\n261\n share\ns\nOmid Scobie delays publication of 'Endgame' to include details on the Coronation - as experts say it may include 'sensational details' on duke's family rows\n29/06/23 01:52\nMr Scobie, long considered the Sussexes' preferred royal reporter, is releasing 'Endgame' - a 'penetrating investigation' about the Royal Family's 'fight for survival' - on November 21.\n278\n comment\ns\n19\n share\ns\nIs Guy Pelly the key to mending the royal rift? Former nightclub owner and 'court jester' spotted partying with William at Koko has a close bond with both brothers (and even visited Harry and Meghan in California!)\n29/06/23 11:14\nHere FEMAIL looks back over Guy Pelly's close connection to the British princes - and how the former nightclub owner could prove key to bridging the gap between them.\n12\n comment\ns\n1\n video\n65\n share\ns\nHarry and Meghan will need to strike a 'private deal' with Charles to stay in royal residences again or 'they may have to rely on hotels and friends' during UK visits as they finally vacate Frogmore Cottage\n29/06/23 08:36\nThe last of the couple's possessions have been shipped to California and the keys returned six months after they were given their marching orders.\n191\n comment\ns\n1\n video\n151\n share\ns\nHarry and Meghan finally vacate Frogmore Cottage: Sussexes return keys and their last possessions are shipped to California six months after they were booted out following release of duke's bombshell memoir Spare \n29/06/23 01:08\nPrince Harry and Meghan Markle have finally vacated Frogmore Cottage in Windsor - six months after the King gave them their marching orders.\n209\n comment\ns\n1\n video\n157\n share\ns\nConvicted phone hacker helping Prince Harry's case against the Mirror's publisher 'offered large sums to would-be witnesses', High Court hears \n28/06/23 09:45\nAndrew Green KC, representing Mirror Group Newspapers - which is being sued by the duke and the three other claimants - told the judge the practice was 'extraordinary'.\n189\n comment\ns\n69\n share\ns\nOmid Scobie's next book 'Endgame' will contain 'sensational details' on Harry's family rows - but the longer it's delayed the more likely the title is to describe the Sussexes' business affairs rather than the collapse of the Royals, expert says\n28/06/23 08:56\nIt is thought the publishing date of Omid Scobie's new book 'Endgame' could have been moved back to give the author a chance to include inside material through and beyond the King's coronation.\n460\n comment\ns\n55\n share\ns\nThe boys are back in town! William's night out with 'court jester' Guy Pelly and school friend James Meade is reminiscent of their wild parties at Boujis with Harry and Kate 20 years ago.. (and amazingly they're still friends with BOTH royal brothers now!)\n28/06/23 06:05\nAfter graduating university in his early twenties, the young royal was often seen stumbling out of west London nightclubs including Boujis, Mahiki and Bunga Bunga.\n100\n comment\ns\n1\n video\n24\n share\ns\nHarry and Meghan's biographer Omid Scobie announces new book 'Endgame' about the Royal Family's 'fight for survival' will be released on November 21 \n28/06/23 01:36\nThe author's previous book, Finding Freedom, covered Prince Harry and Meghan Markle 's decision to step away from their roles as senior royals.\n2741\n comment\ns\n157\n share\ns\nSir Trevor Phillips says Meghan Markle had to 'learn to be black' when she joined the Royal Family 'but made a bit of a mess of it' - after she grew up in wealthy LA district 'with race never part of her background'\n28/06/23 01:00\nSir Trevor Phillips said the Duchess of Sussex, 41, 'never regarded herself particularly as black' before joining the Royal Family, which he said was 'understandable' due to her privileged upbringing.\n282\n comment\ns\n2\n video\ns\n435\n share\ns\nHere come the Spencer brides! From Victoria Lockwood's medieval-inspired gown with a FUR trim to Lady Diana's dress of the century - a look back at the family's jaw-dropping weddings \n28/06/23 06:44\nIt's no surprise that when a Spencer gets married it is a resplendent affair. Indeed, over the years the brides have ensured all eyes were firmly on them.\n243\n comment\ns\n52\n share\ns\nAnother blow for Harry and Meghan: YouTube star accuses the Sussexes of 'DEFAMING' her in Netflix docuseries and vows to 'pursue every opportunity to nail them to the wall'\n28/06/23 04:35\nYouTube star Shallon Lester has come out guns blazing against Megan Markle and Prince Harry, claiming that the royal couple 'defamed' her in their self-titled Netflix series last year.\n152\n comment\ns\n1\n video\n87\n share\ns\nPrince Harry 'should get no more than £500' in compensation for his hacking claims against the publisher of the Mirror, High Court hears \n27/06/23 08:37\nMirror Group Newspapers said the Duke of Sussex (pictured) was not a victim of phone hacking and the 'true purpose' of his legal claim was to further his campaign to 'reform' the British Press.\n303\n comment\ns\n217\n share\ns\nMeghan Markle's CV before she hit the jackpot reveals the actress-turned-royal's 'special skills' as well as height and weight\n27/06/23 11:59\nKnown for her starring role in US legal television drama suits, and later marry Prince Harry, it is hard to imagine Meghan Markle a struggling actress.\n378\n comment\ns\n160\n share\ns\nExplained: Why Zara Tindall and Peter Phillips do not have titles and are not working royals - despite being Princess Anne's children\n27/06/23 11:57\nZara Tindall and her brother Peter Phillips are the eldest of the late Queen's eight grandchildren but are the only ones without royal titles.\n177\n comment\ns\n20\n share\ns\n'Turns out Meghan Markle was not a great audio talent, or necessarily any kind of talent': Hollywood talent agency supremo Jeremy Zimmer dismisses Duchess as a talentless broadcaster after Spotify axed its £18m deal with the Sussexes\n26/06/23 03:29\nJeremy Zimmer, the chief executive of United Talent Agency, said he was not surprised that Spotify had ditched the couple.\n1733\n comment\ns\n1\n video\n4182\n share\ns\nRiding instructor, 26, who suffered horror horseback accident at five-star country hotel frequented by Prince William and Harry is suing for £200,000\n26/06/23 08:25\nKatie Haigh, 26, has gone to the High Court to seek damages over the impact of her accident at the Coworth Park hotel - which has extensive royal connections.\n56\n comment\ns\n49\n share\ns\nTaylor Swift allegedly snubbed invite from Meghan to appear on podcast\n25/06/23 05:08\nTaylor Swift 'was asked by Meghan herself to appear on Archetypes but her representative declined'. The blow comes as Netflix and Spotify have said they were 'underwhelmed' by the couple's lack of ideas.\n comment\ns\n share\ns\nA-Dior-ing royals! How the French designer became a go-to for fashionable blue-blooded types like Harry and Meghan (and muse Princess Margaret started it all!)\n25/06/23 02:16\nRoyals from around the world have all turned to the French fashion house for their wardrobes, from Princess Margaret and Princess Diana to Grace and Charlene of Monaco.\n31\n comment\ns\n48\n share\ns\nWhat is the tragic saga that explains why Prince Charles walked  Diana's goddaughter down the aisle - even though her own father was there in the church?\n25/06/23 06:54\nKing Charles is fondly remembered for walking Meghan Markle down the aisle - but this was not the first time that the former Prince of Wales has stepped up to take on the responsibility.\n250\n comment\ns\n50\n share\ns\nHow Taylor Swift 'snubbed handwritten invite from Meghan to appear on her Spotify podcast (letting her rep say no!) while execs rejected idea after idea from the subpar Sussexes'... though a Great Expectations-inspired Netflix show IS on the way \n24/06/23 10:03\nTaylor Swift 'was asked by Meghan herself to appear on Archetypes but her representative declined'. The blow comes as Netflix and Spotify have said they were 'underwhelmed' by the couple's lack of ideas.\n502\n comment\ns\n14307\n share\ns\nSo what's next for Harry and Meghan after £18M Spotify deal was axed? PR experts suggest Duchess could re-join social media, relaunch her lifestyle blog The Tig or return to acting... but they're BOTH in dire need of a rebrand\n24/06/23 08:35\nThe Duke and Duchess of Sussex still have an £80million Netflix deal while Harry is said to have a four-book deal with Penguin Random House worth up to £29million.\n558\n comment\ns\n1\n video\n80\n share\ns\nMountbatten's murder, two fatal air crashes and tragic Prince John's epileptic fit: The deaths that rocked the Royal Family before Diana's car crash - including the sad fate of the OTHER Prince William\n24/06/23 08:05\nIt is remembered as one of the most shocking events to hit the Royal Family in modern times. Yet the loss of Princess Diana in 1997 was not the first shattering royal death the Windsors suffered.\n91\n comment\ns\n1\n video\n53\n share\ns\nHarry 'wanted to interview Putin and Trump on their childhood traumas'\n23/06/23 12:43\nPrince Harry was hoping to interview Vladimir Putin, Donald Trump and Mark Zuckerberg about their upbringing and childhood traumas on a Spotify podcast, it has emerged.\n comment\ns\n share\ns\nA pretty price! Prince Harry painting from 1998 expected to fetch up to £600,000 at auction\n23/06/23 12:39\nThe sale of the portrait, which depicts Prince Harry in his youth, takes place on 30 June at Phillips auction house in London and it's estimated to reach between £400,000 - £600,000.\n1\n comment\n45\n share\ns\nPrince Harry 'horrified' Spotify bosses by admitting he signed quick deals 'to pay for security' in Oprah interview, Richard Eden tells PALACE CONFIDENTIAL \n23/06/23 09:34\nSpeaking on Palace Confidential, Daily Mail Royal Editor Rebecca English teased 'a big launch' from the Prince of Wales, 41, on project initiatives this week.\n329\n comment\ns\n183\n share\ns\nPrince Harry 'wanted to interview Vladimir Putin, Donald Trump and Mark Zuckerberg about their upbringing and childhood traumas' - leaving Spotify execs scratching their heads before £15m podcast deal was scrapped \n22/06/23 11:39\nHarry discussed his ideas for possible shows with multiple producers and production companies, telling them how he wanted to speak to the likes of Vladimir Putin and Donald Trump.\n710\n comment\ns\n2\n video\ns\n736\n share\ns\nMeghan Markle is more unpopular than ever: Seven out of 10 Brits have a negative view of Duchess of Sussex, as poll shows Anne, Kate and William are best-loved royals \n22/06/23 05:40\nMeghan Markle's net favourability among the public has fallen to a record low of -47, the lowest it has been since YouGov began recording her favourability in 2017.\n877\n comment\ns\n158\n share\ns\nESPN analyst Stephen A. Smith claims no one cares about Prince Harry and Meghan Markle 'unless they're insulting their family' after his former colleague Bill Simmons branded them 'f***ing grifters'\n21/06/23 06:29\nESPN analyst Stephen A. Smith bizarrely waded in on the British Royal family Tuesday as he delivered a scathing verdict of Prince Harry and Meghan Markle following their Spotify split.\n148\n comment\ns\n1\n video\n93\n share\ns\nFrom Party Prince to world statesman and a loving dad: Today, on his birthday, Prince William looks every inch our future King. He's even grown a sense of humour!\n21/06/23 05:30\nToday he is as comfortable on TikTok as with delivering speeches to the nation. But wind back the decades to Prince William's teenage years and he cut a very different character...\n612\n comment\ns\n225\n share\ns\nTV host Peter Stefanovic slams 'swell guy' Prince Harry and claims he and wife Meghan Markle could run out of money after their $20M Archetypes Spotify podcast is axed\n21/06/23 01:33\nPeter Stefanovic has slammed Prince Harry for making explosive claims about his brother William in his controversial memoir Spare.\n6\n comment\ns\n1\n video\n62\n share\ns\nPICTURED: Spotify exec Bill Simmons is seen for the first time since he publicly branded Harry and Meghan 'f***ing grifters' after their $20million Archetypes podcast was axed \n20/06/23 09:17\nBill Simmons, 53,  Head of Podcast Innovation and Monetization at Spotify, was spotted on his way to work in downtown LA after slamming Prince Harry and Meghan Markle 'f***ing grifters'.\n12\n comment\ns\n3\n video\ns\n97\n share\ns\nMeghan is NOT in talks to become the 'Duchess of Dior': Sources deny rumours that she is in line for a mega-bucks deal with the French fashion house - as resurfaced clip from 2015 crime drama shows her playing perfume model \n20/06/23 09:12\nThe Duchess of Sussex says she is not signing a 'megabucks' deal with Dior to become the face of the famous fashion house.\n742\n comment\ns\n1\n video\n124\n share\ns\n'You dress up like a Nazi and now you're trying to come back as The Pope?' Kelly Osbourne brands Prince Harry 'a whining, complaining t**t' in an extraordinary rant\n20/06/23 08:47\nThe star, 38, delivered a scathing rant where she slammed the Royal's recent confessions about his mental health struggles.\n843\n comment\ns\n1\n video\n850\n share\ns\nMeghan's Dior audition? Resurfaced clip from 2015 crime drama shows the Duchess of Sussex playing a perfume model - as she's rumoured to be in line for lucrative deal with the fashion house\n20/06/23 07:40\nA resurfaced clip from a low-budget crime drama featuring the American-based Duchess of Sussex, 41, shows the former actress working her angles in a photoshoot for a perfume ad.\n573\n comment\ns\n1\n video\n1508\n share\ns\nRevealed: the very Royal reason William and Kate love to match in blue outfits when they're out and about, but Harry and Meghan prefer a green tinge...\n20/06/23 06:38\nBecause blue has been been William and Kate's colour for some time, says fashion expert Rosie Harte. The author of the newly published  book suggests it symbolises both peace and modernity.\n90\n comment\ns\n121\n share\ns\nThe Duke and Duchess of Dior? Experts say both Meghan AND Harry could be part of mega-bucks deal with French fashion house after Prince 'plugged' brand at Coronation - because couple 'realise it's easier to be clothes horses than issues warriors' \n19/06/23 08:35\nPrince Harry is also highly likely to be part of any agreement because the French fashion house will be desperate to have a royal promoting its menswear, it has been claimed.\n1059\n comment\ns\n355\n share\ns\nKing Charles 'offers olive branch to Harry' with Father's Day message after prince and Meghan's Spotify deal was axed and streaming exec called them 'f***ing grifters'\n18/06/23 11:14\nThe monarch shared a collection of photos on Twitter today, including one taken on the Balmoral estate in Scotland in 1997 when Prince William was 14 and Harry was 12.\n506\n comment\ns\n415\n share\ns\n'Diana's double': Royal fans liken Prince William's sweet Father's Day picture to childhood photo of Princes William and Harry with late Princess of Wales\n18/06/23 09:30\nRoyal fans have compared a photograph released for Father's Day of William and his three children to an image of Diana and her two sons, which was taken at Highgrove House, Gloucestershire, in 1988.\n109\n comment\ns\n1\n video\n265\n share\ns\nColombia jungle dad says using hallucinogenic drug favoured by Prince Harry was key to searchers finding his children alive after plane crash \n17/06/23 05:04\nManuel Ranoque, 32, admitted resorting to yagé, a bitter tea made of plants that is more widely known as ayahuasca, in a bid to have visions which would lead the team to the children.\n71\n comment\ns\n1\n video\n114\n share\ns\nPrince Harry's ongoing High Court battles over his UK police protection 'expected to cost taxpayers over £1million' \n17/06/23 09:00\nThe cost for the High Court battle has already hit £502,236 and Prince Harry's appeal against a court decision last month is set to cost an additional £500,000.\n20\n comment\ns\n83\n share\ns\n'It wasn't just a hobby, it was a really successful business...' As her Spotify deal falls apart, could Meghan Markle engineer a big-money comeback for lifestyle blog The Tig?\n17/06/23 06:20\nWill the Duchess of Sussex revive her popular lifestyle blog? Rumours abound that The Tig is set to make a comeback as Meghan seeks to expand her commercial activities amid declining popularity.\n197\n comment\ns\n132\n share\ns\nTrooping the Colour in spectacular pictures: a look back at the balcony appearances and the changing face of the Royal  Family through the decades - including the year Princess Diana made her debut\n17/06/23 06:12\nTrooping the Colour has marked the official birthday of the Sovereign for more than 260 years. These balcony photos are a telling portrait, from a young Princess Elizabeth  to Prince Louis's debut.\n216\n comment\ns\n1\n video\n63\n share\ns\nPrince Harry and Meghan Markle are called 'f*****g grifters' by Spotify exec Bill Simmons after their $20M Archetypes podcast is axed\n17/06/23 12:43\nBill Simmons, who sold his podcast and sports journalism company The Ringer to Spotify for $200 million in 2020, now works as Spotify's head of podcast innovation. He condemned the Sussexes.\n642\n comment\ns\n2\n video\ns\n1391\n share\ns\nMoney trouble in paradise? It costs a lot to fund a 9-bedroom Montecito mansion, all that security - and all those court cases. As their big bucks Spotify deal comes to a sudden end, will Harry and Meghan be forced to rein in their lifestyle?\n17/06/23 12:15\nA multi-million pound-shaped hole in the couple's finances imperils not just their oh-so comfy California lifestyle but threatens to undermine the model of their post-royal life\n175\n comment\ns\n106\n share\ns\nClarifications and corrections\n16/06/23 05:16\nAn article published on 21st January followed up on reporting from another publication which quoted that Michael Booley stated that the Duke of Sussex's recollection of military flight training is a...\n comment\ns\n share\ns\nMeghan only has Netflix left: £81m deal with streaming service is last surviving major deal in her media empire after Spotify dropped plans for a second series of her podcast\n16/06/23 12:54\nSince quitting their royal duties in 2020 and jetting off to California to live in their new $14million  mansion, the couple have been building a complex network of companies to help promote 'their truth'.\n299\n comment\ns\n1\n video\n194\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/prince_william/index.html",
        "https://www.dailymail.co.uk/news/kate_middleton/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/camilla-parker-bowles-duchess-of-cornwall/index.html",
        "https://www.dailymail.co.uk/news/article-12281405/Homeland-Security-REFUSES-reveal-details-Prince-Harrys-visa-right-privacy.html",
        "https://www.dailymail.co.uk/news/article-12268071/Prince-Harry-takes-two-year-old-Lilibet-July-4th-parade-hours-Kings-Scottish-Coronation.html",
        "https://www.dailymail.co.uk/news/article-12256397/Prince-Harry-Meghan-Markle-hold-hands-share-laugh-joke-Santa-Barbara.html",
        "https://www.dailymail.co.uk/news/doria-ragland/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/diana/index.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}