{
    "url": "https://www.dailymail.co.uk/news/prince-andrew/index.html",
    "title": "Prince Andrew News: Latest Updates on Jeffrey Epstein Scandal | Daily Mail Online",
    "hash": "5295cff1081c4d31c2c4899afdf75e29",
    "text": "Prince Andrew News: Latest Updates on Jeffrey Epstein Scandal | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking News\n\n\n\n\n\n\n\n                    \n                    Australia\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Video\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Russia-Ukraine\n                    \n                \n\n\n\n\n\n\n\n                    \n                    China\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debate\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    King Charles III\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Weather\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Most read\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPrince Andrew News\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending Prince Andrew News\nPrince Andrew is seen for first time since Sarah Ferguson's mastectomy\nCouple who charmed the world with their fairytale love story\nHarry and Meghan 'stunned' after being evicted from Frogmore Cottage\nGraffiti appears of Prince Andrew with 'Jim Fixed It For Me' badge\nKing's snub will make Harry 'furious' as Anne and Edward will deputise\nQueen's favourite child is Prince Edward, royal biographer claims\nPM's daughter re-surfaces in Sydney with hotelier Justin Hemmes\nGhislaine Maxwell's family 'scared for her' as Jean-Luc Brunel dies\nRELATED TOPICS FOR Prince Andrew\nKing Charles III\nPrincess Beatrice\nPrincess Eugenie\n\n\n\n\n\n\nPrince Andrew News: Latest Updates On Duke Of York\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nPrince Andrew is seen out riding in Windsor after ex-wife Sarah Ferguson said her family were 'scared' by her cancer diagnosis in podcast released as she 'recuperates at home' following mastectomy \n07/07/23 12:52\nPrince Andrew has been seen for the first time since his ex-wife Sarah Ferguson revealed she is revealed she is 'recuperating at home' following her mastectomy. The brother of King Charles went for a ride around Windsor Castle this morning, stopping to say hello to the late Queen's former groom Terry Penury. Joined by a female groom, and casually dressed for the summer weather in an open collar shirt, Andrew rode through Windsor before jumping behind the wheel of a car.\n...read\n30\n comment\ns\n1\n video\n33\n share\ns\nPrince Andrew faces fresh calls for FBI probe over his friendship with Jeffrey Epstein after emails from the paedophile billionaire suggest Duke 'lied' in his BBC Newsnight interview\n05/06/23 08:59\nA message written by the late billionaire paedophile and released as part of a court case in the US show he was presenting Andrew, 63, as a potential investor in 2011.\n157\n comment\ns\n1\n video\n122\n share\ns\nThe couple who charmed the world: How the Queen and Prince Philip's romance began with teenage crush, blossomed on the dance floor and led to 73-year marriage that transfixed millions\n28/05/23 02:06\nThe then Princess Elizabeth and the Duke of Edinburgh married in November 1947, after a courtship that had lasted for nearly a decade. Above: At a ball in 1947; and meeting in 1939.\n155\n comment\ns\n1\n video\n95\n share\ns\nPrince Andrew 'has no plans' to let Charles push him out of his Royal Lodge home to let William and Kate move in and he is determined to 'see out the 55 years left on his lease'\n15/05/23 07:30\nA source close to the disgraced Duke Andrew, 63 (pictured), last night rejected reports suggesting he 'fears the royals may turn off the utilities to get him out'.\n220\n comment\ns\n75\n share\ns\nWhat do the stars tell us about the Royal Family's relationships? The Queen and Philip were a match made in heaven, writes astrologer PATRICK ARUNDELL. But Harry and Meghan's close bond must survive the confusing energies of Neptune!\n15/05/23 05:30\nPowerful astrological forces are playing out in the most intimate realm, shaping the relationships which not only sustain the lives of the individual Royals, but help hold the Monarchy itself together.\n3\n comment\ns\n17\n share\ns\nHow Princess Margaret's 1978 divorce from Lord Snowdon 'cleared the way' for future royals to split - a look at all the royal family divorces (some ending more acrimoniously than others)\n10/05/23 05:30\nThe Royal Family has been no stranger to divorce in recent decades, with the marriages of Prince Charles  Prince Andrew and Princess Anne among those hitting the rocks.\n39\n comment\ns\n9\n share\ns\nThe closest royal divorcées EVER? Fergie fulfils her promise to 'always stand by' Prince Andrew as she sits with disgraced Duke she still shares a home with at Coronation concert\n08/05/23 08:34\nFEMAIL takes a look back at how Andrew and Sarah have become the closest ex-couple in the Royal Family's history - after she joined the Duke at the Windsor concert last night.\n78\n comment\ns\n1\n video\n29\n share\ns\nPrince Andrew and Sarah Ferguson reunite! Fergie is brought back into the fold for the King's Coronation concert - despite not being invited to the main event\n07/05/23 07:39\nThey've been divorced since 1996 - yet Prince Andrew and Sarah Ferguson put on a friendly display when attending the Coronation concert together.\n333\n comment\ns\n93\n share\ns\nIs Charles' stance softening towards his outcast brother Andrew? King allows Duke to wear formal Garter robes for the Coronation despite the Queen banning him from doing so\n07/05/23 01:12\nWhile Andrew did not have any official role in yesterday's events, he still wore his Order of the Garter robe which holds special significance for the royals.\n189\n comment\ns\n34\n share\ns\nBadges of honour at Charles's Coronation: Prince Harry dons war medal while Andrew wears order of the garter and Mike Tindall sports his MBE for rugby \n06/05/23 06:04\nPrince Harry, shunned from the Buckingham Palace balcony once again , and relegated to the third row during the ceremony, was among the Royals to display his collection of medals.\n8\n comment\ns\n338\n share\ns\nKing Charles Coronation RECAP: Today is the day for King Charles as Royal Family release stunning Westminster Abbey footage as Coronation Day dawns, while Just Stop Oil plot graffiti attack on monument at The Mall - latest updates\n04/05/23 08:18\nCORONATION LIVEBLOG: Stay with MailOnline for all the latest news ahead of King Charles III's Coronation at Westminster Abbey today - and for updates about the Royal Family.\n558\n comment\ns\n186\n share\ns\nPrincess Anne suggests Charles was right to want a slimmed-down monarchy when Harry and Andrew were working royals but warns there could now be 'too much burden on William and Kate', experts say \n02/05/23 02:25\nThe late Queen's only daughter, 72, who is the hardest working royal in terms of annual engagements, spoke in defence of the Royal Family, insisting it brings 'long-term stability'.\n29\n comment\ns\n1\n video\n16\n share\ns\nPrincess Anne holds bombshell interview on eve of King Charles' coronation as she says slimmed down monarchy 'isn't a good idea', warns over royal links to slavery and talks about THAT image of grieving Queen alone at Philip's funeral\n02/05/23 06:02\nThe Queen's only daughter, 72, who has a key role in her brother Charles' Coronation on Saturday, spoke in defence of the Royal Family in a candid interview with Canada's CBC News.\n3003\n comment\ns\n233\n share\ns\nSupport for the Sussexes slumps: Now only Prince Andrew is less popular than Harry and Meghan... and just a third believe all of their claims about the Royal family\n01/05/23 09:12\nIt seems the couple's endless tell-all interviews moaning about their treatment before they left for a lucrative life in the United States have taken their toll on their popularity.\n307\n comment\ns\n1\n video\n26\n share\ns\nThe scandalous history of Frogmore Cottage: Prince Harry and Meghan's former home was once the base of Queen Victoria's beloved Indian manservant... until he was thrown out by King Edward VII, who HATED him \n01/05/23 03:38\nAbdul Karim was given use of Frogmore Cottage by Queen Victoria after he became very close her. But after her death in 1901, Karim was ordered to leave the property and was sent back to India.\n76\n comment\ns\n5\n share\ns\nEmily Maitlis fears infamous Newsnight interview with Prince Andrew 'hurt' his daughters and he had hoped he could 'clear his name' before Beatrice's wedding \n29/04/23 08:03\nFormer BBC presenter Emily Maitlis has revealed how she fears her Newsnight interview with Prince Andrew may have inadvertently 'hurt' his daughters Beatrice and Eugenie.\n188\n comment\ns\n1\n video\n1\n share\nPrince Andrew meets the mounties: Duke goes riding with Canadian Royal Mounted Police before they take part in coronation \n29/04/23 11:19\nThe Duke of York, 63, rode on horseback alongside one of the 'mounties'. Five  will take part in the coronation procession and will ride horses from the Royal Mews gifted by the RCMP to the royal family.\n40\n comment\ns\n1\n video\n28\n share\ns\nPrince Andrew is spotted driving to Windsor Castle with just over a week to go before brother King Charles' coronation - after Emily Maitlis lifted the lid on Duke of York's disastrous Newsnight interview\n28/04/23 03:01\nThe Duke of York made an appearance just days before the King is set to be officially crowned at Westminster Abbey on May 6 with final preparations under way at the historic cathedral.\n35\n comment\ns\n1\n video\n28\n share\ns\nLet's be Friends! I'm a relationship expert and here's 9 ways to stay close to an ex like Jennifer Aniston and Justin Theroux  \n28/04/23 09:46\nAs Jennifer Aniston, 54, of LA, is pictured in New York with ex Justin Theroux, Femail shares tips from dating coach Kate Mansfield on how to successfully stay friends with an ex.\n34\n comment\ns\n10\n share\ns\n'You couldn't have handed me a better present': Lawyer for Prince Andrew's sex accuser Virginia Giuffre says she was 'thrilled' at Duke's Newsnight interview because it was a 'roadmap to tear him apart' after he said 'so many provably false things'\n27/04/23 09:44\nAttorney Sigrid McCawley said that the Duke of York's series of blunders in the 2019 BBC interview provided them with a 'roadmap to tear him apart'.\n8\n comment\ns\n1\n share\nQueen Elizabeth 'realised Prince Andrew's Newsnight interview was a car-crash before he did': Potential backlash from public 'dawned on Monarch when she read the transcript before it was broadcast' while he still thought it went well \n26/04/23 11:17\nThe late Queen Elizabeth II realised her second son's interview with Newsnight was a mistake before he did, a new documentary claims.\n587\n comment\ns\n1\n video\n24\n share\ns\nPrince Andrew 'may have given his disastrous Newsnight interview to help daughter Beatrice', reveals interviewer Emily Maitlis in new Channel 4 documentary \n26/04/23 11:04\nPrince Andrew may have made his disastrous Newsnight appearance in a bid to help his daughter Princess Beatrice, his interviewer Emily Maitlis said yesterday.\n132\n comment\ns\n1\n video\n1\n share\nI warned Prince Andrew it was a bad idea to agree to the infamous Newsnight interview, Duke of York's lawyer pal says\n26/04/23 11:00\nLawyer Paul Tweed (left) said he advised the Duke of York (right) against speaking to the BBC about his links with convicted paedophile Jeffrey Epstein\n109\n comment\ns\n1\n share\nFrom dashing war-hero to absolute zero...Disgraced Prince Andrew is even less popular than Harry and should be cut from line of succession, says exclusive poll for Mail Royals!\n24/04/23 03:28\nFrom royal warrior to scandal-tainted outcast, the full extent of Prince Andrew's  fall from grace has been revealed  in Mail Royals' exclusive new poll.\n47\n comment\ns\n33\n share\ns\nPrince Andrew bravely helped the firemen through the blaze at Windsor Castle... but got lost! New TV documentary tells how Duke played a key role in battle to control the fire that devastated Queen's favourite home \n22/04/23 06:22\nIt is 30 years since the Windsor Castle fire broke out on the late Queen and Duke of Edinburgh's 45th wedding anniversary. A new television documentary reveals Prince Andrew's role.\n2\n comment\ns\n20\n share\ns\nSarah Ferguson breaks her silence on Coronation invite 'snub' - and why she's 'loving' her current relationship with Prince Andrew\n20/04/23 08:43\nSarah Ferguson revealed she will not be at the Coronation because she is divorced to Prince Andrew while speaking to Kate Garraway and Adil Ray on Good Morning Britain today.\n659\n comment\ns\n1\n video\n110\n share\ns\nQueen's decision to strip Prince Andrew of his HRH title was her 'final gesture of self-sacrifice' - as she put the nation ahead of her own feelings one last time before her death, new documentary that lays bare the end of her reign claims\n19/04/23 11:01\nEpisiode five of Inside the House of Windsor, titled Heirs and Spares, which streams on ITVX from Thursday, focuses on the late Queen's loyalty to her son as he was blighted by scandal.\n271\n comment\ns\n3\n video\ns\n41\n share\ns\nQueen sent Prince Andrew to do 'his duty' in the Falklands War but 'a very irritated' Charles 'wasn't allowed' and was 'left in the shadows', new docuseries claims - echoing decision made for Princes Harry and William\n18/04/23 11:11\nSpeaking in The Real Crown: Inside the House of Windsor, General Sir Mike Jackson, former head of the British Army, suggests Elizabeth II was keen for Andrew to take part in the 1982 conflict.\n16\n comment\ns\n44\n share\ns\nChannel 4 announces 'alternative' coverage of King's Coronation: Broadcaster will air Frankie Boyle doc on the monarchy's future, a 60-minute special on Prince Andrew's Newsnight interview and an episode of satirical comedy The Windsors\n17/04/23 11:39\nThe broadcaster has announced a schedule of 'alternative' programmes to counter what it called the national 'forelock-tugging' ahead of Charles's crowning.\n1023\n comment\ns\n58\n share\ns\nForlorn Fergie? Duchess of York looks solemn as she's spotted leaving Royal Lodge with Prince Andrew after coronation snub\n16/04/23 04:18\nThe 63-year-old Duchess of York was seen in the passenger seat of Prince Andrew's Range Rover leaving the Royal Lodge in Windsor.\n336\n comment\ns\n196\n share\ns\n'Sarah Ferguson wasn't invited to the coronation because it would have provoked criticism - which Charles doesn't need': Experts say Fergie 'is not a member of the Royal Family' and suggest her presence would have 'embarrassed' the monarch\n14/04/23 03:21\nRoyal expert Tom Bower said Sarah, Duchess of York had excluded herself because of her previous 'conduct', adding that her presence would 'provoke critical comment which Charles doesn't need'.\n853\n comment\ns\n95\n share\ns\n'As a father of two Sandhurst alumni, I know they'll be full of pride': King Charles references Harry and William and says he 'remembers' their own Sovereign's Parade in poignant speech - amid preparations for Coronation he hopes will 'mend family rifts'\n14/04/23 10:51\nHis Majesty inspected 171 officer cadets who have just gone through 44 weeks of intensive training at the prestigious military academy in Berkshire.\n365\n comment\ns\n3\n video\ns\n34\n share\ns\nPrince Andrew will NOT copy Harry and release a tell-all memoir because he stands 'four square behind the King' as insiders reveal Charles is giving the Royal family the opportunity to 'pull together'\n13/04/23 06:26\nALISON BOSHOFF: There was speculation the Duke of York (pictured) would offer an account of his life story, particularly after the incredible financial success of Prince Harry's bombshell memoir Spare.\n261\n comment\ns\n14\n share\ns\nSo which royals are attending the King's coronation? Harry is in and Meghan is out, Charles 'hasn't invited' Fergie and Eugenie and Beatrice won't be part of procession - as questions hang over whether Prince Andrew will be at ceremony\n13/04/23 03:13\nMore than 2,000 people will gather at Westminster Abbey in London on May 6 for the nation's first event of its kind in 70 years, with the guest list now starting to take shape.\n50\n comment\ns\n10\n share\ns\nWill Prince Andrew attend and take part in King Charles III coronation? \n13/04/23 09:41\nAfter it was revealed on Wednesday, 12 April that Prince Harry will attend the coronation of King Charles III, questions have risen over the potential attendance of Prince Andrew.\n5\n comment\ns\n42\n share\ns\n'He is not plugged into the same reality as the rest of us': Prince Andrew's overconfidence led him to agree to notorious Newsnight interview, bombshell new documentary claims\n11/04/23 06:34\nThe Duke of York's BBC interview with Emily Maitlis led to the Queen stripping him of his military affiliations, royal patronages and use of his HRH title.\n635\n comment\ns\n3\n video\ns\n54\n share\ns\nBumping along nicely! Princess Eugenie shows off her blossoming baby bump in a £159 Whistles dress as she joins husband Jack Brooksbank and her sister Princess Beatrice at Easter Sunday service\n09/04/23 11:42\nPrincess Eugenie had her blossoming baby bump on full display as she arrived for the Royal Family's traditional Easter Sunday gathering in Windsor today.\n315\n comment\ns\n2\n video\ns\n68\n share\ns\nEMILY PRESCOTT: Rolling Stone Ronnie Wood wants it painted pink at his new Maida Vale pad... with colourful walls inspired by his twin six-year-old daughters\n08/04/23 11:44\nEMILY PRESCOTT: Ronnie Wood (pictured), 75, and wife Sally - who have been working on their home - have opted for colourful interiors inspired by twin daughters Gracie and Alice, six.\n34\n comment\ns\n11\n share\ns\nAs the Queen's life gently ebbed away, Charles foraged for mushrooms at Birkhall. He drew solace and strength from the trees and the murmur of the River Muick\n08/04/23 09:00\nKing Charles (pictured in Windsor Great Park) has become accustomed to being mocked for talking to plants or otherwise communing with nature. However, such carping doesn't matter to him.\n660\n comment\ns\n37\n share\ns\nPrince Andrew is joined by Sophie for a ride in Windsor after bombshell Royal book revealed how Meghan turned down Queen's attempts to pair up the two Duchesses\n08/04/23 01:18\nPrince Andrew was photographed on horseback riding around Windsor Castle today, while his sister-in-law Sophie was seen driving one of the late Prince Philip's carriages.\n1\n comment\n1\n video\n27\n share\ns\nLady Victoria Hervey cuts an edgy figure in a bedazzled leather jacket and racy red trousers as she enjoys a girls' night out\n08/04/23 12:22\nThe socialite, 46,grabbed  a bite to eat at the London high-end establishment Langan's Brassiere. She dazzled in a  black leather diamante jacket and red leather trousers.\n30\n comment\ns\n1\n video\n14\n share\ns\nKing Charles' coronation balcony line-up won't include Harry, Meghan or Prince Andrew and will feature 'working royals' only as he unveils his vision of 'slimmed down' monarchy with 'little room for sentiment'\n06/04/23 06:42\nHis Majesty is said to want to show the world how he is slimming down Britain's monarchy - and will reward his closest and most loyal family members including William, Kate and their three children.\n823\n comment\ns\n278\n share\ns\nSarah Ferguson reveals she went to a 'dog whisperer' to learn about how the late Queen's corgis were grieving the monarch - and shares her grandchildren's sweet nickname for her\n05/04/23 02:40\nSpeaking on Loose Women in a candid interview today, the Duchess of York, 63, also revealed the nickname which her daughters Princess Beatrice and Eugenie's children call her.\n595\n comment\ns\n1\n video\n22\n share\ns\nSarah Ferguson reveals the 'gentle' corgis she adopted from late Queen are now 'really happy' and recovering from their grief during Radio 2 chat with Rylan Clark\n02/04/23 09:05\nSarah Ferguson says the two corgis, Sandy and Muick, are getting on well following the death of the Queen last September, and appear to be recovering from their grief.\n247\n comment\ns\n36\n share\ns\nLook away, Andrew! It's Netflix's version of the prince's stroll with Jeffrey Epstein he'll always regret as British actor is unrecognisable in costume as the Duke of York\n01/04/23 09:02\nBags under the eyes - check. Drooping jowls - check. Paunchy middle-age spread - check. As our exclusive pictures show, Rufus Sewell has been doing his homework to play Prince Andrew.\n24\n comment\ns\n165\n share\ns\nSARAH VINE: Donald Trump's downfall to porn star Stormy Daniels would be biblical-style justice... I can't help rather loving her\n01/04/23 09:00\nSARAH VINE: Whatever reservations... if Stormy Daniels (pictured) ends up being the person who finally brings Donald Trump to book, all credit to her. She'll have done the world a favour.\n1224\n comment\ns\n23\n share\ns\nFergie's 'supportive unit': Duchess of York praises 'extraordinary' Beatrice and Eugenie and says her family stands for 'kindness' following allegations against Prince Andrew\n30/03/23 11:45\nSarah Ferguson, 63, appeared on This Morning to discuss her new novel, A Most Intriguing Lady, and spoke of how the York family pulled together to support Prince Andrew.\n2\n comment\ns\n1\n video\n80\n share\ns\nEDEN CONFIDENTIAL: Sarah Ferguson brands the late Prince Philip 'terrifying', claiming 'if you asked a silly comment, you were certainly told it was a silly comment' \n27/03/23 09:01\nRICHARD EDEN: Sarah, Duchess of York raised eyebrows with her recent claim that she became 'even closer' to the late Queen Elizabeth due to her support for 'poor Prince Andrew'.\n16\n comment\ns\n6\n share\ns\nPrince Andrew 'is in talks with US authors to write a tell-all autobiography' following Prince Harry's release of Spare\n25/03/23 10:29\nThe memoir is described by sources close to the Duke of York as Spare 2.0 after Prince Harry's controversial book, Spare, and is viewed by the Duke as a way to set the record straight after Epstein\n2361\n comment\ns\n364\n share\ns\n'King Charles is not a housing association for distant relatives': Harry and Meghan's Frogmore Cottage eviction is 'just the start' of slimmed-down monarchy and family will no longer use 'London pads', sources say \n24/03/23 04:57\nHis Majesty is said to view the eviction of Harry and Meghan from Frogmore Cottage as 'just the start' of his plans to slim down  the monarchy.\n1657\n comment\ns\n29\n share\ns\nA royally good night out! Sarah Ferguson sports a chic green dress as she leaves Mark's in Mayfair at 2am with Princess Beatrice and her husband Edo\n23/03/23 01:02\nThe ex-wife of Prince Andrew cut a stylish figure in a sophisticated tweed dress which featured black buttons. She was joined by her older daughter Beatrice and her husband Edo.\n590\n comment\ns\n1\n video\n66\n share\ns\nEXCLUSIVE: 'Prince Andrew just wanted out.' How the Duke of York went from stonewalling to reaching  reported $12million settlement with Virginia Roberts in less than a week to avoid deposition and trial, victim's lawyer reveals\n21/03/23 12:21\nFamed attorney David Boies has talked in depth for the first time about how the settlement between Prince Andrew and Virginia Roberts for her claims of sexual assault came about.\n40\n comment\ns\n29\n share\ns\nDisgraced Prince Andrew to 'dress up as a royal for a day' at ceremony with King Charles after Duke was stripped of his HRH status over Jeffrey Epstein scandal \n21/03/23 01:52\nPrince Andrew, 63, will wear his ermine robes today when he goes to the Royal Victorian Order's event, which celebrates loyalty and service to the Royal Family.\n174\n comment\ns\n14\n share\ns\nBeatrice's Meghan dilemma: She is fiercely loyal to the Crown and her parents but faces awkward choices after Fergie distanced herself - while sister Eugenie is BFFs with the Duchess \n18/03/23 01:11\nPrincess Beatrice, 34, is notoriously private and, unlike her younger sister, has never leant support to the Duke and Duchess of Sussex publicly - however there have been hints at a friendship over the years.\n363\n comment\ns\n1\n video\n63\n share\ns\nPrince Louis WILL be at Charles's coronation with George and Charlotte just days after turning five: Kate and William's trio get starring role in historic procession, leaked plans show - but there's NO seats for Harry, Meghan, Andrew or his girls\n17/03/23 10:26\nPrince George, Princess Charlotte and Prince Louis will star in the King's Coronation procession on May 6. They are expected to join their parents in a carriage behind Charles and Camilla.\n2444\n comment\ns\n1469\n share\ns\nEPHRAIM HARDCASTLE: Isabel Oakeshott betrayed Matt Hancock and now offers her writing skills to Prince Andrew \n17/03/23 12:43\nEPHRAHIM HARDCASTLE: After betraying Matt Hancock by leaking his private WhatsApps, Isabel Oakeshott now offers her skills to a disgraced royal.\n252\n comment\ns\n7\n share\ns\nSuited and booted! Sarah Ferguson cuts a stylish figure in a pinstripe blazer and trousers as she attends Marlowe premiere in London\n16/03/23 08:50\nSarah Ferguson, 63, put on a stylish display in a striped pantsuit as she was spotted attending the premiere of the movie Marlowe in central London tonight.\n3\n comment\ns\n1\n share\nIs Harry sabotaging the King's plans for a slimmed-down monarchy? Watch our unmissable royal talk show Palace Confidential for the latest news\n16/03/23 08:01\nRoyal experts discuss King Charles' plans for a slimmed-down monarchy. They ask the question 'Did the Sussexes force his hand into giving Prince Edward the Duke of Edinburgh title?'\n315\n comment\ns\n1\n video\n60\n share\ns\nA royally wild hen do! Fergie recalls how she and Princess Diana were ARRESTED for dressing up as police officers before her wedding to Andrew\n15/03/23 01:44\nThe Duchess of York, 63, divulged the antics on The Kelly Clarkson Show, explaining that her entourage had dressed up as police officers for a night out in London for her hen do.\n215\n comment\ns\n1\n video\n39\n share\ns\nCharity Wakefield prepares to transform into Princess Beatrice as she joins the star-studded cast of Netflix film Scoop - depicting THAT bombshell Prince Andrew interview\n14/03/23 11:46\nThe royal role is set to be played out on-screen by Charity Wakefield in Netflix's new film Scoop - which depicts the bombshell interview between journalist Emily Maitlis and Prince Andrew.\n1\n comment\n30\n share\ns\nLady in leather! Sarah Ferguson recycles funky £1,555 embellished Alice + Olivia jacket as she steps out at star-studded book launch in London\n14/03/23 09:39\nThe Duchess of York , 63, wore a white leather jacket and little black dress with a flowing skirt to attend the launch of Imogen Edwards-Jones' latest book 'Have You Got Anything Stronger?'\n34\n comment\ns\n12\n share\ns\nEPHRAIM HARDCASTLE: Prince Andrew is frustrated he can't pursue his business interests in the US, as the FBI are still keen to interview him \n14/03/23 12:29\nEPHRAIM HARDCASTLE: Prince Andrew's bewilderment at not yet receiving his share of his mother's £370m fortune is coupled with his frustration at not being able to pursue his US business interests.\n109\n comment\ns\n13\n share\ns\nBillie Piper gets into character for her latest role playing BBC producer Sam McAllister in Netflix film Scoop  - portraying the shocking Prince Andrew interview on Newsnight\n12/03/23 09:26\nThe British actress, 40, looked completely in the zone as she was pictured filming a scene playing Sam McAllister outside the BBC Broadcasting House in London.\n2\n comment\ns\n share\ns\nPrince Harry is 'on the horns of a dilemma' over whether to attend Coronation, according to a royal expert who says the Duke 'plummets in the opinion polls' every time he 'opens his mouth'\n12/03/23 10:31\nWith King Charles' Coronation fast approaching, some senior royals are under pressure over who should attend, with Prince Harry facing a dilemma' according to author Nigel Cawthorne.\n2392\n comment\ns\n2\n video\ns\n1195\n share\ns\nPrince Andrew is 'bewildered' and 'in despair' that the King has not shared the £650million inheritance from the Queen with his siblings after being the sole beneficiary of his mother's fortune\n11/03/23 09:54\nPrince Andrew has told friends he is 'bewildered' and 'in despair' over the King's failure so far to share their mother's fortune.\n3443\n comment\ns\n1\n video\n891\n share\ns\nScoop FIRST LOOK: Billie Piper smooches her co-star as she transforms into BBC producer Sam McAllister as work begins on Netflix film depicting THAT bombshell Prince Andrew interview\n11/03/23 04:50\nThe actress, 40, was snapped on set of new Netflix film Scoop this weekend as she began filming for the release - which will depict the 2019 BBC interview with Prince Andrew.\n3\n comment\ns\n30\n share\ns\nPrince Andrew 'wants to do another TV interview': Duke of York is considering tell-all chat with US broadcaster despite disastrous fall-out from his Emily Maitlis Newsnight grilling in 2019\n11/03/23 11:52\nA second tell-all TV chat with the Duke of York could be on the cards, with sources claiming that 'nothing is off the table' amid fears that he could soon lose his royal home.\n448\n comment\ns\n2\n video\ns\n1080\n share\ns\nKing Charles denies Prince Andrew's  attempt 'to get £32,000 Indian healer guru expensed on Privy Purse' - as reports suggest disgraced Duke of York is lining up ANOTHER television interview despite Newsnight fiasco \n11/03/23 01:07\nKing Charles (right) has reportedly given a fresh snub to his brother Prince Andrew (left) by refusing to pay for a £32,000 annual bill for an Indian healer guru with money from the Privy Purse.\n621\n comment\ns\n73\n share\ns\nThe Countess who never was! Royal fans decry 'outdated and sexist' rules that mean Lady Louise, 19, misses out on the Wessex title in favour of her brother, 15 \n10/03/23 03:45\nEdward's eldest child, Lady Louise, 19, may have taken on an increasingly public role in recent years - but she has missed out on the title of Countess of Wessex due to  primogeniture\n1098\n comment\ns\n243\n share\ns\nSarah Ferguson says she misses her 'friend' Queen Elizabeth and reveals they joked about fairies on lockdown walks - while Princess Eugenie says she's 'so proud of Mumma and Beabea' on International Women's Day\n08/03/23 05:36\nSarah Ferguson appeared on TV show The view in New York. She spoke about Queen Elizabeth II, her 'friend.' Her daughter Princess Eugenie praised on in Instagram for International Women's Day\n397\n comment\ns\n1\n video\n152\n share\ns\nPrince Andrew is left 'furious' after finding out the King might ban him from wearing lavish velvet Knight of the Garter robes at Charles's coronation\n08/03/23 02:17\nThe disgraced Duke of York could be banned from donning a set of velvet robes (pictured) adorned with intricate royal details that signify his position as a Knight of the Garter.\n2038\n comment\ns\n134\n share\ns\nMonochrome magic! Pregnant Princess Eugenie opts for classic houndstooth coat during a visit to the London Spinal Cord Injury Centre\n07/03/23 03:27\nPrincess Eugenie visited Horatio's Garden at London Spinal Cord Injury Centre. The 32-year-old showed off her blossoming baby bump in a hounsdtooth coat\n62\n comment\ns\n15\n share\ns\nFergie's swipe at Harry and Meghan? Duchess says 'forgiveness is key' when it comes to 'family unity' - and claims King Charles feels 'strongly' that Diana would be 'proud' of Archie and Lili \n07/03/23 12:40\nDuring a 60-mintue 'conversation' with Glamour editor Samantha Barry, the 63-year-old was asked about the Duke and Duchess of Sussex, who are currently living in their $14 million mansion.\n1100\n comment\ns\n2\n video\ns\n83\n share\ns\nThe truth is out there for Maitlis and Scully! Gillian Anderson crosses her arms as she bumps into Emily - who she's playing - in Netflix film about THAT interview with Prince Andrew\n07/03/23 09:28\nGillian Anderson, who plays Emily Maitlis in a forthcoming Netflix film about her infamous interview with Prince Andrew.\n1\n comment\n1\n video\n1\n share\nSarah Ferguson insists her ex-husband Prince Andrew is a 'GOOD man' as she speaks out to defend him again - while revealing she HASN'T received an invitation to King Charles' coronation\n07/03/23 01:36\nFergie, 63, sat down with Glamour editor Samantha Barry to discuss her book at an event in New York City on Monday evening.\n205\n comment\ns\n1\n video\n24\n share\ns\nEDEN CONFIDENTIAL: Princess Beatrice, 34, sports stylish bow in her hair - just like her mother in the 1980s - during meeting in London's Mayfair\n06/03/23 10:16\nRICHARD EDEN: When it comes to style, Princess Beatrice has things tied up. King Charles's niece, 34, was spotted wearing a bow in her hair as she went for a meeting in Mayfair.\n432\n comment\ns\n60\n share\ns\n'I'm in a position where I can support Andrew': Sarah Ferguson says she's 'proud' to 'contribute to York family life' - and insists move from Royal Lodge is 'a matter between the King and Duke'\n06/03/23 11:18\nSpeaking to Hello about the possibility of a move from the Royal Lodge in Windsor, Sarah Ferguson said she feels 'really pleased and proud' to be able to support Prince Andrew.\n311\n comment\ns\n38\n share\ns\nCharles 'will NEVER build real relationship with Archie and Lili unless Harry and Meghan get new royal home': Sussexes 'to get Andrew's Buckingham Palace apartment' after Frogmore eviction made it 'incredibly complicated for family to visit Britain again' \n05/03/23 02:10\nHarry and Meghan were allegedly given 'weeks' to pack up their British home at Frogmore Cottage after Harry's memoir Spare hit the shelves in January.\n3431\n comment\ns\n1\n video\n325\n share\ns\nRevealed: The winners and losers in the great Royal property merry-go-round - as it emerges Prince Andrew could pocket £1.5m windfall if he quits the Royal Lodge this year \n04/03/23 10:08\nPrince Andrew, pictured driving his hybrid Range Rover on The Long Walk in the Windsor estate yesterday, could receive a £1.5m rebate in cash he spent renovating his Windsor Lodge home.\n6\n comment\ns\n39\n share\ns\nEXCLUSIVE: King Charles will offer Prince Harry and Meghan a Buckingham Palace apartment when they visit UK in olive branch after kicking them out of Frogmore Cottage\n04/03/23 06:43\nMAIL ON SUNDAY EXCLUSIVE: King Charles could offer Prince Harry and Meghan Markle a suite in Buckingham Palace, previously occupied by Prince Andrew.\n2316\n comment\ns\n1\n video\n1567\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Sam Ryder at F1 is everything a celeb should be compared to Cara Delevingne': Twitter users blast model for snubbing Martin Brundle\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shay Mitchell is the picture of elegance in bell-shaped dress at world premiere of live-action Barbie film in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/russia-ukraine-conflict/index.html",
        "https://www.dailymail.co.uk/news/china/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/uk_weather/index.html",
        "https://www.dailymail.co.uk/news/mostread/index.html",
        "https://www.dailymail.co.uk/news/article-11784243/How-Queen-Prince-Philips-romance-began-teenage-crush-met.html",
        "https://www.dailymail.co.uk/news/article-11807171/Harry-Meghan-stunned-evicted-Frogmore-Cottage.html",
        "https://www.dailymail.co.uk/news/article-10472291/Graffiti-portrait-Prince-Andrew-wearing-Jim-Fixed-badge-appears-Oxford.html",
        "https://www.dailymail.co.uk/news/article-11426885/Princess-Royal-Prince-Edward-join-royals-like-Harry-Andrew-deputise-King-Charles.html",
        "https://www.dailymail.co.uk/news/article-10421115/PMs-daughter-spotted-Sydney-Justin-Hemmes-sighting-seen-Epstein-flat.html",
        "https://www.dailymail.co.uk/news/article-10530247/Jeffrey-Epsteins-friend-Jean-Luc-Brunel-prison-suicide.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/princess-beatrice/index.html",
        "https://www.dailymail.co.uk/news/princess-eugenie/index.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}