{
    "url": "https://www.dailymail.co.uk/news/uk_weather/index.html",
    "title": "UK Weather News, Forecasts and Weather Warnings | Daily Mail Online",
    "hash": "ffccdc381c96455bc7d24f505b5893b9",
    "text": "UK Weather News, Forecasts and Weather Warnings | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking News\n\n\n\n\n\n\n\n                    \n                    Australia\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Video\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Russia-Ukraine\n                    \n                \n\n\n\n\n\n\n\n                    \n                    China\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debate\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    King Charles III\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Weather\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Most read\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nUK Weather\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending UK Weather News\nTemperatures soar ahead of weekend 30C weather warning\nTravel chaos for thousands due to 'extraordinary' weather\nWimbledon fans warned to allow extra time after 10-HOUR queue\nMoment water pours from Waitrose ceiling before it collapses\nBrits are battered by rain but Met Office predicts heatwave in July\nUK weather this week: Met Office predicts hottest day of the year\nStorm Noa batters UK with 96mph winds\nHolidaymakers' fury as easyJet leaves them stranded for DAYS\n\n\n\n\n\n\nUK Weather Forecast News, Met Office Updates and Weather Warnings\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nRed alert! Sunworshippers slap on the Factor 50 and enjoy some rays as temperatures climb after 30C weather warning - but thunderstorms are also on the way\n07/07/23 09:09\nThe Dorset holiday hotspots of Weymouth and Lyme Regis were both packed with sunseekers this afternoon as a plume of warm air drifting in from the continent produced perfect beach weather. It was a less happy sight at Dover, where drivers are facing up to a two-hour wait for checks by French border officials - creating huge queues at the Channel port. The high temperatures are set to be short-lived, with temperatures dropping from the west on Saturday before heavy rain on Sunday.\n...read\n271\n comment\ns\n73\n share\ns\n Wimbledon fans in early morning lines are warned to allow extra time after 10-HOUR waits sparked by airport-style security (and they may have to battle heavy rain too) \n04/07/23 05:55\nOrganisers said the extra security measures, which included a '100% bag search' and 'selective body search' at all gates, had been put in place over concerns about Just Stop Oil protests.\n98\n comment\ns\n1\n video\n9\n share\ns\nMet Office says this month is on track to be the warmest June on record after temperatures soared above average to 30C\n27/06/23 05:31\nProvisional figures suggest the average temperature for the month is already set to beat the previous record of 14.9C, reached in both June 1940 and June 1976.\n230\n comment\ns\n19\n share\ns\nFrom sizzle to drizzle: Brits in the North are battered by rain - but Met Office predicts 14-day heatwave in July with temperatures set to soar to up to 40C\n27/06/23 08:06\nThe Met Office has forecast temperatures in the high teens and low 20s for much of England and Scotland over the next few days. Rainy weather will persist throughout the week and weekend.\n81\n comment\ns\n47\n share\ns\nBritain bakes: Beaches, parks and local beauty spots are packed with sunbathers soaking up the rays as temperatures hit scorching 29C - with plenty more on the way tomorrow \n14/06/23 08:05\nBritain's beaches, parks and beauty spots are teeming with sunbathers this afternoon as the country bakes in scorching temperatures reaching 29C (84.2F).\n626\n comment\ns\n1\n video\n193\n share\ns\nThunderstruck! Scotland and Northern Ireland set for more lightning today after storms battered UK with fans drenched at Man City victory parade, flash flooding and ceiling of Waitrose supermarket collapsing\n13/06/23 12:51\nThe UK is set to avoid any further bad weather this week after Monday's flood hell and will return to dry and sunny weather, the Met Office has confirmed. \n62\n comment\ns\n3\n video\ns\n share\ns\nHolidaymakers' fury as easyJet leaves them stranded for DAYS: Airline axes flights across Europe leaving families in airports 'with no food or hotel' - and there are MORE cancellations tonight (despite BA and other carriers carrying on through storms) \n12/06/23 07:11\nEXCLUSIVE: Victims of the travel chaos that has ensued over the last 48 hours will be denied compensation as the airline said 'extraordinary', weather was to blame.\n95\n comment\ns\n1\n video\n11\n share\ns\nMoment water pours from Waitrose ceiling before it collapses in front of shocked shoppers as Britain is battered by torrential rain, hail and thunder with roads left underwater and homes left without power \n12/06/23 02:51\nDramatic footage shows water pouring through the Buckingham store when suddenly the ceiling caves in, causing the shop's lights to swing down on its wire.\n1698\n comment\ns\n1\n video\n290\n share\ns\nPollen levels to soar to 'very high': Map reveals hay fever will be rife in parts of the UK in the coming days as charity warns those with lung conditions are at risk of 'life-threatening reactions'\n12/06/23 09:51\nThe UK's official forecasters issued red warnings signaling pollen counts are set to rise throughout the week, with new maps showing the places that will be hit.\n55\n comment\ns\n94\n share\ns\nFury as easyJet ruins holidays for thousands of Brits...and blames weather: 15,000 passengers stranded at airports claim airline has 'no staff' as it axes more than 100 of flights blaming 'extraordinary weather' - but other airlines carry on through storms\n12/06/23 09:37\nThe airline axed 54 flights scheduled to take off and land at Gatwick airport on Sunday, while a further 55 were grounded today, causing misery 15,000 passengers.\n2104\n comment\ns\n142\n share\ns\nMap reveals which UK regions will swelter most during heatwave: Hot and humid conditions to continue as mercury soars to 28C today - before thunderstorms and rain lash Britain \n12/06/23 06:32\nBritons hoping for respite from the stifling heat will be disappointed today as the mercury is tipped to soar to 28C - but relief might come for some this afternoon with thunderstorms forecast.\n742\n comment\ns\n1\n video\n55\n share\ns\nBritain gets ready for 'hottest day of 2023 so far': Temperatures set to soar to sizzling 27C as sun-seekers brace for 'Iberian plume' blast \n05/06/23 11:57\nThe UK weather is expected to reach scorching temperatures this week and could see the hottest day of 2023.\n714\n comment\ns\n1\n video\n147\n share\ns\nFamilies pack out beaches as Britain basks in the hottest day of the year so far with temperatures soaring to nearly 25C - and the half term sunshine is here to stay\n30/05/23 05:33\nTemperatures in the seaside town of Porthmadog, north Wales, reached highs of 24.8C - making it the hottest day of the year so far, according to the Met Office\n335\n comment\ns\n2\n share\ns\nBritain could bask in the hottest day of the year today as temperatures get set to soar to 25C - making it hotter than Lanzarote and Barcelona \n30/05/23 05:53\nThe Met Office says the settled dry and sunny spell is expected to last for at least the next ten days. Temperatures will remain 'generally above average' but not meet 'heatwave criteria'.\n101\n comment\ns\n48\n share\ns\nThat's close! Sun-seeker stands on cliff edge to take a selfie while holding his child - as Britons pack out beaches and parks to enjoy 68F temperatures on Bank Holiday Monday \n29/05/23 06:04\nParks and beaches were packed out with thousands of people as temperatures climbed to 20C (68F) kicking off a week of weather that could see the UK hotter than Ibiza.\n43\n comment\ns\n3\n video\ns\n1\n share\nWhat happened to Spring? Huge downpours leave homes and businesses swimming in ankle-deep water with 35 flood alerts in place and torrential rain, thunder lightning and hailstorms expected tonight\n10/05/23 02:11\nSome Britons refused to let their spirits be dampened, as they were seen enjoying a pint at a pub in West Camel, Somerset, last night while standing in shin-deep floodwater.\n446\n comment\ns\n3\n video\ns\n40\n share\ns\nStorms to strike Britain today: Thunder, heavy rain and HAIL will batter the country - as flash flood map shows areas at risk as major incident is declared, homes are evacuated and cars are submerged by deluges\n10/05/23 07:20\nDozens of areas across southern England were on flood watch today after up to half of the average monthly rainfall for May came down in just a few hours.\n420\n comment\ns\n2\n video\ns\n72\n share\ns\nHailstorms and flash flooding batter southern England with schools forced to close and travel hit \n09/05/23 09:20\nFlash flooding has been reported in southwest England as hailstorms batter the region with a deluge of rain and thunder.\n265\n comment\ns\n1\n video\n51\n share\ns\nThunderstorms, lightning and downpours batter the country while Devon is hit by hailstorm as Met Office issues a yellow weather warning for rain and flooding\n09/05/23 06:15\nThe Met office issued a yellow weather warning, which will stay in place until 10pm this evening and spans much of southern England, East Anglia and parts of the Midlands.\n140\n comment\ns\n6\n share\ns\nAnd now the clean-up begins! Abandoned tents and camping chairs on the Mall are cleared by rubbish collectors as London returns to normal after the Coronation\n07/05/23 07:17\nToday crews are picking up rubbish and camping gear discarded by the royalists as the capital starts to return to normal following yesterday's historic ceremony.\n236\n comment\ns\n1\n video\n30\n share\ns\nIt's finally going to get warm! Met Office says May bank holiday weekend will see temperatures rise as high as 19C... and predicts sunshine for King Charles' coronation too\n27/04/23 06:33\nBritons have been warned to brace for another bitter and rainy day today after parts of the country saw sub-zero temperatures overnight - before the mercury levels begin to climb tomorrow.\n257\n comment\ns\n1\n video\n1290\n share\ns\nBritons wake up to frost after temperatures plunged to -6C overnight - as Met Office warns wintry showers and rain will batter the UK before mercury rises to 15C over first May bank holiday weekend\n25/04/23 10:22\nThe Met Office warned that wintry showers and rain will batter the UK tonight before the weather improves over the early May bank holiday weekend, with mercury expected to rise to 15C.\n56\n comment\ns\n15\n share\ns\nWhere has Spring gone? Up to an inch of rain is set to fall across UK with temperatures dropping to the single digits as Britain braces for cold snap this week\n23/04/23 10:48\nStrong Arctic winds are pushing a heavy band of rain towards the south east of England, the Met Office has warned. Some areas can expect to receive up to 20mm of rain by tomorrow.\n122\n comment\ns\n1\n video\n33\n share\ns\nAfter Storm Noa - comes hail and thunder: Met Office warns of rain and chilly temperatures today after 96mph gales battered Britain\n13/04/23 06:07\nParts of the north may be hit with some hail and thunder, while the Met Office predicts the south will face more isolated showers. Winds will also be lighter today than they were yesterday.\n comment\ns\n share\ns\nAfter the storm comes the sun: Met Office predicts sunny spells and some 'scattered showers' after Storm Noa blitzed UK with 96mph winds \n13/04/23 12:52\nBritain will see temperatures in double figures and severely reduced winds on Thursday, although it will remain blustery at the coast and during rain spells.\n9\n comment\ns\n7\n share\ns\nStorm Noa batters UK with 96mph winds: Flying scaffolding seriously injures a woman, pilots struggle to land at Heathrow and waves smash the coast as forecasters warn Brits severe winds set to continue\n12/04/23 05:31\nThe chaos and disruption caused by Storm Noa are likely to continue as the Met Office warned that the severe winds are set to continue.\n289\n comment\ns\n57\n share\ns\nScaffolding blows off a roof and 'seriously injures' woman as planes battle choppy conditions at Heathrow and snow blankets parts of Britain amid Storm Noa's 70mph winds\n12/04/23 12:04\nA woman has been seriously injured by scaffolding as Storm Noa sweeps into the UK. The Met Office has warned that  Britain could see 70mph gusts causing disruption to travel.\n177\n comment\ns\n4\n video\ns\n58\n share\ns\nBrace for Storm Noa: Wintry weather and 70mph gusts will batter Britain today as Met Office warns of power cuts and disruption to road users - and forecasters extend yellow wind warning\n12/04/23 06:12\nThe weather system is predicted to grow stronger over the course of the day with coastal areas in south-west England, particularly Devon and Cornwall, likely to be worst affected.\n104\n comment\ns\n122\n share\ns\nWhat a difference a day makes! Parks and seafronts are empty on damp and dreary Bank Holiday Monday after families packed out beaches on Easter Sunday\n10/04/23 01:49\nBeaches and other outdoor beauty spots were popular destinations yesterday as the sun beat down and temperatures edged towards 17C. But the balmy weather has since been swept away.\n84\n comment\ns\n15\n share\ns\nBank Holiday washout: Easter Monday brings rain, hail, thunder and even SNOW as Met Office issues weather warnings for 60mph gale force winds from tomorrow\n10/04/23 06:06\nIt's a wet and chilly start to the Easter Monday bank holiday. Damaging 60mph winds will be arriving from the Atlantic tomorrow. Accompanying them will be up to 2in of rain, forecasters have warned.\n244\n comment\ns\n16\n share\ns\nBritain's greenhouse gas emissions FELL by 2.2% last year thanks to warmer weather, figures show \n30/03/23 05:52\nThe Office for National Statistics explained that the drop was driven by two factors: homes using less fuel for heating due to higher energy prices and warmer weather, so less heat was required.\n93\n comment\ns\n2\n video\ns\n4\n share\ns\nMet Office issues yellow weather warning for wind as Britain to be battered by gales of up to 70mph, causing travel chaos\n29/03/23 07:28\nBritons are set to be hit by up to 70mph gales as the Met Office this evening issued a yellow weather warning for strong winds which could cause travel chaos on the South of England and Wales.\n311\n comment\ns\n1\n video\n62\n share\ns\nAisleyne Horgan Wallace puts on an eye-popping display in a bejewelled white bikini as she hits the beach in Mexico\n27/03/23 10:24\nThe former Big Brother housemate, 44, put on an eye-popping display in a white bikini on the beach in Mexico this weekend. \n167\n comment\ns\n1\n video\n7\n share\ns\nGet ready for brutal -12C cold snap: Met Office extends snow and ice warnings for swathes of Britain, with millions told to brace for even more travel chaos TODAY\n14/03/23 12:39\nThe Met Office has issued yellow weather warnings for snow and ice across most of the country lasting until tomorrow morning. The warnings remain in place through Wednesday for Shetland.\n361\n comment\ns\n36\n share\ns\nWhich schools are closed today because of snow? Full list of closures as blizzards hit England and Wales\n10/03/23 07:50\nThe wintry UK weather has resulted in some schools shutting their doors with children set to work remotely instead. Check here if your child's school is closed today.\n305\n comment\ns\n125\n share\ns\nWhich schools are shut today due to the snow? Full list of closures as extreme weather hits England and Wales \n09/03/23 07:14\nSchools are shutting across the UK as an Arctic blast batters Britain, with more snow and ice on the way today. Many children are set to work remotely as the cold snap continues.\n296\n comment\ns\n229\n share\ns\nMet Office issues two-day heavy snow warning: Map shows where blizzards will strike after snowfall brought Britain to a halt, with flights and trains cancelled and chaos on the roads amid brutal -15C Arctic blast \n08/03/23 02:46\nForecasters issued an amber weather warning for snow, in place from 3pm tomorrow until midday Friday, which could batter an area stretching from Stoke-on-Trent to Durham.\n445\n comment\ns\n4\n video\ns\n6\n share\ns\nAre schools closed today because of the snow? Full list as blizzards hit England and Wales \n08/03/23 07:42\nThe treacherous winter conditions mean some schools have decided to shut their doors for the day with children set to work remotely as the cold snap continued to batter Britain.\n446\n comment\ns\n729\n share\ns\nUK snow RECAP: Latest news as blizzards blast Britain sparking fears of travel chaos and school closures as Arctic snap sweeps the country \n08/03/23 07:30\nMore sleet and snow is expected across England and Wales today while scattered snow and hail showers will impact Scotland as the Arctic blast intensifies.\n372\n comment\ns\n282\n share\ns\nSouthern Britain is blanketed by snow with commuters warned to brace for a rush-hour from hell after what could be the coldest night of the year \n07/03/23 03:48\nSnow is falling over a large area of southern Britain this morning, with commuters warned to brace for a rush-hour from hell.\n823\n comment\ns\n1\n video\n431\n share\ns\nUK snow forecast - will it fall in your area? Met Office extends yellow warning for South West as maps reveal areas set to be blanketed by wintry showers from today as Arctic blast hits UK with warnings of blizzards, -15C temperatures and travel chaos \n07/03/23 06:58\nIcy weather is expected in central and southern areas of England and Wales today and tomorrow after snowfall swept in from Scotland overnight. A yellow weather warning has been issued.\n1177\n comment\ns\n488\n share\ns\nSnow sweeps into northern England from Scotland as maps reveal more areas set to be blanketed - and it could be even chillier tonight with temperatures expected to plummet to -15C in some areas amid fears cold snap could last a fortnight\n06/03/23 07:41\nSnow has blanketed parts of England and northern Scotland this morning on what could be the coldest night of the year after the Met Office issued weather warnings for snow and ice across the UK.\n1000\n comment\ns\n3\n video\ns\n63\n share\ns\nSnow showers and ice to blast Britain all week: Met Office issues five-day yellow warning with temperatures set to plunge to -10C - as snow hits London and the South East tonight\n06/03/23 12:12\nSnow and ice will blanket the country for the next five days as cold Arctic air sweeps in from the north. Yellow weather warnings will be in place in northern England, Northern Ireland and Scotland until Friday.\n395\n comment\ns\n2\n video\ns\n391\n share\ns\nMet Office issues severe four-day cold weather alert as snow and ice blast Britain with up to 4in set to fall today - before temperatures plunge to -10C tomorrow \n06/03/23 07:06\nThe Met Office has issued a yellow weather warning for snow and ice in parts of Scotland and northern England as temperatures are set to plummet to -2C. Roads and railways are expected to be icy.\n448\n comment\ns\n2\n video\ns\n214\n share\ns\nBritain warned to expect snow TODAY: Met Office issues yellow weather warning with four inches set to fall in some areas as freezing Arctic air brings temperatures as low as -8C in Scotland\n06/03/23 12:35\nThe yellow weather warning, which started at 6pm on Sunday, extends to just before midnight on Tuesday and covers the northern part of Scotland, including Aberdeen and Inverness.\n195\n comment\ns\n1\n video\n55\n share\ns\nNorthern Lights illuminate skies across UK: Stargazers as far south as Kent and Cornwall catch glimpse of stunning aurora in rare phenomenon - with dazzling display likely visible again tonight\n27/02/23 10:48\nThe Met Office tweeted a series of pictures taken by members of the public that captured the light phenomenon in Shropshire, Cambridgeshire, Scotland and north Wales.\n23\n comment\ns\n1\n video\n1017\n share\ns\nTemperatures plummet below freezing as Met Office warns snow could hit Britain in March \n27/02/23 08:19\nThe Met Office warned of a possibility of snow and wind combining to cause disruption across the UK next month.\n845\n comment\ns\n2\n video\ns\n102\n share\ns\nWatch the moment plane tries and FAILS to make landing at Manchester airport as Storm Otto gales cause plane, rail and road chaos \n17/02/23 03:08\nThe Brussels Airlines plane was approaching Manchester runway shortly after 10am this morning when it got caught in a gust of wind and was forced to pull up moments before hitting the tarmac.\n77\n comment\ns\n4\n video\ns\n13\n share\ns\nStorm Otto batters Britain today: Man is rushed to hospital after he is crushed by falling tree as '100MPH' gales spark airport, rail and road chaos, tear roofs off schools and leave thousands of homes across the country without power\n17/02/23 07:17\nStorm Otto is battering the UK today as roads and schools are closed, rail and airports see disruption and thousands are left without power. In Sheffield, a man has been taken to hospital after a tree fell.\n621\n comment\ns\n297\n share\ns\nAre we due another 'Beast from the East'? Met Office warns of event which can spark harsh wintry conditions as yellow weather freezing fog alert covers south of England and flights are cancelled amid -3C temperatures\n08/02/23 09:24\nMuch of southern England has been placed under a yellow weather warning today due to widespread freezing fog. Temperatures are expected to reach about -3°C. The north will be 'very windy' today.\n575\n comment\ns\n25\n share\ns\nIce box Britain: Sub-zero blast sends temperatures plunging to bone-chilling -3C as nation is hit by widespread frost and freezing fog in brutally cold start to the week \n06/02/23 09:10\nThe cold snap will hit England between this morning and 6pm tomorrow. Temperatures will hit bone-chilling lows at night, but are not expected to fall below mid-single figures in the day.\n142\n comment\ns\n1\n video\n13\n share\ns\nWhy the Thames Barrier is so VITAL to this day: How deadly mix of high tides and a violent storm led to the Great North Sea flood 70 years ago today... killing 326 people and leaving vast swathes of Essex and Norfolk under water\n31/01/23 12:43\nThe Great North Sea flood prompted an overhaul of the nation's flood defences. Above: Residents in King's Lynn, Norfolk are seen in the aftermath of the deluge.\n70\n comment\ns\n32\n share\ns\nWFH workers rush back to the office to stay warm and cut down on energy costs as temperatures plunge to -8C and 'freezing fog' affects visibility this morning - with meteorologists warning another Beast from the East will blast into UK next month\n23/01/23 01:14\nAlthough professionals are increasingly returning to the office due to the cold, an incoming severe blast of weather could halt transport and make it harder to commute in order to save on bills.\n426\n comment\ns\n2\n video\ns\n77\n share\ns\nIs it cold enough to get the DWP cold weather payment? Postcode checker reveals if you are eligible for up to £25 payment - as snow sweeps the nation and temperatures drop to -9C\n17/01/23 03:33\nThousands could receive a new set of cold weather payments after some temperatures fell below -9C today. The payment was triggered in parts of the North West, South West and East Midlands.\n73\n comment\ns\n1\n video\n18\n share\ns\nHeavy snow warning as cold weather alert is issued across England with temperatures set to plunge to minus 4C next week as flooding continues \n14/01/23 09:34\nA cold weather alert has been issued from 6pm on Sunday until 9am on Thursday across large swathes of England including the North, the Midlands and central and eastern areas.\n512\n comment\ns\n4\n video\ns\n327\n share\ns\nKeep those hatches battened down! After floods and gales overnight - Brits are told to brace for the return of SNOW sweeping in across large areas of the country next week as temperatures plunge \n12/01/23 07:36\nAnother round of wet and windy weather is likely to carry on throughout the weekend and into next week. As temperatures trend downwards, expect to see wintry hazards such as snow and ice.\n587\n comment\ns\n2\n video\ns\n20\n share\ns\nEvri little help: Delivery firm should be investigated over 40,000 complaints of poor customer service, Labour MP Carolyn Harris tells Rishi Sunak\n11/01/23 08:32\nLabour MP Carolyn Harris (pictured) has questioned whether delivery firm Evri should be investigated over its 'poor customer service' after the parcel firm apologised for ongoing UK-wide delays.\n29\n comment\ns\n18\n share\ns\nMadness! Adult walks with child just feet from massive crashing seafront wave as Met Office warns more heavy wind and rain is on way for UK tomorrow \n11/01/23 05:33\nThe pair were photographed walking along the beachfront in Blackpool, Lancashire, today just feet away from a massive crashing wave, as strong winds and rain towered over the sea.\n140\n comment\ns\n3\n video\ns\n21\n share\ns\nThis'll burn off those Christmas calories! Festive revellers mark Boxing Day by diving into the sea at chilly beaches across Britain (and there's barely a wetsuit in sight) \n26/12/22 12:40\nBraving the barmy conditions, participants sporting Father Christmas hats and bikinis plunged into the chilly waters across England, Scotland and Wales.\n241\n comment\ns\n2\n video\ns\n40\n share\ns\nMet Office issues urgent snow and ice warning for today AND tomorrow: Swathes of country are hit by deadly driving conditions as weather experts confirm it WAS a White Christmas\n26/12/22 12:14\nA warning for snow and ice is in place across Scotland until 6pm tonight. An ice warning is also in effect across the West coast of Scotland down to Manchester until 10am tomorrow.\n556\n comment\ns\n3\n video\ns\n700\n share\ns\nArctic blast could bring a MONTH of blizzards and sub-zero temperatures in January after wet and windy Christmas that may even be WHITE in northwest Scotland as floods hit\n23/12/22 11:04\nFollowing today's floods, Britons will face a bitterly cold holiday as a 'major' blast brings wintry downpours, sheet ice and -11C gusts. Forecasters warn of bitter winter weather until mid-January.\n656\n comment\ns\n1\n video\n420\n share\ns\nBig Thaw Britain leaves up to 30,000 homes in Lancashire, Sussex and Kent facing at least 24 hours WITHOUT WATER after frozen pipes burst and flooded streets as warm air from Madeira caused 'extraordinary' temperature rise \n19/12/22 09:09\nThe drastic change to milder weather which has caused thousands of homes to be left with water could last until Friday, December, 23.\n243\n comment\ns\n2\n video\ns\n1\n share\nUp to 15,000 homes in Sussex and Kent are without water on 15C 'Burst Pipes Monday': Bottles are handed out to families after rapidly thawing snow and ice caused mains to fail - as FIVE INCHES of rain brings flood chaos \n19/12/22 11:33\nWater supply has been cut off to 15,000 homes and businesses across the south east after an Arctic blast turned into a 15C thaw, battering some parts of the UK with up to five inches of rain.\n286\n comment\ns\n2\n video\ns\n68\n share\ns\nBritain to be hit by FREEZING RAIN: Met Office issues new weather warnings for heavy downpours in south of England on Monday and Tuesday after one more day of ice across the country \n17/12/22 08:21\nThe Met Office has issued the yellow warnings of ice for much of Scotland, the North of England and Wales today as the UK is battered by freezing temperatures and blizzards this weekend,\n1562\n comment\ns\n2\n video\ns\n631\n share\ns\nMet Office issues NEW weather warning for today: Half of the country will be swathed in ice with blizzards and six inches of snow on the way on Sunday after Trafalgar Square fountains FREEZE \n16/12/22 06:46\nWeather warnings have been issued for most of Britain as blizzard conditions and accumulations of up to 6ins are possible on high ground.\n752\n comment\ns\n116\n share\ns\nSnow causes travel chaos with flights grounded and roads closed with weather warnings across the UK all weekend as temperatures struggle to climb above freezing \n16/12/22 10:21\nCommuters have been warned to expect train and flight delays and cancellations, while people working from home can also expect power outages.\n147\n comment\ns\n10\n share\ns\nBlizzards will batter Britain into NEXT WEEK, Met Office warns: Gales and heavy rain will cause CHAOS, leave rural communities stranded, homes without power... with 4in of snow set to fall in just two hours TODAY\n16/12/22 12:47\nBlizzards, gales and heavy rain will cause widespread chaos across the UK well into the weekend, the Met Office has warned - as up to four inches of snow could fall in just two hours today.\n492\n comment\ns\n1\n video\n14\n share\ns\nDON'T let your children play on frozen water, devastated relative of Solihull lake victim warns after family pay tribute to 'beautiful' brothers and their cousin who were killed after falling through icy lake \n15/12/22 09:18\nJack Johnson suffered a cardiac arrest and died when he rushed to the aid of Finlay Butler, eight, his brother Sam Butler, six and their cousin Thomas Stewart, 11 at Babbs Mill Park on Sunday.\n1\n comment\n3\n video\ns\n10\n share\ns\nTouching moment a Zimbabwean man sees snow for the first time in UK\n15/12/22 05:04\nNoel Bako, 27, from Gweru, was giddy and emotional after seeing snow for the first time after freezing temperatures . Noel moved to Malvern in June to be with his wife Jaima, 29.\n comment\ns\n share\ns\nSolihull frozen lake tragedy: Identities of all four boys revealed\n15/12/22 04:15\nThe identities of all four children who died after falling into an icy lake while playing in a park in Solihull have now emerged - and they include two brothers and their cousin.\n comment\ns\n share\ns\nSnow excited! Touching moment a Zimbabwean man, 27, sees snow for the first time after joining his wife in UK\n15/12/22 02:43\nNoel Bako, 27, from Gweru, was giddy and emotional after seeing snow for the first time after freezing temperatures . Noel moved to Malvern in June to be with his wife Jaima, 29.\n9\n comment\ns\n1\n video\n789\n share\ns\nFamily pay tribute to their 'beautiful boys' who died after going to feed the ducks on Solihull frozen lake as they are named as brothers, six and eight, and their 11-year-old cousin \n15/12/22 10:31\nFamilies have paid tribute to their 'beautiful boys' as the final three victims of Solihull frozen lake tragedy were named as brothers Finlay and Sam Butler and their cousin Thomas Stewart.\n339\n comment\ns\n14205\n share\ns\nBritain will hit MINUS 18C tonight as Met Office issues Sunday weather warning for ENTIRE UK as canals and lakes freeze and beaches turn white with no let-up ahead in Britain's big freeze \n15/12/22 07:55\nBritain will hit -18C tonight as the Met Office issues a Sunday weather warning for most of the country, with canals and lakes freezing and beaches turning white with no let-up in Britain's big freeze.\n2104\n comment\ns\n3\n video\ns\n2121\n share\ns\nMet Office warns Britain will be hit by MORE snow and ice NEXT WEEK as second blast of Arctic air whips the country... after 'Troll of Trondheim' saw temperatures plunge to -17C, spark travel chaos and condemn communities to BLACKOUTS\n14/12/22 08:28\nForecasters say that while the current big chill - which has seen temperatures plunge to -17C in some areas - will have run its course by the weekend, the cold could sweep back in in a matter of days.\n548\n comment\ns\n1\n video\n46\n share\ns\nTeens seen playing on frozen pond day after four boys fell through ice\n14/12/22 03:32\nNine children were photographed playing on the frozen Brinkburn Pond Nature Reserve in Darlington on Monday afternoon, prompting warning from a concerned community member.\n comment\ns\n share\ns\nChildren are pictured playing on frozen pond just one day after three youngsters died falling through ice as parents are warned: 'Just keep your kids safe' \n14/12/22 11:15\nNine children were photographed playing on the frozen Brinkburn Pond Nature Reserve in Darlington on Monday afternoon, prompting warning from a concerned community member.\n201\n comment\ns\n2\n video\ns\n24\n share\ns\nMan shares clever trick to stop ice forming on your car that won't cost a penny... plus five other ways to clear your windscreen\n13/12/22 10:18\nBricklayer Tristan Walton from Birmingham demonstrated his method in a TikTok captioned 'quick de-ice trick thank me later', which has racked up more than two million views.\n1323\n comment\ns\n3\n video\ns\n432\n share\ns\nUK snow RECAP: Commuters heading home brace for more travel chaos with ongoing train delays and 'hazardous' driving conditions, as pupils leave schools early and forecasters warn to expect coldest night of year for second day running\n12/12/22 10:05\nThis was MailOnline's liveblog on December 12, 2022 on the fallout of the Big Freeze, as temperatures hit -10C and roads iced over.\n201\n comment\ns\n9519\n share\ns\nMet Office warns FOUR INCHES of snow could blanket London as Troll of Trondheim sends temperatures plunging below zero... causing Gatwick runway to 'FREEZE' and trapping passengers onboard planes for 'HOURS'\n10/12/22 12:46\nSnow could hit London within 36 hours as temperatures plummet to -10C, the Met Office says. The UK will see seven days of arctic weather with wintry downpours and 'freezing fog'.\n658\n comment\ns\n1\n video\n415\n share\ns\nIt's freezing Friday! Hardy swimmers take the plunge in London's Hyde Park as Britain faces weekend of snow and ice after temperatures dipped to -9C overnight \n09/12/22 06:52\nSwimmers braved freezing temperatures to take a dip in Hyde Park's Serpentine today as Britain braces for more snow and ice, while temperatures dipped to as cold as -9C overnight\n764\n comment\ns\n2\n video\ns\n548\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Sam Ryder at F1 is everything a celeb should be compared to Cara Delevingne': Twitter users blast model for snubbing Martin Brundle\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Margot Robbie surprises by ditching pink to recreate 1960s gown at premiere alongside Dua Lipa - as critics laud 'bombastic and smart' movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ken's a real charmer! The sweet way Ryan Gosling honored his partner Eva Mendes at Barbie premiere after she opted out of his press tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shay Mitchell is the picture of elegance in bell-shaped dress at world premiere of live-action Barbie film in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robert Downey Jr. shares fun group snaps with his Oppenheimer co-stars in NYC - with an unexpected photobomb from John Krasinski\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Deal alert! Save on the number one bestselling Oral-B toothbrush shoppers say is 'perfect in every way': Now 50% off ahead of Amazon Prime Day\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Walking Dead: Dead City: Maggie Rhee fights army of undead unleashed in Madison Square Garden\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          On your marks! All the best early Amazon Prime Day deals under £50 to snap up NOW - shop Oral-B electric toothbrushes, Revlon's cult hair dryer brush and more \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/russia-ukraine-conflict/index.html",
        "https://www.dailymail.co.uk/news/china/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/uk_weather/index.html",
        "https://www.dailymail.co.uk/news/mostread/index.html",
        "https://www.dailymail.co.uk/news/article-12274395/Temperatures-soar-ahead-weekend-30C-weather-warning.html",
        "https://www.dailymail.co.uk/news/article-12185259/Chaos-thousands-holidaymakers-commuters-extraordinary-weather-conditions.html",
        "https://www.dailymail.co.uk/news/article-12261531/Wimbledon-fans-join-early-morning-queues-chaos-sparked-increased-security.html",
        "https://www.dailymail.co.uk/news/article-12186263/Met-Office-issue-amber-thunderstorm-warning-torrential-downpours-set-batter-Midlands.html",
        "https://www.dailymail.co.uk/news/article-12237223/From-sizzle-drizzle-Brits-battered-rain-Met-Office-predicts-heatwave-July.html",
        "https://www.dailymail.co.uk/news/article-12160415/Britain-gets-ready-hottest-day-2023-far-Temperatures-set-soar-sizzling-27C.html",
        "https://www.dailymail.co.uk/news/article-11965649/Storm-Noa-batters-UK-96mph-winds.html",
        "https://www.dailymail.co.uk/news/article-12186491/Holidaymakers-fury-easyJet-leaves-stranded-DAYS.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}