{
    "url": "https://www.dailymail.co.uk/news/tesla/index.html",
    "title": "Tesla - Latest news, breaking stories and comment | Daily Mail Online",
    "hash": "b41d38cdbbdca6df7a28397073ead5d3",
    "text": "Tesla - Latest news, breaking stories and comment | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking News\n\n\n\n\n\n\n\n                    \n                    Australia\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Video\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Russia-Ukraine\n                    \n                \n\n\n\n\n\n\n\n                    \n                    China\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debate\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    King Charles III\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Weather\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Most read\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nTesla\n\n\nLast updated: 21:40 BST, 9 July 2023\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending Tesla News\nElon Musk escalates war with Mark Zuckerberg ahead of their cage fight\nDoctor who drove family off cliff asks for mental health diversion\nWhy I'll be buying petrol car just before 2030 ban, says MATT RIDLEY\nElon Musk sues Wachtell law firm to recoup $90m fees in Twitter buyout\nElon Musk appears to troll Megan Fox with snarky tweet\nMusk signs pledges Tesla's commitment to China's 'socialist values'\nElon Musk's daughter Vivian is seen for first time since changing name\nElon Musk says Tesla staff face being fired unless they work in office\nRELATED TOPICS FOR Tesla\nSpaceX\nApple Martin\n\n\n\n\n\n\nTesla - Latest news, breaking stories and comment\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\nNext\nZuck is a cuck! Elon Musk escalates his war of words with Mark Zuckerberg over 'protecting brand speech' on his new Threads app ahead of their Las Vegas cage fight - after threatening to SUE him\n09/07/23 06:10\nReplying to screenshots of Zuckerberg, 39, laughing at burger chain Wendy's telling him to go into space to 'really make Musk mad' the Tesla CEO simply replied: 'Zuck is a cuck'. Musk, 52, and fellow tech billionaires Zuckerberg have seen tensions rise after they agreed to take each other on in a cage fight. In what became a viral back-and-forth, Musk tweeted on June 20 bragging that he was 'up for a cage match if he is', to which the Meta boss responded on Instagram 'send me the location'. Zuckerberg broke his decade-long Twitter silence by tweeting a Spider-Man meme to make the launch of Threads.\n...read\n293\n comment\ns\n2\n video\ns\n2536\n share\ns\nMan accused of driving family off cliff seeks mental health diversion\n09/07/23 02:00\nDharmesh Patel's lawyers say the man who plummeted his family off Devil's Slide in Pacifica while his wife and two kids were with him has major depressive disorder.\n comment\ns\n share\ns\nCalifornia doctor, 42, who 'tried to kill his family' by driving their Tesla off 250ft Devil's Slide cliff tries to DODGE attempted murder charges by saying he needs to join a mental health diversion program to deal with a major depressive disorder \n09/07/23 05:42\nDharmesh Patel's lawyers say the man who plummeted his family off Devil's Slide in Pacifica while his wife and two kids were with him has major depressive disorder.\n404\n comment\ns\n2\n video\ns\n214\n share\ns\nElon Musk sues elite law firm Wachtell as he tries to claw back $90 MILLION it got from Twitter for defeating his bid to walk away from the $44B takeover\n09/07/23 04:00\nElon Musk's X Corp. is suing law firm Wachtell, that Twitter hired last year after Musk tried to break their $44 billion merger agreement. The firm collected $90 million in fees.\n256\n comment\ns\n69\n share\ns\nThe rush to electric vehicles risks killing our car industry, shackling us to China and bumping up our taxes to reduce global emissions by just 0.044%. That's why I'll be buying a brand new petrol car just before the 2030 ban, says MATT RIDLEY\n07/07/23 11:50\nMATT RIDLEY: To wean ourselves off China over the next seven years would require 100 times as much battery capacity as we have now, which is neither affordable nor feasible\n3392\n comment\ns\n1\n video\n742\n share\ns\nAmazon pulls listings for 'steering wheel weights' that allow Tesla drivers to trick the vehicle into thinking their hands are on the wheel while on self-driving mode\n07/07/23 08:28\nThe Seattle-based firm was joined by Chinese e-commerce giant Alibaba in purging the products from their stores after they were linked to accidents.\n55\n comment\ns\n27\n share\ns\nElon Musk signs onto letter pledging Tesla's commitment to China's 'core socialist values' to continue operations in the country\n07/07/23 07:57\nElon Musk has signed a letter pledging Tesla's commitment to China's 'core socialist values' as he continues his electric vehicle operations in the country.\n372\n comment\ns\n1\n video\n95\n share\ns\nBroken electric vehicles need 'quarantining' under government guidelines, driving up the costs for mechanics and insurers\n06/07/23 11:10\nElectric car owners face soaring insurance and repair costs over fears the vehicles could explode (file photo of Tesla which caught fire on a road in the US in 2020) after minor collisions.\n503\n comment\ns\n504\n share\ns\nGoogle co-founder Sergey Brin's ex wife Nicole Shanahan denies sex with Elon Musk and says she was discussing her daughter's autism with him: Reveals she met new man at Burning Man and that they've had 'love ceremony'\n05/07/23 08:03\nGoogle co-founder Sergei Brin's ex wife Nicole Shanahan has denied having sex with Elon Musk - and says the two were in fact discussing her daughter's autism.\n9\n comment\ns\n7\n share\ns\nLandmark moment for electric cars in Australia as a Tesla outsells a Ford Ranger for the first time ever - but there's still one vehicle Aussies prefer\n05/07/23 02:17\nThe Tesla Model Y last month outsold the Ford Ranger for the first time ever, beating the ute that was Australia's bestseller in January, February and April. But one ute was still No.1 in Australia.\n20\n comment\ns\n63\n share\ns\nElon Musk admits he needs 'a LOT more training' after gruelling session with UFC legend Georges St Pierre as he prepares for mega-fight with tech billionaire Mark Zuckerberg\n04/07/23 11:13\nElon Musk underwent a gruelling training session on Monday evening with UFC legend Georges St Pierre ahead of his proposed mega-fight with Facebook founder Mark Zuckerberg\n84\n comment\ns\n2003\n share\ns\nSome good news for Elon! Tesla posts record surge in sales after federal tax cut on electric vehicles prompted buyers to splash out - as CEO Musk battles criticism over new Twitter curbs\n03/07/23 04:08\nTesla has announced record car deliveries in the second quarter of the year after US business was bolstered by federal tax credits for electric vehicles.\n48\n comment\ns\n31\n share\ns\n'Twitter is dead': Furious social media users blast Elon Musk's new curbs which restrict the number of tweets accounts can see each day (and now people are flocking to Jack Dorsey's rival site Bluesky in protest)\n03/07/23 11:02\nElon Musk claimed that the restrictions are a temporary measure that were introduced because 'we were getting data pillaged so much that it was degrading service for normal users'.\n470\n comment\ns\n36\n share\ns\nWife of NorCal sheriff charged with DUI following collision where her Tesla went into a home \n02/07/23 07:04\nThe wife of a Northern California sheriff has been charged with driving under the influence following a May crash where her Tesla struck a home and injured a person.\n comment\ns\n1\n video\n share\ns\nTesla sales explode in Australia - with the marque close to running out of stock and it taking a major sales crown from Toyota\n29/06/23 07:04\nTesla is celebrating one of its biggest quarter of sales to date as the marque clears almost all of its inventory and takes a crown from Toyota.\n39\n comment\ns\n11\n share\ns\nIt's on! Elon Musk shows off his throw-down technique in 'epic' sparring session with Lex Fridman who lauded his 'strength and power' as Twitter CEO gears up for $1BN Vegas cage fight with rival Mark Zuckerberg\n28/06/23 08:32\nTesla and Space X founder Musk, 51, demonstrated 'strength, power and skill' in fighting abilities, according to Fridman, 39, who holds a black belt in jiu-jitsu.\n180\n comment\ns\n1\n video\n718\n share\ns\nUte driver's entitled parking act angers many after they broke a little-known rule that comes with a $2,200 fine\n28/06/23 05:13\nElectric vehicle drivers are calling for greater enforcement of fines after normal cars have been parking in their charging spots.\n56\n comment\ns\n394\n share\ns\nTesla driver, in his 20s, arrested after 11 people including six teenagers were injured when they were hit by a car on the way home from a festival\n27/06/23 11:16\nThe smash occurred in Tideswell, in the Peak District, at 10.50pm on Saturday. A man in his 20s has been arrested on suspicion of drink-driving, dangerous driving and intent to supply drugs.\n comment\ns\n share\ns\nTerrifying moment Tesla nearly blows past a stop sign into oncoming traffic during a test of its self-driving system in California\n25/06/23 04:32\nShocking video shows the moment that a self-driving Tesla in Santa Barbara, California blew a stop sign and nearly slammed into another car on the road. \n81\n comment\ns\n1\n video\n66\n share\ns\nMother and 13-year-old daughter die in Tesla crash after their car hit a tree and burst into flames just minutes away from their California home: Cause of fatal accident remains a mystery\n24/06/23 05:50\nA California mother and her 13-year-old daughter were killed in a fiery crash when their Tesla hit a tree The cause of the accident remains a mystery.\n279\n comment\ns\n1\n video\n58\n share\ns\nMillion Dollar Babies: How long-running childish beef between Mark Zuckerberg and Elon Musk ended up with a bout in a caged fighting ring \n23/06/23 03:01\nMark Zuckerberg appears to have accepted Elon Musk's challenge to a cage fight after the pair's most recent online spat. Find out all the  stages of this petty feud since 2016 here.\n88\n comment\ns\n65\n share\ns\nZuck V Musk: It's ON! Tech titans joust online as Mark Zuckerberg tells Elon 'send me the location' after being challenged to a CAGE FIGHT in Vegas - and Andrew Tate offers to train them \n22/06/23 12:18\nThe former kickboxing champion, who was this week charged in Romania with rape, human trafficking, shared his grievances with Facebook's parent company on Twitter today.\n9\n comment\ns\n33\n share\ns\nZuck V Musk: It's ON! Tech titans joust online as Mark Zuckerberg tells Elon 'send me the location' after being challenged to a CAGE FIGHT in Vegas \n22/06/23 12:00\nZuckerberg, 39, posted on his Instagram stories 'Send me the location' sharing a screenshot of Musk's earlier tweet bragging: 'I'm up for a cage match if he is lol.'\n153\n comment\ns\n150\n share\ns\n'It's a car for Silicon Valley people': Ford CEO Jim Farley slams Elon Musk's Tesla Cybertruck and claims the F-150 Lightning is for 'real people who do real work'\n22/06/23 03:33\nJim Farley insists his company 'make trucks for real people who do real work' and said Elon Musk's vehicle is a 'different kind of truck.'\n84\n comment\ns\n1\n video\n15\n share\ns\nClash of the (tech) titans! Elon Musk challenges jiu-jitsu trained Mark Zuckerberg to a 'cage match' - as Meta boss says 'send me location'\n22/06/23 01:11\nThe challenge came after Musk commented on a Twitter post about Zuckerberg's reported in-development Twitter rival app, Threads.\n231\n comment\ns\n2\n video\ns\n40979\n share\ns\nI'm more than Elon Musk's sister: Tosca Musk reveals how 'everyone assumes my eldest brother pays for everything' and how she picked the perfect sperm donor to father her twins\n18/06/23 08:42\nTosca Musk, 48, on how she founded a Netflix-style streaming service for romantic movies, the challenge of finding a man brave enough to \ndate her - and picking the perfect sperm donor.\n253\n comment\ns\n6226\n share\ns\nSadiq Khan's green fund loses £3.2m of taxpayer cash after electric car firm Breathe that supplied Tesla motors to private-hire drivers collapsed into administration \n16/06/23 06:02\nThe company had £3.2m injected into it by the Mayor of London's Energy Efficiency Fund (MEEF). It supplied electric vehicles to a range of customers and allows them to buy their car after subscribing.\n135\n comment\ns\n128\n share\ns\nTesla driver is killed and nine others are injured after eight-car pile-up is triggered by the EV colliding with a concrete wall on the I-95 in Miami\n15/06/23 02:03\nA Tesla driver was killed and nine others were injured in an eight-car crash on I-95 in Miami early Thursday morning.\n83\n comment\ns\n58\n share\ns\nDid you see it? Tesla Cybertruck wrapped in camouflage spotted in California - signaling Elon Musk is getting ready to launch the long-awaited EV that starts at $39,000\n14/06/23 10:16\nAn eyewitness took to Twitter to report that the camouflaged Cybertruck came with a traditional round steering wheel, not the polarizing 'Yoke' design dividing Tesla fans\n64\n comment\ns\n1\n video\n48\n share\ns\nCalifornia doctor, 41, who 'tried to kill his family' by driving their Tesla off 250ft Devil's Slide cliff is BANNED from practicing medicine because he is 'an alarming danger to the public' - as he faces attempted murder charges\n14/06/23 08:16\nRadiologist Dharmesh Patel, 41, has been held in San Mateo jail since his arrest over the January 2 crash. The Medical Board of California successfully applied to ban him from medicine this week.\n2\n comment\ns\n2\n video\ns\n61\n share\ns\n'This is why ESG is the devil': Elon Musk slams S&P's woke scores for giving Marlboro a HIGHER investment rating than Tesla - despite cigarettes being responsible for eight MILLION deaths a year\n14/06/23 03:15\nElon Musk has hit out at S&P Global after it gave Tesla a lower Environmental Social Governance (ESG) score than Philip Morris International, the makers of Marlboro cigarettes.\n170\n comment\ns\n82\n share\ns\nElon Musk trolls Megan Fox as he tweets about hiring 'a VP of Witchcraft & Propaganda' after actress slammed conservative commentator who criticized how she raises her sons\n12/06/23 02:50\nThe tweet from the owner of Tesla and Twitter owner garnered a number of responses, including multiple mentions of Fox following her remarks.\n41\n comment\ns\n3\n video\ns\n716\n share\ns\nThe real Boss Baby: AI-generated image of a toddler Elon Musk donning fancy brown overalls makes waves on the internet - and even gets a comment from the billionaire\n07/06/23 04:04\nAn AI-generated image of a baby Elon Musk shows the toddler wearing a white button-up shirt and fancy brown overalls, along with having the billionaires signature haircut.\n27\n comment\ns\n441\n share\ns\nElon Musk's Tesla Model 3 is now more than $1,000 CHEAPER than a Toyota Camry in California \n06/06/23 08:59\nTesla's Model 3 now benefits from both the $7,500 federal tax credit and its $7,500 California  rebate equivalent, thanks to a canny battery swap starting this month\n92\n comment\ns\n314\n share\ns\nPicked on the wrong guy! Dramatic video shows Korean Marine vet fight off two men trying rob him when they followed him to his southern California home after he left church\n06/06/23 05:10\nVideo captured the moment that brazen thieves attempted to rush in and attack a military veteran only to have him fight back and chase them off down the street. \n1\n comment\n65\n share\ns\nThe disturbing Tesla privacy fail that all electric car buyers need to know about: 'A stalker's dream car'\n05/06/23 03:21\nSocial media users have called out the creepy feature which allows Tesla App users to see the car's in car system details and track the route the driver is on.\n5\n comment\ns\n1\n video\n41\n share\ns\n'I've actually got lots of space!' Woman reveals she moved into her TESLA - along with her TWO pets - so she can travel the world full-time while raking in money by renting out her home\n03/06/23 05:11\nCanadian content creator Stephanie has perfected a traveling lifestyle that sees her living in the car alongside her cat Finley and dog Snow. She has now given viewers a tour of her car.\n112\n comment\ns\n975\n share\ns\nMove over, Cybertruck! Futuristic, 27ft-long electric camper developed by ex-Tesla employees goes on pre-sale for $125,000 \n01/06/23 02:26\nA pair of former Tesla employees used their skills to create an all-electric camper that self-propels while being towed. Lightship L1 can sleep four to six people and starts at $125,000.\n94\n comment\ns\n2\n video\ns\n203\n share\ns\nElon Musk wins battle of the multi-billionaires….again: Tesla boss takes top spot with net wealth of $192B toppling French luxury goods tycoon Bernard Arnault's $187B after shares in firm dropped 2.7%\n01/06/23 09:36\nThe two multi-billionaires have been vying for the top spot for months. This week, Arnault's wealth decreased after a drop in LVMH's stock Wednesday.\n47\n comment\ns\n1\n video\n19\n share\ns\nAI chipmaker Nvidia becomes ninth company ever to reach $1TRILLION valuation - stock of California based firm has surged 175%, joining Apple, Meta and Microsoft in exclusive club\n30/05/23 08:54\nNvidia has become the first chipmaker company to hit a valuation of $1trillion - joining just nine other companies that have reached the milestone.\n75\n comment\ns\n24\n share\ns\nShocking moment biker and Tesla owner get into fist fight during road rage incident in the middle of Pasadena street \n29/05/23 02:46\nThis is the moment a fight broke out between a motorcyclist and a Tesla driver in the middle of a Pasadena street.\n151\n comment\ns\n1\n video\n12\n share\ns\nLetting off some steam? Billionaire Elon Musk is seen sporting some VERY odd dance moves at rave in Mexico \n26/05/23 03:39\nMusk, who is known to be a fan of EDM, was spotted at a music event in Cabo, Mexico, last month sporting some very odd dance moves as he partied with revelers.\n86\n comment\ns\n18\n share\ns\nElon Musk looks carefree as he touches down in Los Angeles with son X after disastrous Ron DeSantis Twitter presidential campaign launch \n25/05/23 11:40\nElon Musk was spotted getting of a plane with his son X a day after a disastrous launch on Twitter for Florida Governor Ron DeSantis' 2024 presidential campaign\n165\n comment\ns\n1\n video\n1\n share\nLeaked images give first look inside Tesla's long-awaited Cybertruck - and its VERY minimalistic interior and oblong steering wheel split Twitter. So, would you pay $100 to go on the waiting list?\n25/05/23 03:56\nTesla fans may have been given the first-ever look inside the long-awaited Cybertruck. Images surfaced online this week showing a dark gray interior and an improved steering wheel.\n142\n comment\ns\n1\n video\n42\n share\ns\nMoment YouTube megastar MrBeast is handcuffed and arrested by cops who pulled him over in his Tesla then threw him in a holding cell without food or water... but all is not what it seems\n25/05/23 12:17\nMrBeast, 25, was subject to a revenge plot that took place in North Carolina by fellow YouTube star Airrack over a prank from more than a year ago.\n42\n comment\ns\n36\n share\ns\nWhy this photo of an electric vehicle sparked a bitter war of words between two drivers and a furious debate about charging station etiquette\n21/05/23 01:10\nA dispute between two electric vehicle owners has called charger etiquette into question after a Tesla driver being outed for unplugging a Volvo from a public charger\n79\n comment\ns\n16\n share\ns\nElon Musk doubles down on criticism of George Soros despite being branded anti-Semitic, as he slams billionaire for funding politicians and DAs 'who are soft on violent crime' and 'caused great damage to many cities'\n18/05/23 11:13\nElon Musk on Thursday doubled down on his criticism of billionaire philanthropist George Soros, saying Soros 'has funded so many politicians & DAs who are soft even on violent crime.'\n427\n comment\ns\n199\n share\ns\nDriver for rideshare firm Revel sues Tesla over claims his work car suddenly accelerated at high speed with no brakes and only stopped after he deliberately crashed it into empty parking space \n18/05/23 10:58\nA New York City man is suing Tesla after he claims one of their electric vehicles crashed after it took off from a standstill 'suddenly and automatically' following a break failure.\n22\n comment\ns\n41\n share\ns\nBeetlejuice 2 FIRST LOOK: Lydia Deetz is back! Winona Ryder, 51, once again transforms into her iconic character... 35 years after the original film\n18/05/23 01:14\nThe actress, 51, once again sported Lydia Deetz' recognisable spiked black locks while filming scenes in Hitchin, Hertfordshire.\n71\n comment\ns\n10928\n share\ns\nRevealed: Freak injury Nick Kyrgios suffered when he sprang into action as man allegedly threatened his mum with a gun and stole his car is what really kept Aussie star out of the French Open\n18/05/23 07:00\nAussie tennis ace Nick Kyrgios has been ruled out of the French Open after injuring his foot when his mother was allegedly held at gunpoint before his luxury green Tesla was stolen earlier this month.\n comment\ns\n share\ns\nWife of 'depressed' California doctor who drove Tesla off cliff with her and their young children inside told cops he SAID he was going to do it moments before - and claims he 'tried to kill everyone'\n18/05/23 06:07\n'He drove off. He's depressed,' Neha Patel told a California Highway Patrol officer as she was flown away from the crash site, according to an arrest warrant affidavit unsealed on Tuesday.\n22\n comment\ns\n2\n video\ns\n33\n share\ns\nUS Virgin Islands WILL be allowed to subpoena Tesla and compel CEO Elon Musk to hand over documents in suit over JPMorgan's ties to Jeffrey Epstein\n17/05/23 10:58\nUS District Judge Jed S. Rakoff on Wednesday granted the prosecution's request to serve the subpoena through Tesla, after they said they were unable to locate the billionaire or his agent.\n comment\ns\n share\ns\nLaughing Elon Musk compares George Soros to Jewish supervillain Magneto again in bizarre interview where he pauses for a full 12 SECONDS and claims he is a 'pro-Semite' - as Israeli government blasts him for anti-Semitism\n17/05/23 06:31\nThe Israeli Government came out and attacked Musk over his 'anti-Semitic' tweet about billionaire George Soros, claiming Musk caused a flood of conspiracy theories to start trending.\n10\n comment\ns\n12\n share\ns\nElon Musk's productivity hack: Tesla billionaire only takes 2 or 3 days off a year, working 7 days a week and getting 6 hours of sleep a night\n17/05/23 04:34\nControversial Twitter owner Elon Musk has claimed he is so productive because he only takes two to three days off a year, works seven days a week and only sleeps for six hours a night.\n279\n comment\ns\n1\n share\nShocking moment boy racer's Range Rover flips as it crashes into Tesla dealership before landing on Tube tracks in horror 110mph smash that killed beauty therapist - as killer is jailed for 7½ years \n17/05/23 04:31\nCCTV footage shows the £180,000 Range Rover somersault through the air after hitting a kerb outside the garage on the A40 road in London in a horror smash at 110mph that left Yagmur Ozden dead.\n835\n comment\ns\n5\n video\ns\n50\n share\ns\nLori Vallow is indicted for conspiracy to murder her niece's husband\n17/05/23 10:21\nCult mom Lori Vallow has been indicted by a grand jury in Arizona for conspiracy to commit the murder of her nephew-in-law.\n comment\ns\n share\ns\nElon Musk condemns working from home as 'morally wrong': Tesla CEO says it's not just about productivity but the unfair notion that service workers still have to show up to get the job done\n17/05/23 10:20\nMusk, the second richest person in the world, has often criticized working from home that became a necessity for many during Covid-19 lockdowns. He recalled Twitter employees in November last year.\n1013\n comment\ns\n98\n share\ns\nLori Vallow is indicted by grand jury in Arizona for conspiracy to kill niece's husband as pair went through divorce: Now faces extradition from Idaho after being found guilty of murdering her two children \n16/05/23 09:00\nAuthorities have now indicted the cult murderer Vallow in connection with the attempted murder of Boudreaux - her nephew-in-law.\n38\n comment\ns\n1\n video\n6\n share\ns\nElon Musk says George Soros reminds him of Jewish supervillain Magneto and he 'hates humanity... wants to erode the very fabric of civilization' - three days after the billionaire sold all his Tesla stock\n16/05/23 06:05\nMarvel's official character description says the supervillain 'fights to help mutants replace humans as the world's dominant species'.\n26\n comment\ns\n57\n share\ns\nElon Musk bans Tesla staff from hiring new employees 'unless he personally approves them'\n16/05/23 02:23\nMusk reportedly told executives on Monday to send him a list of hiring requests on a weekly basis, while also cautioning them to 'think carefully' before submitting such requests.\n36\n comment\ns\n11\n share\ns\nTesla owners sue the Elon Musk-owned company claiming latest software update cut driving range 20% - forcing some to spend $15,000 on new batteries \n15/05/23 08:32\nAttorneys for the plaintiffs say that the class action applies to the company's Model S and Model X cars and that other Tesla owners appear to be effected as well.\n46\n comment\ns\n56\n share\ns\nFrom trance to France! Elon Musk reveals he slept in his car en route to meeting President Macron at the Elysee Palace less than 48 hours after watching Bosnian DJ in LA \n15/05/23 03:08\nElon Musk was seated opposite Emmanuel Macron in Paris today, where he quipped that he slept 'in the car' while travelling to France on Sunday after a night of partying in LA on Sunday.\n38\n comment\ns\n1\n video\n14\n share\ns\nI just bought an electric car and drove 2,500km around the east coast of Australia. Here's the truth about driving an EV Down Under, including how much it costs and the charging etiquette you need to know \n14/05/23 01:52\nWe made a doomsday decision to drive our new Tesla 2,500km from Sydney to Yass to Melbourne to Beechworth to Canberra and back to Sydney over Easter. It did not go as expected...\n208\n comment\ns\n22\n share\ns\nMusk's X factor: Twitter could soon be rebranded after Elon's favorite letter, that is also his nickname for his son, the name of a Tesla model and his rocket to get to Mars - as well as a mysterious website domain he owns\n12/05/23 09:34\nElon Musk has confirmed his plans to transform Twitter into 'X, the everything app' - continuing his love affair with the letter.\n42\n comment\ns\n1\n video\n18\n share\ns\nChina recalls 1.1 MILLION Teslas over brake flaws US regulators and Elon Musk ignored in 2021 - with the carmaker saying it was a lie made up by short sellers\n12/05/23 07:49\nRecall cites brake issue in imported Model S, Model X, and Model 3 cars, as well as in Chinese-made Model 3 and Model Y. Tesla called glitch 'completely false' in 2020\n31\n comment\ns\n1\n video\n265\n share\ns\nIs Twitter morphing into WhatsApp? MailOnline explores what Elon Musk's platform could soon look like, as he reveals plan to launch at least three copycat features\n10/05/23 06:32\nEven before he bought Twitter for $44 billion (£38 billion) last year, Elon Musk had long discussed his plans to create a mysterious 'everything app' or 'X' for users worldwide.\n17\n comment\ns\n15\n share\ns\nWheels on fire: Tesla bursts into flames on California highway car began to 'shake' \n10/05/23 06:10\nBishal Malla, of Elk Grove, was driving down Highway 99 near Cosumnes River Boulevard when he started to feel his electric vehicle begin to shake and found smoke billowing from it.\n116\n comment\ns\n1\n video\n72\n share\ns\nDid American inventor Nikola Tesla - who Musk named his car firm after and predicted the internet and cellphones 120-years ago - predict the rise of AI in magazine article dated 1900? \n10/05/23 05:01\nNikola Tesla may have predicted the rise of artificial intelligence in a recently-resurfaced magazine article from June 1900 in which he writes about machines with their 'own mind.'\n194\n comment\ns\n67\n share\ns\nEXCLUSIVE: That's a racy outfit! Elon Musk chats with brunette flaunting serious side boob while watching Miami Grand Prix\n08/05/23 05:25\nThe Tesla CEO could be seen in photos obtained exclusively by DailyMail.com chatting with an unknown brunette who was flaunting some serious side boob on Saturday.\n491\n comment\ns\n1529\n share\ns\nBattle of the F1 billionaires! Jeff Bezos hops on the McLaren pit wall, while Elon Musk takes a tour of rival Red Bull ahead of the Miami Grand Prix\n06/05/23 06:13\nThe Miami Grand Prix is guaranteed to attract the rich and famous but before the big race is even underway it has already captured the attention of two extremely wealthy famous faces.\n226\n comment\ns\n1200\n share\ns\nElectric car mastermind Elon Musk claims threat of climate change is 'overblown' in the short term - despite making a fortune in eco ventures\n05/05/23 06:48\nThe entrepreneur's fortune skyrocketed on the back of ecologically conscious ventures like Telsa and SolarCity. But his forward-thinking work has taken a backseat to Twitter.\n178\n comment\ns\n76\n share\ns\nLori Vallow's brother tried to kill their niece's estranged husband in drive-by shooting plot to claim his $200,000 life insurance payout, triple murder trial jury is told\n04/05/23 09:07\nBrandon Boudreaux was returning home from the gym when a bullet ripped through the driver's side door of his Tesla in Gilbert, Arizona, on October 2, 2019.\n17\n comment\ns\n1\n video\n share\ns\nNick Kyrgios breaks his silence on 'rough' few days after his mum 'was held at gunpoint by thief who stole his Tesla'\n04/05/23 07:44\nNick Kyrgios has broken his silence after his mother was allegedly held at gunpoint before his green Tesla was stolen.\n comment\ns\n30\n share\ns\nHow Chinese-made cars are gaining an ever greater foothold in Australia - claiming three of the top 10 bestseller spots as sales surge by 69 per cent in a year \n03/05/23 04:49\nChinese-made cars had three spots in Australia's top 10 bestsellers list in April. Tesla had two positions - equal to market leader Toyota, which is yet to offer a fully-electric car as driver tastes change.\n58\n comment\ns\n1\n share\nCourt hears what Nick Kyrgios's mum told police after she was left terrified by being allegedly held at gunpoint by car thief before tennis star helped cops track accused offender down\n03/05/23 01:38\nA court has heard evidence about what occurred when the tennis star's mother Norlaila was allegedly threatened with a gun by a man who stands accused of stealing Kyrgios's Tesla.\n comment\ns\n share\ns\nMasked man allegedly 'points a gun at Nick Kyrgios's elderly MUM and steals his Tesla - before the tennis star stopped thief with clever tech move'\n02/05/23 05:02\nThe court heard the Aussie  tennis star's elderly mum opened the door of her Canberra home only for an alleged masked thief to shove a gun in her face and demand the keys to Kyrgios's vehicle\n comment\ns\n295\n share\ns\nFather of 10 Elon Musk is criticized after internal documents show he cut parental leave at Twitter to just TWO WEEKS\n30/04/23 06:23\nInternal documents, reviewed by NYT journalist Kate Conger, revealed Elon Musk, 51, has cut parental leave to two weeks from 20.\n484\n comment\ns\n1884\n share\ns\nTesla market value plummets $143 BILLION in just 26 days after poor EV sales caused Elon Musk to slash car prices seven times this year\n26/04/23 04:50\nAggressive price cuts and low first-quarter delivery rates led to Tesla losing $143 billion in its market value over the last 26 days. Investors demand board keeps Elon Musk on a short leash.\n104\n comment\ns\n46\n share\ns\nDoes Elon Musk have a secret second Twitter account? Bizarre profile that pretends to be a three-year-old child is linked to the billionaire\n26/04/23 10:25\nInternet sleuths say the tech billionaire actually has a secret second Twitter account which bizarrely pretends to be a three-year-old child, possibly role-playing Musk's real-life son X AE A-XII Musk.\n26\n comment\ns\n7\n share\ns\nElon Musk slams Stephen King over author's recent Twitter criticism\n23/04/23 07:48\nThe comments come less than a week after Musk, finally did away with the website's famed blue ticks, previously used to discern the official accounts of world figures from impersonators,\n comment\ns\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Sam Ryder at F1 is everything a celeb should be compared to Cara Delevingne': Twitter users blast model for snubbing Martin Brundle\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shay Mitchell is the picture of elegance in bell-shaped dress at world premiere of live-action Barbie film in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robert Downey Jr. shares fun group snaps with his Oppenheimer co-stars in NYC - with an unexpected photobomb from John Krasinski\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nNewzit\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/russia-ukraine-conflict/index.html",
        "https://www.dailymail.co.uk/news/china/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/uk_weather/index.html",
        "https://www.dailymail.co.uk/news/mostread/index.html",
        "https://www.dailymail.co.uk/news/article-12280535/Elon-Musk-escalates-war-words-Mark-Zuckerberg-ahead-Las-Vegas-cage-fight.html",
        "https://www.dailymail.co.uk/news/article-12279379/Doctor-purposely-drove-Tesla-family-cliff-asks-mental-health-diversion.html",
        "https://www.dailymail.co.uk/news/article-12279339/Elon-Musk-sues-elite-law-firm-Wachtell-tries-claw-90-MILLION-got-Twitter.html",
        "https://www.dailymail.co.uk/news/article-12276393/Elon-Musk-signs-letter-pledging-Teslas-commitment-Chinas-core-socialist-values.html",
        "https://www.dailymail.co.uk/news/article-10874471/Elon-Musk-tells-Tesla-staff-face-fired-unless-40-hours-office.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}