{
    "url": "https://www.dailymail.co.uk/news/bbc/index.html",
    "title": "BBC: UK and World News Headlines, Pictures and Updates | Daily Mail Online",
    "hash": "747758f51533ef4ca9fbb94fc59879bd",
    "text": "BBC: UK and World News Headlines, Pictures and Updates | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking News\n\n\n\n\n\n\n\n                    \n                    Australia\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Video\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Russia-Ukraine\n                    \n                \n\n\n\n\n\n\n\n                    \n                    China\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debate\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    King Charles III\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Weather\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Most read\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nBBC\n\n\nLast updated: 08:04 BST, 10 July 2023\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\nTrending BBC News\nBBC presenter at the centre of pics scandal 'phoned youngster'\nAntiques Roadshow guest astounded at value of Live Aid poster\nJeremy Vine threatens legal action against trolls amid BBC scandal\nBBC presenter rumours: Met confirms it HAS spoken to the corporation\nHuw Edwards admits he fears tweeting over BBC's impartiality rules\nCop who unmasked Jimmy Savile says BBC should name presenter\nMoment Titan sub passengers catch sight of the Titanic\nBBC host 'partied with bosses AFTER sex pictures allegation was made'\nRELATED TOPICS FOR BBC\nITV\nSky News\nNetflix\nGoogle\nChannel 4\n\n\n\n\n\n\nBBC: UK and World News Headlines, Pictures and Updates\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\nBBC bosses to meet police TODAY after corporation suspends top presenter who 'paid teenager £35K for explicit photos' - as it emerges he 'phoned the youngster twice when he was exposed and said: 'What have you done?''\n10/07/23 06:15\nThe unnamed broadcaster has finally been suspended by the corporation almost two months after a complaint was first made by the alleged victim's family. It came as the 'well-known' star allegedly phoned the youngster after he was exposed last week. He reportedly demanded 'what have you done?' in the call and also asked his alleged victim to ring their mother to persuade her to 'stop the investigation' as he began to panic.\n...read\n14\n comment\ns\n2\n video\ns\n share\ns\nAntiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n10/07/23 12:08\nAn Antiques Roadshow guest was astounded by the value of a poster he rescued from the bin at the famous 1985 Live Aid concert during Sunday's episode of the show.\n5\n comment\ns\n1\n video\n10\n share\ns\nHow Labour's green energy splurge could cost taxpayers an extra £10 billion more than the party has admitted\n09/07/23 11:33\nShadow Chancellor Rachel Reeves confirmed that the party remains committed to eventually investing £28billion a year to help the environment if it wins power.\n67\n comment\ns\n11\n share\ns\nBBC star at the centre of £35,000 teenage sex pics scandal 'phoned the youngster twice when he was exposed' in desperate bid 'to get their mother to drop her complaint'\n09/07/23 10:23\nThe BBC presenter at the centre of the £35,000 teenage sex pictures scandal allegedly phoned the youngster after he was exposed.\n20\n comment\ns\n3\n video\ns\n140\n share\ns\nCop who unmasked Jimmy Savile as serial paedophile says BBC should name presenter accused of paying teen for sexually explicit pictures and should have suspended him weeks ago\n09/07/23 08:55\nEx-Surrey police officer Mark Williams-Thomas, who exposed the crimes of Jimmy Savile in 2012, took to Twitter to share his views on the latest scandal to hit the corporation.\n2\n comment\ns\n1\n video\n95\n share\ns\nFamilies of Britons killed in 2019 Boeing 737 Max crash in Ethiopia fight for unlawful killing verdict as inquest begins tomorrow \n09/07/23 05:44\nBritish humanitarian workers Sam Pegram, 25, and Oliver Vick, 45, and sustainability campaigner Joanna Toole (pictured), 36, were among 157 passengers who died in March 2019.\n comment\ns\n share\ns\nJeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos - while Tim Davie blasts 'unsubstantiated' speculation on social media \n09/07/23 04:35\nMr Vine, 58, has told social media users who allegedly libelled him that he has screenshotted their 'defamatory' tweets and his lawyer 'will be in touch in the coming days'.\n50\n comment\ns\n70\n share\ns\nOla and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n09/07/23 04:13\nOla Jordan and her husband James have revealed their plans to renew their wedding vows at an 'Elvis chapel'.\n comment\ns\n1\n video\n39\n share\ns\nGavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n09/07/23 12:52\nThe Neil The Baby actor who starred in Gavin and Stacey has revealed he has 'big plans' to spend his BBC pay when he is old enough.\n comment\ns\n47\n share\ns\nMet confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos - but despite boss Tim Davie saying investigation is moving 'swiftly' police say broadcaster has made 'no formal referral or allegation'\n09/07/23 11:05\nThe Metropolitan Police has confirmed it has spoken to the BBC about the suspended presenter accused of paying a teenager more than £35,000 for sexually explicit images.\n850\n comment\ns\n3\n video\ns\n225\n share\ns\nBBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint - as corporation comes under mounting pressure from MPs over its handling of scandal\n09/07/23 07:22\nInsiders claim the host enjoyed a champagne reception and a three-course meal alongside senior executives weeks after the alleged victim's mother complained to the network.\n512\n comment\ns\n2\n video\ns\n251\n share\ns\nPanicking BBC bosses in crisis talks over star presenter sleaze scandal: Priti Patel calls corporation's initial probe into allegations 'derisory' as row grows - and Director-General must face the press on Tuesday\n09/07/23 12:41\nLast night, former Home Secretary Priti Patel (pictured) called the BBC's treatment of the complaint that a presenter paid a 17-year-old for sexual images to fund their drug addiction as 'derisory'.\n comment\ns\n109\n share\ns\n'Take my name out ya mouths': BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter and says 'it's important to take a stand'\n09/07/23 12:40\nNicky Campbell has joined other BBC stars Gary Lineker, Rylan Clark and Jeremy Vine in taking to social media to distance themselves from the sex picture scandal\n comment\ns\n1\n video\n97\n share\ns\nMAIL ON SUNDAY COMMENT: A noble history - but BBC will last only if we cure it of its bias \n09/07/23 12:01\nMAIL ON SUNDAY COMMENT: The BBC simply cannot continue indefinitely as it is. Now that its 100th birthday is out of the way, the time for nostalgic congratulation is over.\n comment\ns\n share\ns\nFrom Savile to Schofield - the TV legends who fell from grace - and could be about to be joined by Presenter X \n08/07/23 11:30\nThe BBC has been rocked by a number of sex scandals over the years involving high-profile employees. Most famous among them was Jimmy Savile.\n534\n comment\ns\n105\n share\ns\nNow Ministers plan to scale back the £159 BBC licence fee to ease the cost-of-living crisis \n08/07/23 11:24\nThe £159 fee is due to rise in line with soaring inflation next April. Now Ministers have told MPs that they are looking at removing the link between the fee and the Consumer Prices Index (CPI).\n330\n comment\ns\n40\n share\ns\nDownton Abbey baddie Nigel Harman is set to star on Strictly when it returns later this year\n08/07/23 10:08\nHeart-throb actor Nigel Harman, who played valet Mr Green in ITV period drama Downton Abbey, is set to feature in Strictly following his recent return to the BBC on hospital drama Casualty.\n28\n comment\ns\n325\n share\ns\nGary Lineker branded a hypocrite for defending Just Stop Oil while racking up more than 100,000 air miles in five years\n08/07/23 10:01\nThe Mail on Sunday can reveal that BBC presenter Gary Lineker, 62, has enjoyed at least 14 foreign holidays since 2019, including several long-haul trips.\n580\n comment\ns\n94\n share\ns\nEngland men's captain Harry Kane leads the praise for Young Lions' U21s Euros triumph as Gary Lineker, Rio Ferdinand and Prime Minister Rushi Sunak hail their 'wonderful' achievement\n08/07/23 08:53\nLee Carsley's side were unsurprisingly lauded after their historic win by fans, former and current England players as well as the prime minister.\n35\n comment\ns\n1702\n share\ns\n'Stripped half naked, the BBC man was on his sofa waiting for my child to perform': Mother of youth 'paid £35k for sex pics by famous host' tells of shock at 'seeing lewd image of star' as man could face POLICE probe over crimes carrying 14-YEAR sentence\n08/07/23 08:39\nThe BBC presenter accused of paying a teenager more than £35,000 for sex pics could face a police probe over potential offences which comes with a maximum 14-year jail term.\n comment\ns\n1093\n share\ns\nEastEnders SPOILER: Devastating news about Louise Mitchell to be revealed amid Lisa Fowler's dramatic Walford comeback \n08/07/23 05:50\nEastEnders' Lisa Fowler (Lucy Benjamin) is set to bring with her some bad news about her daughter Louise Mitchell (previously Tilly Keeper) as she returns to Walford.\n comment\ns\n1\n video\n25\n share\ns\nWhy was he allowed to remain on air? Questions grow over BBC response as presenter faces end of career for 'giving £35,000 to teenager for sex pictures that youth then spent on crack cocaine'\n08/07/23 02:18\nThe presenter, who has not been named but is described as being well-known, allegedly began paying the teenager when they were 17, who then used the money to fund a drug addiction.\n comment\ns\n54\n share\ns\nLegendary BBC quiz show makes surprising early comeback announcement as presenter reveals schedule\n08/07/23 11:45\nBBC's Only Connect is set to come back quicker than fan expected - as legendary host Victoria Mitchell took to Twitter to share the thrilling announcement.\n1\n comment\n41\n share\ns\nGary Lineker joins Jeremy Vine and Rylan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal: Trio issue denials as broadcaster investigates claim 'presenter paid a teenager £35,000 for sexual photos'\n08/07/23 11:29\nA presenter, who is described as well-known but has not been named, allegedly began paying the teenager when they were 17, and sent them the money which they used to fund a drug addiction.\n comment\ns\n1\n video\n501\n share\ns\nInside Steve Jones' love life: Following THAT awkward interview with his ex Alex Jones - we look at the presenter's star-studded dating history including trysts with Pamela Anderson\n08/07/23 08:43\nHe caused a stir with his cringeworthy interview earlier this week, after he appeared on The One Show hosted by his ex-girlfriend Alex Jones.\n131\n comment\ns\n2\n video\ns\n28\n share\ns\nRepair Shop star's 'abusive husband' is revealed: Suzie Fletcher's 'coercive' spouse was US oilfield worker who 'choked and threatened to kill' TV expert during 15-year marriage\n08/07/23 08:26\nMailOnline has uncovered that the husband she called just Rob in her book was James Allen Baker, an oilfield worker from Eaton, Colorado, who died of pancreatic cancer at just 52 ten years ago.\n19\n comment\ns\n1\n video\n247\n share\ns\nBring 'Spuggy' back to Byker Grove! Child star turned cleaning boss calls on Ant and Dec to bring her back for reboot of classic kids TV show \n08/07/23 08:25\nLyndyann Barrass became a fan favourite after landing the role of Spuggy in the BBC teen drama. While the series launched the careers of Ant and Dec, Lyndyann followed a very different path\n2\n comment\ns\n1\n video\n54\n share\ns\nBBC launch investigation into top star who is taken off air after 'paying teenager £35,000 for sexual pictures that youngster used to buy crack cocaine'\n08/07/23 07:49\nThe well-known presenter allegedly began paying the teenager when they were 17, and sent them the money which they used to fund a drug addiction.\n comment\ns\n303\n share\ns\nIrish BBC radio presenter loses claim against broadcaster after his colleague branded him a leprechaun following Gaelic social media post \n08/07/23 12:59\nDavid Hedges claimed he had been subjected to racist abuse at BBC Radio Solent in Southampton after an assistant editor there commented the in his eyes 'racist' message on a social media post.\n17\n comment\ns\n10\n share\ns\nDR MICHAEL MOSLEY: How cycling for just 40 seconds can keep you young\n07/07/23 11:15\nDR MICHAEL MOSLEY: I've been looking at the latest science on how to keep our body - and brain - healthy and youthful for a new radio series, appropriately called Stay Young.\n74\n comment\ns\n21\n share\ns\nTop BBC star is taken off air after 'paying teenager £35,000 for sexual pictures' \n07/07/23 10:14\nThe well-known presenter allegedly began paying the teenager when they were 17, and sent them the money which they used to fund a crack cocaine addiction.\n comment\ns\n1735\n share\ns\nBradley Walsh's son is catching up on father's £18.6million fortune after landing a number of lucrative gigs, featuring a bidding war between the BBC and ITV \n07/07/23 09:08\nSources say that Walsh Junior is being 'inundated' with offers after catapulting to fame next to his father on their ITV series Bradley Walsh & Son: Breaking Dad.\n135\n comment\ns\n44\n share\ns\nBizarre moment BBC News host makes a series of strange noises thinking her microphone was off \n07/07/23 06:49\nA BBC news anchor made a bizarre blunder as she was clearly unaware her mic was still on, making some strange news as her colleague attempted to deliver the weather forecast.\n103\n comment\ns\n2\n video\ns\n110\n share\ns\nStrictly Come Dancing's Joe Sugg and Dianne Buswell splash out a whopping £3.5 million on a new luxury five-bedroom property near Brighton\n07/07/23 06:20\nJoe Sugg and Dianne Buswell have splashed out a whopping £3.5 million on a new luxury five-bedroom property near Brighton, MailOnline can reveal.\n536\n comment\ns\n1\n video\n173\n share\ns\nPensioner, 98, fulfils lifelong dream of going ice skating after believing she couldn't do it because it 'wasn't for working class people'\n07/07/23 04:35\nBetty Thompson, 98, from Mansfield, has wanted to go ice skating since she was a child, but never got the opportunity to do so.\n24\n comment\ns\n1\n video\n31\n share\ns\nBBC Formula One presenter Jennie Gow returns to BBC coverage for the first time since having a stroke six months ago\n07/07/23 03:42\nToday, the 46-year-old shared her nerves and excitement as she made her comeback with an interview with Lewis Hamilton at Silverstone. Jennie revealed the news on Twitter.\n4\n comment\ns\n1\n video\n1\n share\nEXCLUSIVE: Naga Munchetty serves up plans for Grand Designs-style revamp of her £1.8milion home including a new games room and hidden library \n07/07/23 03:14\nThe news anchor and TV director husband James Haggar have taken a leaf out of the Channel 4 home improvement programme with proposals to extend their Rickmansworth pad.\n30\n comment\ns\n1\n share\nWife says her irritated husband cited in his petition for divorce that she watched EastEnders - and she hasn't viewed it since\n07/07/23 01:06\nSpeaking in a call-in to Jeremy Vine's Channel 5 programme today, Sally, from Staffordshire, had the presenter shocked at her former beau's seemingly judgemental attitude.\n30\n comment\ns\n1\n video\n40\n share\ns\n Bradley Walsh's son Barney, 25, is 'at the centre of a bidding war between the BBC and ITV' after starring in hugely successful Breaking Dad travel series alongside The Chase star\n07/07/23 12:36\nBarney Walsh, 25, is being 'inundated' with offers after catapulting to fame next to his father on their ITV series Bradley Walsh & Son: Breaking Dad.\n34\n comment\ns\n40\n share\ns\n'I was watching myself on the floor': Dan Walker reveals he had a shocking out-of-body experience minutes after his near-death bike crash\n07/07/23 11:26\nThe former BBC Breakfast host, 46, opened up about the near-death bike crash he suffered earlier in February, and revealed he had an out-of-body experience minutes after.\n84\n comment\ns\n1\n video\n30\n share\ns\nBBC bosses vow to save EastEnders 'at all costs' as fans switch off in their droves thanks to its 'unbearably woke' storylines - from 'Walford's own Greta Thunberg' to Sharon Watts likening Brexit to Covid \n07/07/23 10:28\nEastEnders ' future have reportedly been ignited as fans have switched off in their droves over 'desperate' plots and woke storylines in recent times. This includes an apparent snipe at Brexit by Sharon.\n3448\n comment\ns\n3\n video\ns\n542\n share\ns\nUrgent warning over 'dangerous' muscle-building drugs being sold illegally: 40p pills may cause infertility, heart attacks and strokes\n07/07/23 09:51\nUndercover BBC reporters found the performance-enhancing substances available in shops selling bodybuilding supplements. Retailers were caught offering advice on how to take the pills.\n173\n comment\ns\n44\n share\ns\nCan you answer these questions from TV's top quiz shows?  From Eggheads to Mastermind find out if you have what it takes to walk away with the top prize...\n07/07/23 08:16\nWeekend Magazine have put together a quiz to see if you bag the top prize. They have teaser rounds from Eggheads, which is hosted by Jeremy Vine who is from Surrey, and Moneyball.\n282\n comment\ns\n46\n share\ns\nLabour donor Dale Vince defends Just Stop Oil causing chaos at Wimbledon and the Ashes saying climate change is the 'real disruption'\n07/07/23 06:50\nEco entrepreneur Dale Vince, who has donated money both to Just Stop Oil and Labour, said rain had a bigger impact Wimbledon than protests.\n658\n comment\ns\n1\n video\n13\n share\ns\nGary Lineker is slammed as a 'hypocrite in the highest order' for defending Just Stop Oil protesters after eco-clowns stormed Wimbledon court and threw jigsaw pieces\n07/07/23 01:11\nGary Lineker, 62, (pictured) said the attention-seeking eco warriors were 'not going to hurt anyone' and that he understood 'where they're coming from'.\n668\n comment\ns\n2\n video\ns\n69\n share\ns\nThis Morning star 'is at centre of bidding war between Strictly Come Dancing and I'm A Celebrity'\n07/07/23 12:50\nThe This Morning presenter, 38, is said to be in talks with bosses for both the BBC dance show and ITV's jungle reality series.\n38\n comment\ns\n1\n video\n11\n share\ns\nFears for EastEnders' future as fans switch off over 'desperate' plots and 'woke' storylines... sparking concern the 'final days' of the show loom despite £87m spend on new set\n07/07/23 12:48\nFears for EastEnders' future have been ignited as fans have switched off in their droves over 'desperate' plots and woke storylines in recent times, it's been reported.\n2126\n comment\ns\n1\n video\n727\n share\ns\nBoris Becker commentates on Wimbledon from a dimly-lit bar on Instagram while referring to himself in the third person\n06/07/23 08:53\nThe 55-year-old former tennis star offered his opinion on Stefanos Tsitsipas, who prevailed in a five set battle against Dominic Thiem on Wednesday, before playing Andy Murray tonight.\n691\n comment\ns\n42\n share\ns\nBreath-taking scenes the doomed Titan 5 risked all to see: Footage shows the moment sub's elated previous passengers clapped eyes on Titanic's decaying bow \n06/07/23 03:55\nFootage from inside the submersible, filmed as part of a 2022 BBC documentary, shows an emotional group of passengers as they traveled 2.5 miles down into the ocean bed.\n61\n comment\ns\n1\n video\n631\n share\ns\nBBC Breakfast's Nina Warhurst shares adorable snap of her newborn daughter after welcoming third child\n06/07/23 02:59\nThe BBC Breakfast presenter looked radiant in the Instagram shot as she cuddled up to her newborn for a striking makeup-free selfie.\n8\n comment\ns\n2\n video\ns\n3\n share\ns\nBBC make last-minute offer to UEFA to televise England's Under 21s European Championship final showdown with Spain... with talks ongoing ahead of huge clash on Saturday\n06/07/23 01:19\nEXCLUSIVE BY MATT HUGHES: The BBC have made a last-minute offer to UEFA to televise England's under 21 European Championship final against Spain on Saturday  with talks ongoing\n50\n comment\ns\n48\n share\ns\nViewers of the Great British Sewing Bee left stunned as contestant makes a revelation about her age \n06/07/23 09:30\nMany of those watching BBC's The Great British Sewing Bee last night were left stunned when contestant Mia, from Surrey, revealed her age during 90s week on the show.\n50\n comment\ns\n1\n video\n share\ns\nVeteran eco-warrior Swampy rejects Just Stop Oil tactics as he joins 'moderate alternative' group that counts a Tory peer and BBC presenter Chris Packham among its members \n06/07/23 09:30\nSwampy, (pictured) whose real name is Daniel Hooper, has rejected the tactics used by Just Stop Oil to combat climate change, claiming the 'time has come to bring communities together'.\n5\n comment\ns\n4\n video\ns\n16\n share\ns\nBBC apologises after news anchor Anjana Gadgil says 'Israeli forces are happy to kill children' in interview with country's former prime minister over West Bank raid \n06/07/23 08:47\nThe BBC has provoked outrage after newsreader Anjana Gadgil said 'Israeli forces are happy to kill children' during an interview with the country's ex-prime minister Naftali Bennett.\n221\n comment\ns\n2\n video\ns\n169\n share\ns\nUnseen footage of David Tennant's return to Doctor Who shows the moment he reunites with Catherine Tate's Donna Noble after 14 years - and gives the closest look yet at the Time Lord's new sonic screwdriver\n06/07/23 01:45\nUnseen footage from the set of David Tennant's return to Doctor Who shows the moment Doctor reunites with Catherine Tate's Donna Noble after 14 years (pictured).\n19\n comment\ns\n2\n video\ns\n113\n share\ns\nCasualty set to celebrate 75 years of the NHS with groundbreaking episode featuring real medical professionals\n05/07/23 04:11\nThis July marks 75 years of the NHS after it was first founded in 1948 and BBC drama Casualty is set to air a special episode to mark the anniversary.\n23\n comment\ns\n1\n share\nSue Barker is back! Broadcaster delights fans as she enjoys her retirement in the Royal Box - after revamped Today at Wimbledon show is deemed 'truly dreadful' by viewers\n05/07/23 03:11\nThe broadcaster was back at Wimbledon today, and there wasn't a microphone in sight. Barker, 67, received a warm welcome as she took her seat - as a fan - on Centre Court.\n194\n comment\ns\n23\n share\ns\nBritish Olympic snowboarder Jenny Jones, 43, announces she's given birth to her first child, a baby boy, as she reveals his unique name\n05/07/23 09:43\nThe BBC Ski Sunday presenter, 43, has welcomed a baby boy, Wilbur Jones-Haines, with her partner Dan.\n41\n comment\ns\n1\n video\n204\n share\ns\n'Almost every deep-diving sub makes a noise at some point': How OceanGate CEO Stockton Rush downplayed 'really loud bang' on previous trip before its fateful voyage to the Titanic\n04/07/23 11:17\nAnother clip of OceanGate CEO Stockton Rush dismissing past concerns about the deadly Titan submersible has emerged, with the the exec filmed ignoring a loud bang on a prior mission.\n490\n comment\ns\n2\n video\ns\n713\n share\ns\nNick Cave reveals he 'was high on drugs' when he performed with Kylie Minogue on music show Top of the Pops: 'I couldn't have done it otherwise'\n04/07/23 11:04\nNick Cave has revealed he was 'high on drugs' when he performed a duet with Kylie Minogue on BBC charts show Top of the Pops.\n36\n comment\ns\n1\n video\n57\n share\ns\nHow the Met botched its investigation into a depraved detective after he was reported by four victims of sex crimes who had slept with him\n04/07/23 09:02\nAn inquiry into the conduct of a senior Scotland Yard detective Inspector Warren Arter (pictured) was 'botched' after he was reported by four victims of sex crimes who had slept with him, it has emerged.\n6\n comment\ns\n22\n share\ns\nThe hunky environmentalist and 'tennis geek' who is dividing viewers as the BBC's new face of Wimbledon: Fans slam 'truly dreadful' new format of highlights show fronted by Qasa Alom - who idolises Goran Ivanišević and even has a dog called Rafa \n04/07/23 07:50\nThis year's revamped version from SW19 - which scraps the familiar studio overlooking Centre Court in favour of al fresco reporting - has already been dubbed 'dreadful to watch'.\n28\n comment\ns\n1\n share\n'I thought he was joking!': Titan passenger says OceanGate CEO told them to SLEEP when they got stuck for 24 hours at the bottom of Atlantic after battery failed \n04/07/23 04:13\nA man who was once a passenger on the Titan  has claimed that CEO Stockton Rush suggested the crew sleep on the vessel while stuck at the bottom of the Atlantic. \n152\n comment\ns\n3\n video\ns\n643\n share\ns\nJenny Powell reveals why she won't stop sharing her bikini snaps, claims 'the 50's are the new 30s' and believes a boob job is the secret to her age defying looks\n04/07/23 03:50\nThe TV presenter, 55, has revealed why she won't stop sharing her bikini snaps and claims that her boob job is the secret to her age-defying look.\n33\n comment\ns\n1\n share\n'Bring back Sue Barker!' Tennis fans slam 'truly dreadful' new format of BBC's Today at Wimbledon with Qasa Alom \n04/07/23 01:02\nSue Barker's departure has sparked a shake-up in the BBC's Wimbledon coverage, with highlights show Today at Wimbledon no longer based in a studio overlooking Centre Court.\n1753\n comment\ns\n86\n share\ns\nEXCLUSIVE: Angela Scanlon waltzes onto Strictly Come Dancing - and she's already tipped to be a show favourite! \n04/07/23 12:23\nThe Daily Mail can reveal Irish redhead Ms Scanlon, who currently hosts BBC2's Your House Made Perfect, is amongst the first group of celebrities to sign up to appear on the popular dance contest.\n30\n comment\ns\n1\n video\n25\n share\ns\nAlex Scott flashes her toned midriff in a black crop top as she heads out for a lavish dinner date  \n04/07/23 10:11\nThe former footballer, 38, flashed her toned midriff as she enjoyed a night out at George private members' club in London's Mayfair on Monday.\n14\n comment\ns\n1\n share\nBritain's richest solo TV presenter has amassed a fortune of £18.6MILLION - and it ISN'T who you'd expect \n04/07/23 08:10\nBradley Walsh has been revealed as Britain's richest television presenter after amassing an eye-watering fortune of £18.6million.\n138\n comment\ns\n120\n share\ns\nJoe Swash plans to foster children with wife Stacey Solomon when their offspring are older after making documentary about teens in care \n04/07/23 12:12\nJoe Swash, 41, says he wants to foster children in the future once the offspring he shares with wife Stacey Solomon, 33, are older.\n18\n comment\ns\n1\n video\n20\n share\ns\nBanks face probe into 'chilling' account closures: Storm grows over accounts shut for political reasons following Nigel Farage row\n03/07/23 09:40\nCity minister Andrew Griffith (pictured) has been asked to look into allegations that over-zealous lenders are blocking clients without good reason.\n2103\n comment\ns\n1\n video\n89\n share\ns\nIAN HERBERT: Bland BBC coverage needs Andy Murray to add electricity to its Wimbledon broadcast team... while Isa Guha is still trying to fill the shoes of Sue Barker as lead presenter  \n03/07/23 09:30\nIt wasn't the easiest of openings for Isa Guha, sitting on a high stool at the BBC's lofty broadcast point, clutching one of those unfeasibly large yellow BBC Sport microphones.\n162\n comment\ns\n23\n share\ns\nControversial pop star looks unrecognisable 20 years after the BBC banned raunchy music video from Top of the Pops - can YOU guess who it is?\n03/07/23 05:44\nThe Russian singer showed off her stunning hair transformation and makeover with her 368k Instagram followers.\n297\n comment\ns\n1\n video\n361\n share\ns\nRishi Sunak says Norway to Orkney 'Brexit-style' breakaway bid: No10 dismisses Scottish island chain's suggestion it could leave UK and return to being part of Scandinavia in row over public spending\n03/07/23 02:37\nNo10 intervened after local politicians in Kirkwall said it was among options it was considering in a row over what they see as a lack of public spending by the British and Scottish government.\n1037\n comment\ns\n1\n video\n49\n share\ns\nFormer Coronation Street star Adam Rickitt shows off his long hair and muscular physique in a tight top as he lands new acting role 20 years after his debut in the soap\n03/07/23 12:06\nThe former Hollyoaks star, 44, showed off his incredibly muscular physique on Sunday in a tight grey sports top after landing a new soap role 20 years after his Coronation Street debut.\n28\n comment\ns\n1\n video\n47\n share\ns\nNow ITV poaches TV chef Tom Kerridge from the BBC amid raging war over celebrity talent which has seen rival network pinch Graham Norton, Zoe Ball and Gary Lineker for prime-time shows from the Beeb\n03/07/23 07:59\nThe 49-year-old Michelin-starred celebrity chef is set to tour the UK for a new ITV cooking programme with a working title of Tom Kerridge Cooks Britain, serving up regional dishes for local people.\n261\n comment\ns\n1\n video\n1\n share\nBBC Breakfast's Nina Warhurst welcomes her third child with her husband Ted as the baby's gender is revealed by her co-stars\n03/07/23 07:52\nThe broadcaster, 43, has welcomed a baby girl with her husband Ted, after previously welcoming two sons together.\n114\n comment\ns\n2\n video\ns\n1269\n share\ns\nAntiques Roadshow guest astounded by eye-watering value of dazzling yellow and white diamond brooch passed down through her family\n03/07/23 12:46\nAntiques Road expert Joanna Hardy left a guest gobsmacked by the staggering value of a brooch that had been passed down through her family during Sunday's episode.\n142\n comment\ns\n2\n video\ns\n120\n share\ns\nITV poach Michelin-starred chef for brand new series after 13 years with the BBC\n02/07/23 07:44\nA Michelin-starred chef has been poached by ITV for a new show after 13 years with the BBC.\n112\n comment\ns\n1\n video\n70\n share\ns\nGearing up ahead of Wimbledon! Former BBC presenter Sue Barker is seen out in a Porsche in a run to the shops while her replacement Clare Balding limbers up at Pilates as she prepares to take over tomorrow\n02/07/23 06:55\nSue Barker, who presented the BBC's coverage of the tournament for 30 years, took a top of the range Porsche 911 Turbo S for a spin in the Cotswolds last Saturday on June 24.\n493\n comment\ns\n123\n share\ns\nStrictly stars Molly Rainford and Tyler West put on a cosy display as they walk hand-in-hand at BST Hyde Park after confirming romance\n02/07/23 06:22\nTyler West, 27, and Molly Rainford, 22, put on a cosy display as they stepped out together to the American Express Presents BST Hyde Park in London on Sunday.\n12\n comment\ns\n1\n video\n2\n share\ns\nPage\nPrev\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n...\n20\nNext\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nSubscribe\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\n@dailymail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDailyMail\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nMailOnline\n\n\n\n\n\n\n\n\n\n\nFollow\n\n\nDaily Mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Sam Ryder at F1 is everything a celeb should be compared to Cara Delevingne': Twitter users blast model for snubbing Martin Brundle\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          And the Oscar goes to... Ken?! Ryan Gosling sparks best actor buzz in reaction to Barbie as critics rave about Margot Robbie's new movie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shay Mitchell is the picture of elegance in bell-shaped dress at world premiere of live-action Barbie film in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robert Downey Jr. shares fun group snaps with his Oppenheimer co-stars in NYC - with an unexpected photobomb from John Krasinski\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/russia-ukraine-conflict/index.html",
        "https://www.dailymail.co.uk/news/china/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/uk_weather/index.html",
        "https://www.dailymail.co.uk/news/mostread/index.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12246063/BBC-News-anchor-Huw-Edwards-admits-fears-tweeting-case-falls-foul-impartiality-rules.html",
        "https://www.dailymail.co.uk/news/article-12280709/Cop-unmasked-Jimmy-Savile-says-BBC-presenter-centre-allegations.html",
        "https://www.dailymail.co.uk/news/article-12267213/Breath-taking-moment-passengers-inside-Titan-mini-sub-catch-sight-Titanic-time.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/sky-news/index.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}