{
    "url": "https://www.dailymail.co.uk/news/royals/article-12251145/How-Prince-Harry-Meghans-circle-friends-changed.html",
    "title": "Inside Prince Harry and Meghan's ever-changing friendship group and 'feuds' with ex-pals | Daily Mail Online",
    "hash": "0fef8df586232c4e164b61bc61ccc88f",
    "text": "Inside Prince Harry and Meghan's ever-changing friendship group and 'feuds' with ex-pals | Daily Mail Online\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\nTUI\n\n\n\n\n\n\n\n                    \n                    Booking.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Nike\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Boohoo\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Wayfair\n                    \n                \n\n\n\n\n\n\n\n                    \n                    ASOS\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Very\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Argos\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Virgin Media\n                    \n                \n\n\n\n\n\n\n\n                    \n                    AO.com\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Currys\n                    \n                \n\n\n\n\n\n\n\n                    \n                    River Island\n                    \n                \n\n\n\n\n\n\n\n                    \n                    eBay\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Debenhams\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKing Charles III\n\n\n\n\n\n\n\n                    \n                    Prince William\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Kate Middleton\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Prince Harry\n                    \n                \n\n\n\n\n\n\n\n                    \n                    Meghan Markle\n                    \n                \n\n\n\n\n\n\n\n                    \n                    The Queen Consort\n                    \n                \n\n\n\n\n\n\n\n\nMy Profile\n\n\nLogout\n\n\n\n\n\n\n\n\n\n\n\n              Login\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nFeedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonday, Jul 10th 2023\n\n\n8AM\n\n\n19°C\n\n\n11AM\n\n\n21°C\n\n\n\n\n5-Day Forecast\n\n\n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlanet Sussex: How Prince Harry and Meghan's circle of close friends has changed over the years... so who's in and who's out of their orbit?\nBy \nMark Duell\n \n \nPublished:\n \n 09:25 BST, 2 July 2023 \n \n | \n \nUpdated:\n \n 11:16 BST, 3 July 2023 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \ne-mail\n \n \n \n \n \n \n \n \n81\n \nshares\n \n \n \n \n 91\n \nView \n comments\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n\n\n\n\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrince Harry and Meghan have had an ever-changing circle of friends over the past few years after they quit as working royals in 2020 and began a new life in the US.\nWhile they have been close for years to the likes of Serena Williams and Misha Nonoo, they have also more recently got to know Tyler Perry and Oprah Winfrey.\nOthers in the Sussexes's trusted inner circle include Gayle King, Misan Harriman and Sophie Trudeau as well as Princess Eugenie and her husband Jack Brooksbank.\nThey also have those with whom there have been alleged feuds, including Jessica Mulroney and Tom Inskip – while others such as Lizzie Cundy, Ninaki Priddy and Millie Mackintosh have openly spoken about the relationship breaking down.\nThe Duke and Duchess will no doubt be turning to their trusted friends as they work out what to do next after their £18million Spotify deal ended early. They also still have an £80million Netflix deal and Harry's £29million four-book deal.\nHere, MailOnline looks in detail at those who are still close to Meghan and Harry and those who have drifted away:\n \n \n \n \n \n \n \n \n \nINNER ORBIT \nTyler Perry\n \n \n \n \n \n \n \n \n \nAmerican actor and filmmaker Tyler Perry has become one of Harry and Meghan's closest friends since they moved to California – but they first had contact before their wedding in 2018.\nMeghan revealed in the Sussexes' Netflix documentary that Perry sent her a letter expressing his sympathy over how she was estranged from her father Thomas.\nShe said in the programme: 'I'd never met him before. He said he was praying for me, and if I ever need anything, he would be there.'\nPerry then invited Meghan and Harry in 2020 to move into his 18-bedroom home in Los Angeles worth £16million – without even having met them.\nThe couple spent six weeks there before later moving into their first home together, the £12million mansion in Montecito where they live now.\nThe trio have since become good friends, and Perry is now Lilibet's godfather –but told the Netflix documentary that he did so on the insistence that he would not be involved in any royal ceremony at a church in Britain.\nThe Sussexes are also said to have enjoyed holidays on Perry's private island in the Bahamas. \nOprah Winfrey\n \n \n \n \n \n \n \n \n \nPerhaps Meghan and Harry's most famous friend is Oprah Winfrey, who conducted the bombshell interview with the couple in 2021 that caused a huge fallout over a series of allegations including racism and bullying.\nLater reflecting on the interview on CBS in September last year, Oprah – who is a close neighbour of the couple in Montecito - claimed that she 'didn't set out to do a bombshell interview'.\nShe added: 'I was as surprised by the bombshell as everybody else. I was doing an interview to offer them a platform, to tell their story about why they left.'\nIn March this year, Oprah said the couple had not consulted her on whether to attend the King's Coronation - which led to some claims on Twitter that she was distancing herself from them.\nBut there is no suggestion that they have had any falling out, and she has always been very respectful of the Sussexes in interviews.\nAsked by Gayle King last year whether Harry and Prince William could reconcile after Queen Elizabeth II's death, Winfrey replied: 'I do not get into people's family matters.'\nAnd back in 2020 when Harry and Meghan stepped down as senior royals, Oprah told TMZ: 'I support them 1,000 percent.'\nGayle King\n \n \n \n \n \n \n \n \n \nCBS presenter Gayle King was one of the guests at Meghan's famously lavish baby shower in New York in 2019 and has regularly defended the couple on US television.\nNow one of the couple's chief cheerleaders in America, King also recently praised how they handled the decision for Harry to attend his father King Charles III's Coronation in London in May and leave Meghan in California.\nIn April, she told Us Weekly: 'I think Meghan and Harry should do what's best for them. Clearly they know what's going on in their family life. They know what's going on over there.'\nBut King added that the Sussexes do not ask for advice, saying: 'They consult me about nothing when it comes to that or anything for that matter.'\nBack in 2021 at the time of the Oprah Winfrey interview, King also defended Meghan over accusations of falsehoods given in the bombshell chat - and said the Duchess 'has documents to back up everything that she said'.\nEarlier this month it was claimed that King was trying to secure Meghan as a guest on her new CNN show King Charles. The title comes from King's own last name, and her co-host Charles Barkley's first name.\nMisan Harriman\n \n \n \n \n \n \n \n \n \nMisan Harriman is a Nigerian-born British celebrity photographer and a family friend of Harry and Meghan, who claims to have helped them meet.\nHe took the pregnancy announcement photograph of the couple in February 2021 sat under a tree in Los Angeles, with Harry resting his hand on Meghan's head as she lay in his lap cradling her bump.\nMr Harriman then took a portrait of their daughter, Lilibet, to mark her first birthday in June last year.\nHe has spoken about his pivotal role in Meghan and Harry meeting.\nMr Harriman previously told British Vogue: 'Meg reminded me that had I not introduced her to a mutual friend then she wouldn't have met Harry. I'm grateful for whatever small part I played.'\nAs well as Meghan, he has photographed a range of celebrities including Tom Cruise, Julia Roberts, Cate Blanchett, Olivia Colman and Rihanna.\nSerena Williams\n \n \n \n \n \n \n \n \n \nMeghan's bond with Serena Williams dates back to 2010 and is one of the longest friendships the Duchess has had with a major celebrity.\nThey first met at the Super Bowl that year, and then again at the event in 2014 in New York.\nMeghan then started watching Williams in tennis tournaments, including the US Open in 2014 and the Australian Open in 2015.\nWilliams recalled to Vanity Fair in 2017 that after Meghan started dating Harry, she told her: 'You've got to be who you are, Meghan. You can't hide.'\nThe tennis star and her husband Alexis Ohanian attended Harry and Meghan's wedding in May 2018 – and then Meghan watched Williams at Wimbledon in June that year, alongside Kate in the Royal Box. They did so again in July 2019.\nWilliams then defended Meghan after the Oprah interview in 2021, writing on social media: 'Meghan Markle, my selfless friend, lives her life - and leads by example - with empathy and compassion.\n'She teaches me every day what is means to be truly noble. Her words illustrate the pain and cruelty she's experienced.'\nThen in August last year, Williams appeared on Meghan's Spotify podcast Archetypes and the Duchess recalled meeting her in 2014, saying: 'I show up and I see you walking toward someone.\n'I remember thinking, 'Oh my gosh, who is Serena Williams going to talk to?' I looked behind me and when I turned around, you were there right in front of me... We became such fast friends.'\nPrincess Eugenie and Jack Brooksbank\n \n \n \n \n \n \n \n \n \nPrince Harry has been very close with his cousin Princess Eugenie since they were children, and that bond has strengthened since he married Meghan and Eugenie wed Jack Brooksbank – both in 2018.\nEugenie was one of the first people Harry introduced Meghan to before they revealed their relationship back in 2016 – and he said in his memoir Spare that the women instantly became friends and were soon hugging 'like sisters'.\nThe Princess has since visited the couple in California. Footage of her trip to see them featured in the Sussexes' Netflix documentary – and they were also seen attending the Super Bowl together in 2022.\nA source told Us Weekly in December last year that Eugenie and the Sussexes are in 'regular communication and FaceTime at least once every couple of months with the children'.\nHarry and Meghan also went on a night out to a Halloween party in Toronto with Eugenie and Mr Brooksbank in 2016 - before the Sussexes had gone public with their relationship.\nAnd Harry wrote in his book about how Eugenie introduced him to the model and actress Cressida Bonas who later became his girlfriend.\nHarry said he and Ms Bonas shared an awkward kiss because his 'aim was off', and he then phoned Eugenie to tell her about this. But the Duke added: 'She'd already spoken to Cressida. She sighed. Awkward.'\nMisha Nonoo\n \n \n \n \n \n \n \n \n \nMisha Nonoo is a fashion designer and the former wife of Harry's friend Alexander Gilkes. She is one of a few people rumoured to have set up the couple.\nMeghan first met Ms Nonoo when she was filming the TV drama Suits in Toronto, and they became good friends – even going away on holiday together.\nMs Nonoo was a guest at Harry and Meghan's wedding, and they have worked together on a clothing line for the charity Smart Works.\nMeghan has also backed her friend's brand - wearing her 'Husband' shirt at her first public appearance with Harry at the Invictus Games in Toronto in 2017.\nMs Nonoo and her husband Mike Hess are also known to be friendly with Princess Beatrice and her husband Edoardo Mapelli Mozzi, having been pictured going for dinner together in London's Mayfair in July last year.\nSophie Trudeau\n \n \n \n \n \n \n \n \n \nMeghan first became friendly with First Lady of Canada Sophie Trudeau in 2016, according to the biography Finding Freedom.\nMrs Trudeau appeared on her Spotify podcast Archetypes last November, with the Duchess revealing how she threw a pool party last summer with her and they 'giggled like schoolgirls' on her latest podcast episode.\nMeghan described Mrs Trudeau as 'a dear friend' and said she hosted the event at her home in Montecito earlier last year, adding that it was a chance to 'get the kids together, drink wine, swim.'\nShe described how she had bought an 'inflatable pizza slice online' which the family 'splashed about on' - calling it 'a big hit.'\nAccording to Finding Freedom, when she began dating Harry in 2016, Meghan was urged to take advice from Mrs Trudeau by her friend Jessica Mulroney, who deemed the two women 'now had a lot in common'.\nMeghan had previously met her husband, Canadian Prime Minister Justin Trudeau at the One Young World summit in Ottawa in 2016, with the pair pictured deep in conversation.\nPrince Harry and Mr Trudeau have always appeared to enjoy each other's company at events such as Commonwealth commemorations. The two have also encountered each other on multiple occasions through Harry's Invictus Games.\nVictoria Jackson\n \n \n \n \n \n \n \n \n \nVictoria Jackson is a former make-up artist who Meghan met through their mutual friend Gloria Steinem, a well-known feminist journalist and women's rights advocate in the US.\nMs Jackson who is 26 years older than the former Suits star and appeared on the Duchess's recently axed Spotify podcast Archetypes, built one of the first TV 'infomercial' make-up empires.\nMs Jackson is married to Bill Guthy whose direct marketing company Guthy-Renker helped ex-supermodel Cindy Crawford turn her Meaningful Beauty line of creams and cosmetics into an £80million brand, and also represents Jennifer Lopez's JLo Beauty.\nThere have been claims that Ms Jackson and her husband would be the woman to help Meghan develop a skincare or make-up range.\nMeghan celebrated her 41st birthday at Ms Jackson's ranch close to Santa Barbara, where Harry plays polo for Los Padres, and the couple's children, Archie and Lilibet, have spent time petting the businesswoman's mini pigs on her farm.\nIn August last year, Ms Jackson told The Cut that the couple are 'good people', saying she wants to help them 'get out of the house because it's complicated for them to go anywhere'.\n \n \nMIDDLE ORBIT\nOmid Scobie\n \n \n \n \n \n \n \n \n \nRoyal reporter Omid Scobie was thought to have been a friend and trusted contact of Harry and Meghan – but both parties have moved to distance themselves from each other in recent weeks.\nEarlier this month Harry told his High Court hacking case that he 'knows of' Mr Scobie, who is Bazaar.com's royal editor-at-large and co-authored the 2020 book Finding Freedom about the Sussexes\nAt the High Court on June 7, Mr Scobie was mentioned by Mirror Group Newspaper's barrister Andrew Green KC in his cross-examination of Harry.\nMr Green quoted how Mr Scobie has previously spoken about the importance of sources in royal reporting. The barrister then asked Harry: 'Do you know Mr Omid Scobie?' The duke replied: 'Yes.' Harry then clarified: 'I know of him.'\nMr Scobie also insisted that he is not the Sussexes' 'friend, mouthpiece, cheerleader' as he gave evidence at the High Court for Harry last month.\nA profile in the Sunday Times last month claimed Mr Scobie met Meghan in 2015 at Toronto Fashion Week, before she started dating Harry.\nIt also reported that he claimed to have given Meghan 'a big farewell hug' beneath the 'malachite candelabras' of the 1844 Room in Buckingham Palace after her final engagement as a working royal.\nMr Scobie is releasing new book called 'Endgame' - described as a 'penetrating investigation' about the Royal Family 's 'fight for survival' - on November 21. \nWendell Pierce\n \n \n \n \n \n \n \n \n \nMeghan and actor Wendell Pierce were known to be close while they filmed the TV drama Suits together, in which he played her on-screen father.\nPierce walked her down the aisle for her wedding in the TV show, and recalled talking to her about her real-life relationship with Harry and future life.\nHe said: 'We had a moment I cherish. I was sitting with Meghan in her wedding dress, as we waited for a set-up. We were alone. I said to her, 'Your life is going to change'.\n'It's going to be amazing and I'm very happy for you but I want you to know that I'm your friend, and no matter where you are or what's going on – if the fishbowl that you're in ever starts getting to you – you can call me'.'\nPierce did not attend her wedding unlike several of Meghan's other Suits co-stars, but this is understood to have been due to a clashing work schedule.\nHowever he then slammed her interview with Oprah in 2021, telling LBC that the timing of the programme was poor due to the ongoing pandemic at the time.\nHe added: 'It was quite insensitive and offensive that we are all complicit in this sort of palace… gossip in the midst of so much death. I think it is insignificant.'\nHe later clarified his comments and tweeted: 'Clarity: The British monarchy is archaic in my American eyes. If slavery, colonialism and apartheid didn't educate you that they are racist, you failed history.\n'I was fortunate to tell Meghan personally I wish her all the best. Predicting this hellacious maelstrom I also told her she would always have a friend in me. Because I had no interest in the interview doesn't change that.'\nHowever, Pierce also said that they had not spoken with each other since 2019.\nTom Inskip\n \n \n \n \n \n \n \n \n \nTom Inskip, also known as 'Skippy', is one of Prince Harry's oldest friends, having met the Duke at Eton College.\nMr Inskip was with Harry on his ill-fated trip to Croatia in August 2011, when they got drunk on vodka, whisky, beer and tequila, and were photographed jumping into a pool fully-clothed at a nightclub on the party island of Hvar.\nAnd he was with Harry during his trip to Las Vegas in 2012, when the prince was photographed naked during a game of 'strip billiards'.\nMr Inskip married literary agent Lara Hughes-Young in Jamaica in 2017, with their wedding being one of the first events to which Harry took Meghan - and he was also one of the ushers.\nHowever the two apparently fell out after Mr Inskip warned Harry against marrying Meghan.\nAccording to the book Finding Freedom, Mr Inskip expressed doubts about how quickly the relationship was moving and decided to warn his friend Harry.\nHe is believed to have advised Harry and Meghan to live together before 'doing anything more serious.'\nA source close to Sussexes told the book's authors that although his advice 'came from a good place,' Harry 'didn't totally see it that way'.\nHowever, it has since been suggested that the two have made up.\nMike Tindall\n \n \n \n \n \n \n \n \n \nMike Tindall has attended numerous royal events with Prince Harry over the years, but after the 2021 Oprah interview he joked that the royals would like to throw a few punches at the Duke.\nSpeaking at an event with former England teammate Matt Dawson, they recalled a boozy night out celebrating England's 2003 Rugby World Cup win at a bar in Sydney, where they were joined by Harry, who had travelled to Australia.\nTindall and teammate Iain Balshaw thought it would be amusing to throw a few punches at Harry, to see how long it would take his protection officers to pin them to the ground – which turned out to be a few seconds.\nAnd Tindall - the husband of Harry's cousin Zara - said: 'At Balmoral, the family are now having the same conversation. Except the Queen has taken his security away.'\nTindall was also alleged to have used an insulting phrase to a fellow guest in reference to Harry at a reception following the Platinum Party at the Palace in June last year – although that report in the Daily Express has never been confirmed.\nBut the Tindalls are thought to be among the few royals with whom Harry still has a close relationship since he moved to the US. \nSarah Ferguson\n \n \n \n \n \n \n \n \n \nSarah Ferguson is not thought to be close to Harry and Meghan nowadays, and recently appeared to subtly criticise their decision to step down as working royals.\nIn an interview with the Independent in April, she said: 'Well, you can't have it both ways. You can't sit on the fence and keep one foot in and one foot out. You're either in or out. But then don't cry about not being invited to weddings. You chose to leave, now go and live it – and be it.'\nHowever, she has also admitted she 'does not really know' Meghan, although she is sure that Meghan 'really loves' Harry.\nAnd she has said that Meghan gives Harry 'love he's never felt before'.\nThe Duchess of York was not invited to Prince William and Kate's wedding in 2011, but did go to Harry and Meghan's in 2018.\nSpeaking on ITV's Good Morning Britain in 2018, she said: 'I felt like I was really happy for my friend Diana, who I love, and my mum and dad, and I felt honoured and grateful for Harry and Meghan to invite me.\n'It was very kind of them and I think I can't thank them enough for doing that because it was nerve-wracking but I knew I was ready.'\nGeorge and Amal Clooney\n \n \n \n \n \n \n \n \n \nGeorge and Amal Clooney were among the two most famous non-royals to attend Harry and Meghan's wedding in 2018 and were given prime seats in St George's Chapel.\nAfter the marriage they were said to have become closer and Mrs Clooney was even invited to Meghan's baby shower in New York in 2019.\nThe Clooneys hosted Harry and Meghan at least twice at their home in Sonning, Oxfordshire, according to the Sussexes' biography Finding Freedom.\nThe book also claimed that the Clooneys invited the Sussexes to Lake Como only weeks after their wedding, flying them out on their private jet.\nFinding Freedom co-author Omid Scobie also told Good Morning America that Harry and Mr Clooney had bonded over a love of motorcycles and basketball.\nAsked by the Daily Mail in 2019 how he knew the couple, Mr Clooney said: 'I've just known them. We live not too far from one another and we have dinners and stuff and we're friends with them for all the reasons that you're friends with anybody.\n'They're just really nice, fun, kind people, they're a very loving couple, and they're going to be great parents.'\nBut the Clooneys have not taken sides in the transatlantic row between the Sussexes and the rest of the Royal Family, and turned out in support of King Charles III at a Prince's Trust event in London in May.\n \n \nOUTER ORBIT\nLizzie Cundy\n \n \n \n \n \n \n \n \n \nPresenter and model Lizzie Cundy made friends with Meghan a pre-dinner for a charity event at the home of Phones 4U founder John Caudwell in 2013.\nShe told Grazia in 2021 that they met and 'got on like a house on fire instantly', adding 'Meghan was very friendly, great fun, with a big smile.'\nCundy said Meghan had openly talked about her recent split from husband Trevor Engelson after two years of marriage, and said she wanted to 'work here in England and maybe even work on Made In Chelsea'.\nShe claimed Meghan told her she wanted an English boyfriend, and so she tried to set her up with footballer Ashley Cole, but 'she wasn't his type'.\nCundy said that when Meghan started dating Harry, she 'texted her to say how amazing it was and she did reply'.\nHowever, she continued: 'But once the ring was on the finger, I soon realised she was off Twitter and that her number wasn't working. And that was it. I'm afraid both Piers Morgan and I got ghosted.'\nCundy added that she was not left upset by this, adding: 'Personally I don't think they've gone around things the right way, but if I saw her today, I'd give her a big hug. I'm happy that they're happy.'\nGina Nelthorpe-Cowne\n \n \n \n \n \n \n \n \n \nMeghan's former friend, advisor and confidante Gina Nelthorpe-Cowne spent two years together travelling the world for corporate and charity events.\nMs Nelthorpe-Cowne and her husband Mark established Kruger Cowne Talent Management and they met Meghan in 2014.\nThis was when they were working with the One Young World - and Meghan, who was in the TV drama Suits at the time, was interested in becoming involved.\nMs Nelthorpe-Cowne said they 'just clicked', adding: 'We spoke on the phone and through emails a number of times before actually meeting, but it was an instant connection.'\nShe became Meghan's commercial agent, helping her obtain endorsements and sponsorship deals with top brands.\nBut Ms Nelthorpe-Cowne said that Meghan eventually told could no longer do commercial work once she was in the Royal Family.\nShe wrote in The Mail On Sunday in 2020: 'Meghan's last email to me was to say that her life had changed and she could no longer pursue commercial work. She really wanted to remain friends, she said, adding that it was very important to her.\n'Alas, that was not to be: I've never heard from her directly again.'\nJessica Mulroney\n \n \n \n \n \n \n \n \n \nMeghan and stylist Jessica Mulroney were once best friends and were pictured at a number of high-profile events together after meeting in 2011. \nMeghan and Harry spent time with Mrs Mulroney and her husband Ben while in Toronto before their relationship was made public in 2016. \nMrs Mulroney played a key part in Meghan's wedding, and is said to have flown in to London four days beforehand to help her get fitted for her dress.\nMeghan also asked her three children John, Brian and Isabel to be in her wedding party - while the stylist was given a starring role as she entered St George's Chapel alongside Kate Middleton.\nMrs Mulroney was also then also among several famous faces who organised Meghan's baby shower in New York in 2019, and defended the couple when they were slammed for using private jets, saying they had been the target of 'racist bullies'.\nBut it appears the pair became distant after Mrs Mulroney became embroiled in a 'white privilege' row with lifestyle blogger Sasha Exeter.\nFollowing the murder of George Floyd in May 2020, Sasha posted on her Instagram Stories and encouraged her followers and fellow influencers to speak out about the Black Lives Matter movement.\nHowever, the blogger claimed Mrs Mulroney 'took offence' from her 'generic call to action' post. In a follow-up video, Ms Exeter said: 'What happened next was a series of very problematic behaviour and antics [...]\n'I'm by no means calling Jess a racist but what I will say is this: She is very well aware of her wealth, perceived power and privilege because of the colour of her skin and that, my friends, gave her the momentary confidence to come for my livelihood in writing. Textbook white privilege really, in my personal opinion.'\nFollowing the blogger's claims, Mrs Mulroney issued three public apologies, but was dropped by numerous television networks including ABC's Good Morning America and Canadian TV network CTV.\nDespite publicly supporting Meghan as she adapted to life as a Royal, the stylist was not among the women featured on the Duchess' Archetypes podcast.\nAnd Mrs Mulroney was also noticeably absent from the Sussexes' Netflix documentary series.\nNinaki Priddy\nMeghan's childhood friend Ninaki Priddy was maid of honour at Meghan's first wedding to Trevor Engelson in front of more than 100 guests on a beach in Jamaica.\nShe told the Daily Mail in 2017: 'Meg literally shone with happiness. We'd been like sisters since we were two years old, so I knew she'd always wanted to get married. \nThey had been inseparable from their first days at Hollywood's private Little Red School House, which they both joined at the age of two, before moving on together at 11 to the Immaculate Heart girls' high school in Los Angeles.\nBut Ms Priddy said they fell out after she disapproved of the manner of Meghan's break-up from Mr Engelson.\nShe added: 'All I can say now is that I think Meghan was calculated — very calculated — in the way she handled people and relationships.\n'She is very strategic in the way she cultivates circles of friends. Once she decides you're not part of her life, she can be very cold. It's this shutdown mechanism she has. There's nothing to negotiate. She's made her decision and that's it.'\nMillie Mackintosh\n \n \n \n \n \n \n \n \n \nMade In Chelsea star Millie Mackintosh become friends with Meghan after they met at a hotel event in Turkey, and 'gave her all of her contacts' when the actress was in London.\nShe and Meghan met up in the capital and she shared her favourite hotspots, and they were even pictured together during a girls' weekend at Soho Farmhouse in Oxfordshire in 2016.\nMackintosh said she and Meghan bonded over their marital troubles, as she was married to rapper Professor Green at the time, and Meghan had split from her first husband Trevor Engelson.\nBut Mackintosh said that she felt 'snubbed' by Meghan when she began dating Harry.\nShe claimed that she sent Meghan a message offering her well-wishes, but was surprised to receive an 'abrupt' response and decided not to contact her again.\nMackintosh said: 'It's not like I messaged her asking if it was true, that was none of my business. What I read from that message was that she needed a bit of space, to cool off.\n'I didn't message her again, but I did expect that we would stay in touch. I thought she'd message back and say, ''Sorry everything is a bit stressful right now.''\n'I never heard from her again. I felt like she'd basically told me to f**k off in that message. So I did. And we haven't spoken since.'\nBill Simmons\n \n \n \n \n \n \n \n \n \nHarry and Meghan signed a huge Spotify deal worth an estimated £18million in 2020, as part of the media empire they have hoped to build.\nBut earlier this month it emerged that they are set to lose millions after the deal was pulled because they produced only one podcast series and a half-hour festive special in three years.\nThe news sparked further revelations, including an attack by Spotify executive and podcaster, Bill Simmons, who blasted the couple as 'f***ing grifters'.\nHe also referred to a Zoom call he once had with Harry about podcast ideas but said he would have to get drunk to recount the tale – which is one of his 'best stories'.\nAnd he has previously spoken of his embarrassment at sharing the same platform as the Sussexes and said the prince 'just complains about' the Royal Family.\nLast January, he said it was 'embarrassing' to be affiliated with the same company. 'Shoot this guy to the sun,' he said, according to sports website The Big Lead .\n'I'm so tired of this guy. What does he bring to the table? He just whines about s*** and keeps giving interviews. Who gives a s***? Who cares about your life?\n'You weren't even the favorite son. You live in f***ing Montecito and you just sell documentaries and podcasts and nobody cares what you have to say about anything unless you talk about the royal family and you just complain about them.'\nEarlier this week it was claimed Harry suggested interviewing Russian president Vladimir Putin about 'childhood traumas' as part of a podcast pitch.\nEdward Enninful\n \n \n \n \n \n \n \n \n \nVogue editor Edward Enninful - who is poised to take on a new global role at Conde Nast - has previously spoken in support of Meghan.\nIn August 2020, he denied criticism of her was racist and suggested it 'took a minute' for the Duchess to 'understand the rules' of the royal institution.\nSpeaking in an interview with Sky News, Enninful said he wouldn't put criticism of her 'down to racism', explaining: 'The Duchess of Sussex is a brave woman. I feel that it wasn't. Parts of it were probably racism, but it was more of an institution.'\nHe added that while criticism was 'harsh', he 'wouldn't just blame it on racism', saying: 'She walked into an institution and everyone expected her to know the rules. And I think sometimes it takes a minute to understand the rules.'\nBut they were said to have feuded when she guest edited the magazine's September 2019 issue, according to Tom Bower's book 'Revenge: Meghan, Harry, and the War between the Windsors'.\nHe claimed Meghan clashed with Enninful and his staff on her suggestions for the issue and trying to alter when it would be published in the US and Britain.\nMr Bower also claimed Enninful and Markle had different views on how to publicise the book, with Meghan's plan to 'lighting up the internet' with leaks, but Enninful favouring secrecy.\nMeghan was said to have asked her head of communications, Sara Latham, to get Vogue to publish in the US first and the UK second – a change to the schedule.\nBut Enninful was said to have rejected Latham's request, which severely damaged Meghan's relationship with the magazine.\nBut two years later, Enninful then sent Meghan text messages of support during her television interview with Oprah Winfrey in 2021.\nHowever, in April this year, he came under attack from the so-called 'Sussex Squad' of Meghan fans for writing a Time Magazine essay praising King Charles III.\nKaty Perry\n \n \n \n \n \n \n \n \n \nMeghan has been claimed to hold a 'grudge' against the singer Katy Perry over a critical comment made about her wedding dress.\nDuring a promotional tour in the US for American Idol in May 2018, Perry joked to Entertainment Tonight she 'would've done one more fitting' in relation to the dress at St George's Chapel.\nA source told the Daily Star in August 2022: 'Meghan is keenly aware of a comment that Katy Perry made in 2018 about her wedding dress and is notorious for holding a grudge.\n'While the comment wasn't meant to be hurtful, Meghan felt under siege at that time and was overwhelmed by arguments with staff, the Duchess of Cambridge, and Thomas Markle.'\nHowever, this did not stop Harry making friends with actor Orlando Bloom, who is Perry's fiancé, after the family moved to Montecito.\nIn May, Perry sang at the King's Coronation concert in front of 20,000 members of the public and invited guests at Windsor Castle. Harry did not attend, after leaving Britain to return to California shortly after the Coronation ceremony itself.\nPrince William and Kate \n \n \n \n \n \n \n \nPrince Harry once referred to Kate Middleton as the 'sister he never had', but she and his wife Meghan had an extraordinary series of fallings out after she entered the royal fold.\nHarry is said to have introduced Kate to Meghan in January 2017 after they had been dating for six months, with Meghan having met Prince William two months earlier.\nMeghan revealed she was 'barefoot' and wearing ripped jeans when she first met Kate, saying in the Netflix documentary that she did not know the 'formality' continues behind closed doors and that she is a 'hugger' – which she did not realise was 'jarring for some Brits'.\nHarry claimed in his book Spare that Meghan asked to borrow a lip-gloss from Kate ahead of their appearance at the first Royal Foundation forum summit in 2018 – and Kate was surprised, but rummaged around in her bag before offering it to Meghan.\nHarry then claimed that Meghan applied a little gloss to her finger, and rubbed it across her lips, before Kate made a 'disgusted' face.\nThe Duke also wrote in Spare about how the women were both left in tears during the infamous bridesmaid dress row.\nIt was initially claimed Meghan had made Kate cry during a row over the outfits.\nBut Meghan later disagreed in her Oprah interview in 2021, claiming: 'She [Kate] was upset about something, but she owned it, and she apologised. And she brought me flowers'.\nHarry also wrote about various rows between the two couples, although Omid Scobie has insisted on The Heirpod podcast that the Duchesses were 'never at war' – but their relationship lacked any 'depth'.\nThe two women have rarely appeared in public in recent years – although they did come together for the Queen's funeral events in 2022 and meet well-wishers.\nHowever, Meghan did not attend the Coronation – with Harry only making a swift visit, then returning home to California, where she had stayed with their children.\n\n\n\n\n\n\n\n\nShare or comment on this article: \n                        \n\n\nInside Prince Harry and Meghan's ever-changing friendship group and 'feuds' with ex-pals\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ne-mail\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n81\n\n\nshares\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nComments \n91\n\n\n\n\t    Share what you think\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNewest\n\n\n\n\n\n\n\n\n\n\nOldest\n\n\n\n\n\n\n\n\n\n\nBest rated\n\n\n\n\n\n\n\n\n\n\nWorst rated\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nView all\n\n\n\n\n\n\n\n\n\n\nThe comments below have been moderated in advance.\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nView all\n\n\n\n\n\n\n\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    \n\n\n\n\n\n\nWe are no longer accepting comments on this article.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBing\n\n\n\n\n\n\nSite\n\n\nWeb\n\n\n\n\n\n\nEnter search term:\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n \n\n\nROYALS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Through the palace keyhole... by those who were there\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lionel Richie reveals being selected for Coronation Concert was honor\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Ferguson breaks her silence after coronation snub\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          King Charles 'asked Katy Perry for selfie' for a private secretary\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry and William 'have no plans for reunion during coronation visit'\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          REVEALED: Prince Andrew WON'T write tell-all memoir like Harry\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The best quotes from Harry and Meghan's shocking Oprah interview\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Prince Harry will attend Coronation but Meghan will stay in California\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          DAN WOOTTON: Has Meghan swerved Coronation in fear of being booed?\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Queen Letizia channels Spring with colourful floral dress\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Queen Camilla 'hurt' by Prince Harry branding her a 'villain' in Spare\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Connection between six women revealed as Kate Middleton's ASTROTWINS\n          \n\n          \n           \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDON'T MISS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC bosses will meet with Scotland Yard TODAY over sex pics scandal after under-fire corporation suspends top presenter\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne responds to suggestions she shut down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie's big moment in black! Margot Robbie surprises fans by ditching pink for star-studded LA premiere and recreating vintage gown from 1960 doll\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Now that's one way to upstage Barbie! Dua Lipa goes braless under sheer chainmail gown and wears skimpy thong at star-studded premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          SAS: Who Dares Wins star 'becomes fastest walk out ever as they quit 30 minutes into first day of filming'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Flavour of summer: Try these top 10 food and drink brands to elevate your sunshine dining\n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Shocking moment Harry Styles winces as he is hit in the face with a flying object while on stage in Vienna during tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Geri Horner looks effortlessly stylish in a white denim jumpsuit as she attends the Formula One Aramco British Grand Prix with son Monty\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island UK's Jessie Wynter and Will Young reveal their surprise baby plans - as couple share intimate details about their relationship\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jamie Foxx seen smiling and waving to fans on a boat while cruising the Chicago River... in first sighting nearly three months after mysterious illness\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian risks MORE wrath from her sister as she wears black veil with sexy dress to D&G party after ugly copycat war over 'wedding vibes'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hugh Jackman 'strict dating rules' for his daughter Ava, 18, as she starts her last year of school: 'He knows he can't stop this'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gal Gadot rocks a leggy look with sideboob at Barbie premiere in LA... after Margot Robbie revealed the actress was her first choice for lead doll role \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Man City star Erling Haaland shows off his snazzy sense of style in a pale blue suit as he joins Isabel Johansen at the Dolce and Gabbana show in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          A city of contrasts! Get to know the REAL Hong Kong with our neighbourhood guide \n          \n\n\nAd Feature\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Star BBC presenter at the centre of the £35,000 teenage sex pics scandal 'phoned the youngster when he was exposed\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Barbie social media reactions are in: Critics praise Margot Robbie while some think Ryan Gosling is Oscar-worthy... but criticize the 'bloated' story \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Nicki Minaj showcases her curves in a figure-hugging lavender ensemble as she attends the Barbie premiere in Los Angeles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles' rumored girlfriend Taylor Russell FUELS romance speculation as she sits VIP at singer's Love On Tour concert in Vienna\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The steps couples can take now to help protect their home from future care cost fees. Legal expert Paul King explains.... \n          \n\n\nAdvertising\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Billie Eilish shows off her unique style in black slacks with pink pinstripe shirt and tie at premiere of Barbie in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Liam Payne reveals he spent time in a wellness clinic after hitting 'rock bottom'  and admits ex Cheryl and 1D bandmates 'came to his rescue'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian unfiltered! Reality star reveals her REAL complexion in rare make-up free outing on holiday in Idaho with daughter North\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Elsa Pataky, 46, shows off her sensational figure in a cleavage-baring bikini while Chris Hemsworth flaunts his rippling muscles in Ibiza\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          COMPETITION: WIN A PAIR OF TICKETS TO BOTH WIMBLEDON SINGLES FINALS, COURTESY OF PIMM'S\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Busting out in Sin City! Shane Warne's daughter Summer flaunts her eye-popping cleavage in bikinis as she parties in Vegas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ferne McCann gives birth! Ex-TOWIE star welcomes her second daughter with fiancé Lorri Haines\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Madonna, 64, spotted back on her feet on New York stroll 11 days after she 'was revived with Narcan to combat septic shock' and rushed to ICU\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mark Ronson puts on a stylish display in lavender blazer and brown trousers while posing with wife Grace Gummer at Barbie premiere in LA\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rita Wilson posts tender birthday tribute to husband Tom Hanks on Instagram to celebrate him turning age 67\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Antiques Roadshow guest astounded at eye-watering value of Live Aid poster he saved from the bin after working at 1985 fundraising concert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jessica Alba puts on a stylish display as she joins a glamorous Myleene Klass and a daring Lottie Moss to watch Lana Del Rey at BST Hyde Park\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'He's about to cause CHAOS in this villa!' Viewers revel in the drama after Tyrique's FUMING reaction to seeing Ella's Casa Amor antics\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: 'You've not spoken for four weeks and now look at you!' Scott launches rude attack on Leah in explosive war of words during movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Don't miss these early Prime Day deals! 20 of the BEST savings you can shop already on Amazon - from Shark vacuums to Ninja air fryers with up to 65% off \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chris Hemsworth shares a sweet birthday tribute to his handsome father Craig as they party in Mykonos with best pal Matt Damon and family\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island viewers demand Catherine be dumped from the villa as fans accuse her of 'bullying' ex Scott after footage of her kiss with Elom is shown\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lana Del Rey breaks her silence on her controversial Glastonbury gig after arriving on stage 30 minutes late and having her microphone cut off\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gimme Shelter! Georgia May Jagger strips down to a Burberry bikini and wellies as she unveils the perfect outfit for  'unpredictable weather'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise 'barred' Peter Overton from the Mission Impossible red carpet after actor rowed with the Nine news presenter during tense 60 Minutes interview \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Insidious: The Red Door ends the box office reign of Indiana Jones after just one week with an impressive $32.6 million\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Janet Jackson breaks personal record earning $51M during 38-date Together Again Tour: 'This is the most fun I've had on any tour!'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Mission Crocodile? Tom Cruise 'wants to recruit Robert Irwin into Scientology' after meeting at MI premiere: 'He sees potential'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tyga flashes a smile as he leaves Nobu in Malibu after grabbing lunch with friends... amid potential rekindling of romance with Avril Lavigne\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I can't believe how much hair I got off': Pet owners say they're 'amazed' at how much hair this £12.99 double-sided brush removes - it makes grooming a breeze \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joanna Page reveals when her Gavin and Stacey co-stars will 'reunite' for new show \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chelsea Handler serves up drinks to A-list stars Katy Perry, Orlando Bloom and more as Bruce Springsteen rocks London\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sofia Vergara, 50, sizzles in neon green swimsuit as she celebrates 30 million Instagram followers during Italian getaway\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Selling Sunset star Mary Fitzgerald shares a passionate kiss with husband Romain Bonnet during romantic summer getaway in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Maya Jama narrowly avoids a wardrobe malfunction in her super short dress as she makes VERY cheeky comment on Love Island Aftersun \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Strictly's Katya Jones 'is dating handsome property mogul and former footballer four years younger than her as the pair enjoy string of dinners out'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island Aftersun viewers go wild for one Islander's dad as they gush over the 'silver fox straight out of a romance novel' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Movie Night reveals all as Tyrique fumes at Ella's antics and viewers demand Catherine leave the villa - everything you missed on Love Island\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Logan Paul puts on a loved-up display with fiancee Nina Agdal as the newly-engaged couple go sightseeing with their parents in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner goes make-up free for boxing class in LA... after signing on to reprise her action role as Elektra\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Vanessa Bryant shares sweet throwback photos while celebrating daughter Capri's 4th birthday during a family trip to Walt Disney World\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I'm ready for your downfall!' Love Island viewers delighted as justice is served for Montel during dramatic Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Start your engines! Lara Bingle looks chic in a cut-out bodysuit and baggy jeans as she poses with husband Sam Worthington at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ruby Rose reveals the hardest thing about living in America - and the most surprising change in Australia since returning Down Under\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Serving up some style! Phoebe Dynevor, Emma Corrin and Lila Moss lead the All England Tennis and Croquet Club glamour as Wimbledon continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne stuns in a cleavage-enhancing black dress as she joins Florence Pugh and Geri Horner among the celebrity spectators at the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama shuts down boos for Catherine on Aftersun as studio audience turns hostile over her berating Scott \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'We can't wait for you baby!' Everton footballer Jordan Pickford and wife Megan announce they're expecting second child together\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island: Jess breaks down as Sammy's VERY revealing chats with Mal are shown during drama-filled movie night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Jack Grealish goes shirtless as his boozy pre-season holiday continues at an Ibiza beach bar\n          \n\n          \n          Letting his hair down  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Met confirms it HAS spoken to the BBC about suspended star over claims he paid teen £35k for sexually explicit photos \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Braless Ellie Goulding wears a striking pleather dress (but ditches the wedding ring) as she takes her seat in the Wimbledon Royal Box \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Chad Michael Murray subtly reveals the sex of his and pregnant wife Sarah Roemer's third baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          An excited Shakira sings on her way to the British Grand Prix to watch Lewis Hamilton amid romance rumours with the racing driver\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          All My Children star Jeffrey Carlson, who made history playing first trans character on daytime television, 'dies at 48'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lottie Moss, 25, flaunts her jaw-dropping figure in a sheer black dress as she leaves Chiltern Firehouse at 4am with older American lawyer \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          David Beckham filmed painting a HUGE mural of Lionel Messi in Miami by wife Victoria as he gets set for soccer's biggest star to join his MLS team this week\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rami Malek holds hands with mystery blonde as he leaves hotel to head to concert where he was seen getting cosy with Emma Corrin\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Emma Corrin puts on a very animated display in a lemon yellow suit as they attend Wimbledon after sparking romance rumours with Rami Malek\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift does THAT viral Spider-Man meme pose with ex Taylor Lautner and his wife - after joining forces with him in new I Can See You video \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Netflix 'cancel controversial survival reality show after just one season in unexpected move'\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Cara Delevingne shuts down grid chat with Sky Sports' Martin Brundle, leaving F1 legend furious at British Grand Prix\n          \n\n          \n          Awkward \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jennifer Garner gushes about Taylor Swift as she watches the pop star perform in Kansas City: 'Our minds are still blown' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ryan Seacrest, 48, enjoys holiday in St. Tropez with his leggy girlfriend Aubrey Paige, 25\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Why are so many teetotal celebrities selling alcohol? Clean-living stars jumping on the lucrative booze bandwagon could lose their audience\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Walking with his heir... Singer Aled Jones is spotted walking around Notting Hill with his son Lucas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'Is that the worst ever Elvis impersonation?' Actor Damian Lewis is mocked on social media for his toe-curling rendition of the national anthem at Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'There was nothing clean going on in that shower!': Dua Lipa SHOCKS fans as they spot 'X-rated detail' in singer's lingerie-clad bathroom selfie\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian 'freaking out' after noticing mysterious shadow of a woman in the background of her makeup-free selfie \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lewis Capaldi appears in good spirits at Glasgow's TRNSMT Festival after Glastonbury heartache and cancelled tour amid his Tourette's struggles\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise smartens up in button down and jeans as he steps out in New York amid Mission: Impossible promotional tour \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EXCLUSIVE: Selena Gomez thinks it is 'creepy' there are 'similarities' between herself and Lily-Rose Depp in The Idol \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I cannot thank you all enough': Dancing On Ice star Matt Evers shares heartfelt words as he moves on from television job of 10 years\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sarah Jayne Dunn demonstrates her impressive pole dancing skills while showing off her jaw-dropping figure in sports bra and hotpants\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          This Morning bosses CONFIRM Alison Hammond and Dermot O'Leary's future on the ITV show amid their 'strained relationship'\n          \n\n          \n          Carrying on  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards insists rumors about a Morgan Wade romance are just speculation as she steps out for dinner with bestie Teddi Mellencamp\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Who's who in the Royal Box at Wimbledon on Middle Sunday? Ellie Goulding, Brian Cox and Daniel Kaluuya join famous faces at SW19\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n           Rami Malek looks close with The Crown's Emma Corrin at Bruce Springsteen concert - amid reports he's split from Lucy Boynton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Candy Spelling says Tori Spelling is 'doing great' amid Dean McDermott split: 'I support my daughter'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sean Penn, 62, and girlfriend Olga Korotyayeva, 43, lock lips during romantic getaway to St. Tropez\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller and her beau Oli Green watch Wimbledon just metres from her ex and close friend Tom Sturridge who is joined by his girlfriend Alexa Chung\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island host Maya Jama sets pulses racing as she displays her cleavage in a daring skin tight dress ahead of Movie Night in the villa\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island SPOILER: One couple is ripped apart and a huge row breaks out between two more islanders as secrets rock the villa in return of Movie Night\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Holly Ramsay climbs aboard a chopper with new boyfriend Adam Peaty and chef dad Gordon as they journey to Silverstone for the British Grand Prix\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jourdan Dunn goes braless beneath a lemon yellow sweater as she attends Wimbledon day seven with rapper fiancé Dion Hamilton\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Talk about stormy seas! A fascinating look inside the VERY turbulent lives of the Pirates of the Caribbean cast - 20 years after movie's premiere\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jeremy Vine threatens legal action against trolls as BBC stars line up to deny they are presenter accused of paying teen for sexual photos \n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce's mother Tina Knowles' Los Angeles-area home 'is burglarized with $1 MILLION in cash and jewelry stolen'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What a flightmare! From Keke Palmer's 'breast milk discrimination' to Matthew Lewis' rant  - a look back at bizarre celeb airport dramas\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Tom Cruise's changing look through the years: A glance back at the star's leading man evolution at his Mission: Impossible premieres\n          \n\n          \n          The passage of time  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Baby we were born to tongue! Katy Perry and Orlando Bloom share a passionate kiss as they attend star-studded Bruce Springsteen performance \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex-girlfriend Sarah Brady launches new attack on the 'emotionally abusive' actor claiming he had her 'turn down' jobs'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Ola and James Jordan reveal their plans to renew their vows at Elvis chapel during 20th anniversary trip to Las Vegas \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          William's posh posse VS Harry's band of brothers! Who's who in the warring siblings' friendship squads - and the pals who are  stuck in the middle \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sienna Miller, 41, turns heads in a pinstripe linen trouser-suit as she attends Wimbledon day seven hand-in-hand with Burberry model boyfriend Oli Green, 26\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Molly-Mae Hague stuns in a black sports set as she hits the shops with Tommy Fury and daughter Bambi after a family trip to Disneyland Paris\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Hypocrisy actually! Richard Curtis takes a seat at Wimbledon despite signing letter slamming tournament organisers for 'profiting from climate chaos' \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Alexa Chung looks as loved up as ever with boyfriend Tom Sturridge as they attend Wimbledon together amid engagement rumours\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Brad Pitt dons a racer's jumpsuit as he joins celebrity spectators at the British Grand Prix at Silverstone ahead of filming F1 movie Apex\n          \n\n          \n          .\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gavin and Stacey child star Oscar Hartland, 14, admits he has 'big plans' to spend his BBC pay when he's old enough after featuring in show as Neil the baby\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The true story behind Disney's new Belle: How Indian-Australian actress battled discrimination and a tough childhood before scoring starring roles \n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner is slammed for 'flaunting her wealth' as she shows off a $300k Birkin bag in now deleted TikTok post\n          \n\n          \n          Not happy  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC presenter 'who paid teenager £35k for sexually explicit pictures partied with bosses at an awards ceremony AFTER mother made complaint \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Omid Scobie's TOTAL transformation! His sycophantic portrayal of the Sussexes means they trust him to 'tell their truth'. What WILL they make of this?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Lila Moss puts on a chic display in an elegant  blue silk dress as she joins her boyfriend Yoni Helbitz for day seven of Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Celebrities descend on British Grand Prix amid tight security over fears of Just Stop Oil protest: Stars flock to Silverstone with bosses on high alert \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dame Emma Thompson's penchant for wild dancing continues as she cuts loose with Greg Wise at  Bruce Springsteen's BST Hyde Park gig\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Denise Welch says she loves waving to fans 'like Eva Perón' at The 1975 gigs but admits she misses having son Matty Healy 'to myself'\n          \n\n          \n          Proud mum  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Marcus Rashford unwinds alongside a bikini-clad brunette during pre-season trip to Ibiza with Manchester United  teammate Tyrell Malacia\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Four-poster for ONE! Are separate bedrooms the secret to King Charles and Queen Camilla's happy marriage?\n          \n\n          \n          Sleeping apart  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside historic Westminster home from Mary Poppins Returns and Sherlock Holmes films as it sells for £12MILLION\n          \n\n          \n          Pricey  \n        \n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Peter Andre, 50, hints he is ready to become a father for the FIFTH time with wife Emily MacDonagh, 33\n          \n\n          \n          The Aussie star is feeling broody  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Newly-engaged Nicole Scherzinger shows off her toned figure in leopard print sports bra and leggings as she soaks up the sun in Mykonos\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          What it's REALLY like to be BFFs with a supermodel: Inside the VERY charmed life of Emily Ratajkowski's best friend Babs Jeanne \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Relations between This Morning stars Alison Hammond and Dermot O'Leary are 'increasingly strained' after show revamp \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Leslie Mann lets her hair down as she joins Katy Perry and Orlando Bloom on the VIP platform at Bruce Springsteen's BST Hyde Park show\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Stunning 17th century estate made famous by Charlie and the Chocolate Factory and Midsomer Murders goes on the market for £6million \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Back for more! A dapper-looking Lord Frederick Windsor enjoys a second Wimbledon outing - and brings his brolly in case of rain\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Joel Edgerton and his Vogue editor partner Christine Centenera make a chic couple as they step out for a rare public appearance at Wimbledon\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          E-asy Street! Liz Truss quaffs champagne at Bruce Springsteen's Hyde Park concert - as London Mayor Sadiq Khan dons fan t-shirt in VIP area\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The WEIRDEST things thrown on stage: From ashes and cheese being lobbed at Pink to Harry Styles slipping on a kiwi... the very odd things chucked at stars\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's action stations! The Royals who like to roll up their sleeves whenever they get the chance...\n          \n\n          \n          It's not all castles and thrones for this lot  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Model Kelly Gale flaunts her pert derrière in a VERY racy swimsuit as she poses in the desert\n          \n\n          \n          Engaging sight in new social media snaps  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Even if the Doctor travelled 15 years back in time, 40-year-old Matt Smith would still be older than this companion! \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Seeing double! These celebrity doppelgängers say they always get mistaken for one another - so can you tell who is who?\n          \n\n          \n          Lookalikes  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Meet Wimbledon's wildest couple! Stefanos Tsitsipas and Paula Badosa have only been together since April but have a joint Instagram\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jonah Hill's ex Sarah Brady accuses him of being emotionally abusive and brand's him a 'misogynist' as she posts his alleged text messages\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'I have plans now!' Wimbledon wild card Elina Svitolina gifts Harry Styles tickets to a fellow Ukrainian and her young son - ahead of tense match \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          John Lydon reveals he sleeps next to his late wife Nora Forster's ashes after her death following a long battle with Alzheimer's three months ago\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aussie model Robyn Lawley reveals why meeting Leonardo DiCaprio at a party left her disappointed\n          \n\n          \n          Stopped having a crush on the Hollywood star \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It's famous for educating the Royals. But Kate Middleton has her own connection with Eton College, the most prestigious school in the country\n          \n\n\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Susan Anton is a timeless beauty at 72 as she's seen having lunch in Montecito before doing some light thrift shopping with husband\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Inside Tiffany Trump's VERY exclusive inner circle: FEMAIL lays bare the extravagant lives of her socialite best friends \n          \n\n          \n          High glamour \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Roger Moore's son to sell his father's James Bond memorabilia - including snow-suit he wore - to mark 50th anniversary of his first appearance as 007\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Aled Jones' actress daughter Emilia flashes her legs in a thigh-skimming miniskirt and gold blouse as she attends the Sundance Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kate Hudson cuts a stylish figure in a beige jumpsuit and wedge heels as she enjoys a day out with friends in London\n          \n\n          \n          Smart \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Taylor Swift dazzles as she takes to the stage in Kansas City... after ex John Mayer called for people to 'please be kind' following re-release of 2010 album\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Dua Lipa commands attention in a pink minidress and matching thigh-high boots as she follows the Barbiecore trend during her Greek holiday\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Jack Grealish cosies up to air hostess in Las Vegas nightclub while his childhood sweetheart girlfriend Sasha Attwood holidays in Italy\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Beyonce flashes the flesh in a glittering chain mini as she swirls through high-glam ensembles at Toronto stop of Renaissance Tour\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          BBC A-listers are forced to DENY they are the man at the centre of the sex pics scandal... as falsely accused Nicky Campbell reports trolls to Twitter \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Britney Spears asks God when she will 'smile again'... after getting 'slapped' in face during encounter with Victor Wembanyama's security guard\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Helen Skelton 'sells marital home she once shared with ex-husband Richie Myler as she moves on after their split'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          'It really is a dream come true': Stephanie Davis reveals she 'wrote a poem at 14 about being on Coronation Street' as she lands role in ITV soap\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kim Kardashian poses up at glamorous bash with best friend La La Anthony and cryptically declares: 'If you see us happy just leave us alone please'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          It was the European wedding of the decade. So why did Prince Albert of Monaco and  Charlene spend first night of honeymoon in SEPARATE hotels?\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Sydney Sweeney puts on a busty display in a sexy black satin bralette top during a trip to Mexico City to promote Armani's My Way perfume\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Television air date for 'inspiring' new John Farnham biopic Finding The Voice revealed as the cinema smash comes to Australia's Channel Seven\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Harry Styles is hit in the face once AGAIN by a flying object thrown by a fan during his Love On Tour concert in Vienna\n          \n\n          \n          Painful  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          The Banshees of Inisherin's Barry Keoghan 'splits up with his girlfriend Alyson Kierans after two-and-a-half years together'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Johnny Depp performs on stage with his rock band Hollywood Vampires in Manchester after saying he feels 'lucky' as his career revival continues\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Love Island's Davide Sanclimenti seen 'sniffing suspicious white powder' as he parties in Ibiza following shock split from Ekin-Su Culculoglu\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Spencer Matthews and Vogue Williams put on a loved-up display as they pose arm-in-arm at star-studded SEA LIFE London Aquarium VIP event\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Robin Wright cuts an elegant figure in cream gown as she is given the President's Award at the 57th Karlovy Vary International Film Festival\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Rebecca Humphries calls for teens to be taught about 'healthy' relationships to protect them from abuse... five years after split from Seann Walsh \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Paris Hilton stuns in a sequinned catsuit ahead of DJ set at Silverstone for British Grand Prix opening party\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          EMILY PRESCOTT: Elvis star Austin Butler left the building... incognito after departing London's exclusive Chiltern Firehouse\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Power couple Sarah Jessica Parker and Matthew Broderick are honored with Lifetime Achievement Awards at Bay Street Theater's annual summer gala\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Gary Lineker joins Jeremy Vine and Ryan Clark in blasting social media speculation that THEY are the 'household name' host at centre of BBC scandal\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Disney Channel star Skai Jackson ROASTED for running raffle with $5 entry fee where winner gets MacBook... despite her insisting: 'I do not need money'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kaye Adams dismisses rumours of feuds between Loose Women stars, insisting working on show is 'real belly laugh'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Danny Dyer shares plans to leave 'half a million in his will' to pet pooch, Debbie, in a bid to wind up his wife \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kylie Jenner showcases her summer-ready body in a skimpy green bikini as she soaks up the sun during a relaxing day by the pool\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Scout Willis proudly shows off her armpit hair and a hint of side boob while grocery shopping at Erewhon in LA with her boyfriend Jake Miller\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Olivia Wilde gives her outfit a quirky touch by throwing on a black jacket with pink pony patches for NYC errand run\n          \n\n          \n          Stepping out  \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          MAFS bride Davina Rankin reveals why she isn't interested in dating - following shock split with husband Jaxon Manuel after one year of marriage \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Kyle Richards and rumored flame Morgan Wade have almost IDENTICAL heart tattoos near wrists... as reality star claims they are just 'good friends'\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nBack to top\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\nNews\n\n\n\n\n\n\n\n\n\n\nRoyals\n\n\n\n\n\n\n\n\n\n\nU.S.\n\n\n\n\n\n\n\n\n\n\nSport\n\n\n\n\n\n\n\n\n\n\nTV&Showbiz\n\n\n\n\n\n\n\n\n\n\nFemail\n\n\n\n\n\n\n\n\n\n\nHealth\n\n\n\n\n\n\n\n\n\n\nScience\n\n\n\n\n\n\n\n\n\n\nMoney\n\n\n\n\n\n\n\n\n\n\nTravel\n\n\n\n\n\n\n\n\n\n\nBest Buys\n\n\n\n\n\n\n\n\n\n\nDiscounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n\nArchive\n\n\nVideo Archive\n\n\nAuthors\n\n\nTopics Index\n\n\nMobile Apps\n\n\nScreensaver\n\n\nRSS\n\n\nText-based site\n\n\nReader Prints\n\n\nOur Papers\n\n\nTop of page\n\n\n\n\nDaily Mail\n\n\nMail on\tSunday\n\n\nThis is Money\n\n\n\n\nMetro\n\n\nJobsite\n\n\nMail Travel\n\n\nZoopla.co.uk\n\n\nPrime Location\n\n\n\n\n\n\nPublished by Associated Newspapers Ltd\n\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\n\ndmg media\n\n\nContact us\n\n\nHow to complain\n\n\nLeadership Team\n\n\nAdvertise with us\n\n\nContributors\n\n\nTerms\n\n\nDo not sell or share my personal information\n\n\nAbout MailOnline\n\n\nPrivacy policy & cookies\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nAdvertisement\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": [
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html",
        "https://www.dailymail.co.uk/news/king-charles-iii/index.html",
        "https://www.dailymail.co.uk/news/prince_william/index.html",
        "https://www.dailymail.co.uk/news/kate_middleton/index.html",
        "https://www.dailymail.co.uk/news/prince_harry/index.html",
        "https://www.dailymail.co.uk/news/camilla-parker-bowles-duchess-of-cornwall/index.html",
        "https://www.dailymail.co.uk/news/article-11979283/Prince-Harry-William-no-plans-reunion-visits-King-Charles-coronation.html",
        "https://www.dailymail.co.uk/news/article-11970211/Prince-Andrew-WONT-write-tell-memoir-like-Harry.html",
        "https://www.dailymail.co.uk/news/article-9337377/Bombshell-bombshell-best-quotes-Harry-Meghans-shocking-Oprah-interview.html",
        "https://www.dailymail.co.uk/news/article-11965087/Prince-Harry-attend-Coronation-Meghan-stay-California.html",
        "https://www.dailymail.co.uk/news/article-11977047/Queen-Camilla-hurt-Prince-Harrys-blistering-attack-Spare-branded-villain.html",
        "https://www.dailymail.co.uk/news/royals/article-11976859/Written-stars-Celestial-connection-six-women-revealed-Kate-Middletons-ASTROTWINS.html",
        "https://www.dailymail.co.uk/news/article-12281853/BBC-bosses-meet-police-star-sex-pics-scandal.html",
        "https://www.dailymail.co.uk/news/article-12280841/Star-BBC-presenter-centre-35-000-teenage-sex-pics-scandal-phoned-youngster.html",
        "https://www.dailymail.co.uk/news/article-12279875/Culture-Secretary-hold-urgent-talks-BBC-claims-against-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280247/Damian-Lewis-mocked-social-media-toe-curling-national-anthem-British-Grand-Prix.html",
        "https://www.dailymail.co.uk/news/article-12280057/Jeremy-Vine-threatens-legal-action-against-trolls-amid-scandal-unnamed-BBC-presenter.html",
        "https://www.dailymail.co.uk/news/article-12280081/Jonah-Hills-ex-girlfriend-Sarah-Brady-launches-new-attack-emotionally-abusive-actor.html",
        "https://www.dailymail.co.uk/news/article-12280139/Richard-Curtis-takes-plush-seat-Wimbledon-Royal-Box-despite-slamming-tournament-organisers.html",
        "https://www.dailymail.co.uk/news/article-12279569/BBC-host-partied-bosses-awards-ceremony-sex-pictures-allegation-made.html",
        "https://www.dailymail.co.uk/news/article-12278371/What-Sussexes-make-Omid-Scobie-revelations.html",
        "https://www.dailymail.co.uk/news/article-12280191/Celebrities-descend-British-Grand-Prix-amid-tight-security-fears-Just-Stop-Oil-protest.html",
        "https://www.dailymail.co.uk/news/index.html",
        "https://www.dailymail.co.uk/news/royals/index.html"
    ]
}